
<!DOCTYPE HTML>
<html lang="cn" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第3章 云原生部署的演变 · 云原生基础设施 - cloudnativego.com</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="cloudnativego.com">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-ghcolors.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch04-designing-infrastructure-applicaitons.html" />
    
    
    <link rel="prev" href="ch02-when-to-adopt-cloud-native.html" />
    

    
        <link rel="shortcut icon" href='favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"CloudNativeInfra/cni","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://cloudnativego.com" target="_blank" class="custom-link">CloudNativeGo</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    关于本书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="foreword.html">
            
                <a href="foreword.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="introduction.html">
            
                <a href="introduction.html">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch01-what-is-cloud-native-infrastructure.html">
            
                <a href="ch01-what-is-cloud-native-infrastructure.html">
            
                    
                    第1章 什么是云原生基础设施？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch02-when-to-adopt-cloud-native.html">
            
                <a href="ch02-when-to-adopt-cloud-native.html">
            
                    
                    第2章 何时采用云原生
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="ch03-evolution-of-cloud-native-developments.html">
            
                <a href="ch03-evolution-of-cloud-native-developments.html">
            
                    
                    第3章 云原生部署的演变
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch04-designing-infrastructure-applicaitons.html">
            
                <a href="ch04-designing-infrastructure-applicaitons.html">
            
                    
                    第4章 设计基础架构应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch05-developing-infrastructure-applications.html">
            
                <a href="ch05-developing-infrastructure-applications.html">
            
                    
                    第5章 开发基础架构应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch06-testing-cloud-native-infrastructure.html">
            
                <a href="ch06-testing-cloud-native-infrastructure.html">
            
                    
                    第6章 测试云原生基础设施
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch07-managing-cloud-native-applications.html">
            
                <a href="ch07-managing-cloud-native-applications.html">
            
                    
                    第7章 管理云原生应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch08-securing-applications.html">
            
                <a href="ch08-securing-applications.html">
            
                    
                    第8章 保护应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch09-implementing-cloud-native-infrasctructure.html">
            
                <a href="ch09-implementing-cloud-native-infrasctructure.html">
            
                    
                    第9章 实现云原生基础设施
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="appendix-a-patterns-for-network-resiilency.html">
            
                <a href="appendix-a-patterns-for-network-resiilency.html">
            
                    
                    附录A 网络弹性模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="appendix-b-lock-in.html">
            
                <a href="appendix-b-lock-in.html">
            
                    
                    附录B 锁定
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="appendix-c-box-case-study.html">
            
                <a href="appendix-c-box-case-study.html">
            
                    
                    附录C Box：案例研究
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第3章 云原生部署的演变</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;3&#x7AE0;-&#x4E91;&#x539F;&#x751F;&#x90E8;&#x7F72;&#x7684;&#x6F14;&#x53D8;">&#x7B2C;3&#x7AE0; &#x4E91;&#x539F;&#x751F;&#x90E8;&#x7F72;&#x7684;&#x6F14;&#x53D8;</h1>
<p>&#x6211;&#x4EEC;&#x5728;&#x524D;&#x4E00;&#x7AE0;&#x4E2D;&#x8BA8;&#x8BBA;&#x4E86;&#x5728;&#x91C7;&#x7528;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E4B;&#x524D;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x3002;&#x5728;&#x90E8;&#x7F72;&#x4E4B;&#x524D;&#xFF0C;&#x9700;&#x8981;&#x6709;API&#x9A71;&#x52A8;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4F9B;&#x5E94;&#xFF08;IaaS&#xFF09;&#x3002;</p>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x63A2;&#x8BA8;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x62D3;&#x6251;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x5728;&#x4E91;&#x4E2D;&#x5B9E;&#x73B0;&#x5B83;&#x4EEC;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5B66;&#x4E60;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x63A7;&#x5236;&#x5176;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x5E38;&#x7528;&#x5DE5;&#x5177;&#x548C;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x90E8;&#x7F72;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x5E94;&#x8BE5;&#x662F;&#x80FD;&#x591F;&#x5C06;&#x5176;&#x8868;&#x8FF0;&#x51FA;&#x6765;&#x3002;&#x4F20;&#x7EDF;&#x4E0A;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x767D;&#x677F;&#x4E0A;&#x5904;&#x7406;&#xFF0C;&#x6216;&#x8005;&#x5982;&#x679C;&#x5E78;&#x8FD0;&#x7684;&#x8BDD;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x516C;&#x53F8;wiki&#x4E0A;&#x5B58;&#x50A8;&#x7684;&#x6587;&#x6863;&#x4E2D;&#x5904;&#x7406;&#x3002;&#x4ECA;&#x5929;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x7A0B;&#x5E8F;&#x5316;&#xFF0C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8868;&#x8FF0;&#x901A;&#x5E38;&#x4EE5;&#x4FBF;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x89E3;&#x91CA;&#x7684;&#x65B9;&#x5F0F;&#x8BB0;&#x5F55;&#x3002;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#x8868;&#x8FF0;&#xFF0C;&#x5168;&#x9762;&#x7684;&#x8868;&#x8FF0;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x9700;&#x6C42;&#x662F;&#x4E0D;&#x53D8;&#x7684;&#x3002;</p>
<p>&#x6B63;&#x5982;&#x4EBA;&#x4EEC;&#x6240;&#x671F;&#x671B;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x7CBE;&#x5DE7;&#x7684;&#x4E91;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x53EF;&#x4EE5;&#x4ECE;&#x7B80;&#x5355;&#x7684;&#x8BBE;&#x8BA1;&#x5230;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x65E0;&#x8BBA;&#x590D;&#x6742;&#x6027;&#x5982;&#x4F55;&#xFF0C;&#x5FC5;&#x987B;&#x5BF9;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x8868;&#x73B0;&#x7ED9;&#x4E88;&#x9AD8;&#x5EA6;&#x7684;&#x91CD;&#x89C6;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x8BBE;&#x8BA1;&#x7684;&#x53EF;&#x91CD;&#x590D;&#x6027;&#x3002;&#x80FD;&#x591F;&#x6E05;&#x6670;&#x5730;&#x4F20;&#x9012;&#x60F3;&#x6CD5;&#x66F4;&#x4E3A;&#x91CD;&#x8981;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x660E;&#x786E;&#x3001;&#x51C6;&#x786E;&#x548C;&#x6613;&#x4E8E;&#x7406;&#x89E3;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7EA7;&#x8D44;&#x6E90;&#x8868;&#x8FF0;&#x52BF;&#x5728;&#x5FC5;&#x884C;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4E5F;&#x5C06;&#x4ECE;&#x5236;&#x4F5C;&#x7CBE;&#x826F;&#x7684;&#x8868;&#x8FF0;&#x4E2D;&#x83B7;&#x5F97;&#x5F88;&#x591A;&#x597D;&#x5904;&#xFF1A;</p>
<ul>
<li>&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8BBE;&#x8BA1;&#x53EF;&#x4EE5;&#x5171;&#x4EAB;&#x548C;&#x7248;&#x672C;&#x5316;&#x3002;</li>
<li>&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8BBE;&#x8BA1;&#x53EF;&#x4EE5;&#x88AB;fork&#x548C;&#x4FEE;&#x6539;&#x4EE5;&#x9002;&#x5E94;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x3002;</li>
<li>&#x8868;&#x8FF0;&#x9690;&#x542B;&#x7684;&#x662F;&#x6587;&#x6863;&#x3002;</li>
</ul>
<p>&#x968F;&#x7740;&#x672C;&#x7AE0;&#x5411;&#x524D;&#x63A8;&#x8FDB;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8868;&#x8FF0;&#x662F;&#x5982;&#x4F55;&#x6210;&#x4E3A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x90E8;&#x7F72;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x63A2;&#x7D22;&#x8868;&#x8FF0;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x80FD;&#x529B;&#x548C;&#x6F5C;&#x5728;&#x7F3A;&#x9677;&#x3002;</p>
<h2 id="&#x8868;&#x8FF0;&#x57FA;&#x7840;&#x8BBE;&#x65BD;">&#x8868;&#x8FF0;&#x57FA;&#x7840;&#x8BBE;&#x65BD;</h2>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7406;&#x89E3;&#x8868;&#x8FF0;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x4E24;&#x4E2A;&#x89D2;&#x8272;&#xFF1A;&#x4F5C;&#x8005;&#x548C;&#x89C2;&#x4F17;&#x3002;</p>
<p>&#x4F5C;&#x8005;&#x5C06;&#x5B9A;&#x4E49;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x4EBA;&#x7C7B;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x6216;&#x7BA1;&#x7406;&#x5458;&#x3002;&#x89C2;&#x4F17;&#x5C06;&#x8D1F;&#x8D23;&#x89E3;&#x91CA;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8868;&#x8FF0;&#x3002;&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x6267;&#x884C;&#x624B;&#x52A8;&#x6B65;&#x9AA4;&#xFF0C;&#x4F46;&#x5E0C;&#x671B;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x5206;&#x6790;&#x548C;&#x521B;&#x5EFA;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x90E8;&#x7F72;&#x5DE5;&#x5177;&#x3002;&#x4F5C;&#x8005;&#x5728;&#x51C6;&#x786E;&#x8868;&#x8FBE;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x65B9;&#x9762;&#x8868;&#x73B0;&#x5F97;&#x8D8A;&#x597D;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x542C;&#x4F17;&#x89E3;&#x91CA;&#x8868;&#x8FBE;&#x7684;&#x80FD;&#x529B;&#x4E2D;&#x83B7;&#x5F97;&#x66F4;&#x591A;&#x7684;&#x4FE1;&#x5FC3;&#x3002;</p>
<p>&#x521B;&#x4F5C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8868;&#x8FF0;&#x65F6;&#x4E3B;&#x8981;&#x5173;&#x5FC3;&#x7684;&#x662F;&#x8981;&#x8BA9;&#x89C2;&#x4F17;&#x4E86;&#x89E3;&#x5B83;&#x3002;&#x5982;&#x679C;&#x76EE;&#x6807;&#x53D7;&#x4F17;&#x662F;&#x4EBA;&#xFF0C;&#x5219;&#x8868;&#x8FF0;&#x53EF;&#x80FD;&#x4EE5;&#x6280;&#x672F;&#x56FE;&#x6216;&#x62BD;&#x8C61;&#x4EE3;&#x7801;&#x7684;&#x5F62;&#x5F0F;&#x51FA;&#x73B0;&#x3002;&#x5982;&#x679C;&#x76EE;&#x6807;&#x53D7;&#x4F17;&#x662F;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x90A3;&#x4E48;&#x8868;&#x793A;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x4FE1;&#x606F;&#x548C;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x65BD;&#x6B65;&#x9AA4;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x6709;&#x89C2;&#x4F17;&#xFF0C;&#x4F5C;&#x8005;&#x5E94;&#x8BE5;&#x8BA9;&#x89C2;&#x4F17;&#x66F4;&#x5BB9;&#x6613;&#x4F7F;&#x7528;&#x3002;&#x968F;&#x7740;&#x590D;&#x6742;&#x6027;&#x7684;&#x589E;&#x52A0;&#x4EE5;&#x53CA;&#x4EBA;&#x4E0E;&#x7A0B;&#x5E8F;&#x5171;&#x540C;&#x4F7F;&#x7528;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x8FD9;&#x5C06;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#x3002;</p>
<p>&#x8868;&#x793A;&#x6CD5;&#x9700;&#x8981;&#x6613;&#x4E8E;&#x7406;&#x89E3;&#xFF0C;&#x4EE5;&#x4FBF;&#x80FD;&#x591F;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x51C6;&#x786E;&#x5206;&#x6790;&#x3002;&#x6613;&#x4E8E;&#x9605;&#x8BFB;&#x4F46;&#x5206;&#x6790;&#x4E0D;&#x51C6;&#x786E;&#x7684;&#x8868;&#x8FF0;&#x5426;&#x5B9A;&#x4E86;&#x6574;&#x4E2A;&#x5DE5;&#x4F5C;&#x3002;&#x89C2;&#x4F17;&#x5E94;&#x8BE5;&#x603B;&#x662F;&#x52AA;&#x529B;&#x53BB;&#x89E3;&#x91CA;&#x4ED6;&#x4EEC;&#x7684;&#x8868;&#x8FF0;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x505A;&#x51FA;&#x5047;&#x8BBE;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x8868;&#x8FBE;&#x6210;&#x529F;&#xFF0C;&#x89E3;&#x91CA;&#x9700;&#x8981;&#x53EF;&#x9884;&#x6D4B;&#x3002;&#x5982;&#x679C;&#x4F5C;&#x8005;&#x5FFD;&#x7565;&#x4E86;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x90A3;&#x4E48;&#x6700;&#x597D;&#x7684;&#x89C2;&#x4F17;&#x5C31;&#x4F1A;&#x5F88;&#x5FEB;&#x5931;&#x8D25;&#x3002;&#x5177;&#x6709;&#x53EF;&#x9884;&#x6D4B;&#x6027;&#x5C06;&#x5728;&#x5E94;&#x7528;&#x53D8;&#x66F4;&#x65F6;&#x51CF;&#x5C11;&#x9519;&#x8BEF;&#x7684;&#x53D1;&#x751F;&#xFF0C;&#x5E76;&#x6709;&#x52A9;&#x4E8E;&#x5728;&#x4F5C;&#x8005;&#x548C;&#x53D7;&#x4F17;&#x4E4B;&#x95F4;&#x5EFA;&#x7ACB;&#x4FE1;&#x4EFB;&#x3002;</p>
<h3 id="&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x56FE;">&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x56FE;</h3>
<p>&#x6211;&#x4EEC;&#x7528;&#x5230;&#x4E86;&#x767D;&#x677F;&#xFF0C;&#x5F00;&#x59CB;&#x7ED8;&#x5236;&#x4E00;&#x5F20;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x56FE;&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x59CB;&#x4E8E;&#x5728;&#x89D2;&#x843D;&#x4E0A;&#x4EE3;&#x8868;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x4E91;&#x5F62;&#x72B6;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x6307;&#x5411;&#x65B9;&#x6846;&#x7684;&#x7BAD;&#x5934;&#x3002;&#x6BCF;&#x4E2A;&#x6846;&#x4EE3;&#x8868;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x7EC4;&#x4EF6;&#xFF0C;&#x7BAD;&#x5934;&#x8868;&#x793A;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x3002;&#x56FE;3-1&#x662F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x56FE;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;</p>
<p><img src="../images/f-3-1.jpg" alt="f-3-1"></p>
<p>&#x56FE;3-1. &#x7B80;&#x5355;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x56FE;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x6548;&#x7684;&#x5934;&#x8111;&#x98CE;&#x66B4;&#x548C;&#x5C06;&#x60F3;&#x6CD5;&#x4F20;&#x8FBE;&#x7ED9;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5B83;&#x5141;&#x8BB8;&#x5BF9;&#x590D;&#x6742;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8BBE;&#x8BA1;&#x8FDB;&#x884C;&#x5FEB;&#x901F;&#x800C;&#x5F3A;&#x5927;&#x7684;&#x8868;&#x793A;&#x3002;</p>
<p>&#x56FE;&#x7247;&#x9002;&#x7528;&#x4E8E;&#x4EBA;&#x7C7B;&#xFF0C;&#x5927;&#x91CF;&#x4EBA;&#x7FA4;&#x548C;CEO&#x3002;&#x8FD9;&#x4E9B;&#x56FE;&#x4E5F;&#x9002;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4F7F;&#x7528;&#x5E38;&#x7528;&#x8BED;&#x6765;&#x8868;&#x793A;&#x5173;&#x7CFB;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6B64;&#x6846;&#x53EF;&#x80FD;&#x4F1A;&#x5C06;&#x6570;&#x636E;&#x53D1;&#x9001;&#x5230;&#x90A3;&#x4E2A;&#x6846;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x5C06;&#x6570;&#x636E;&#x53D1;&#x9001;&#x5230;&#x5176;&#x4ED6;&#x6846;&#x3002;</p>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x56FE;&#x8868;&#x5BF9;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x6765;&#x8BF4;&#x51E0;&#x4E4E;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7406;&#x89E3;&#x7684;&#x3002;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x8FCE;&#x5934;&#x8D76;&#x4E0A;&#x4E4B;&#x524D;&#xFF0C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x56FE;&#x4ECD;&#x7136;&#x662F;&#x4E00;&#x4E2A;&#x4EE3;&#x8868;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x773C;&#x7403;&#x6765;&#x89E3;&#x91CA;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4EE3;&#x7801;&#x3002;</p>
<blockquote>
<p><strong>&#x4ECE;&#x56FE;&#x4E2D;&#x8FDB;&#x884C;&#x90E8;&#x7F72;</strong></p>
<p>&#x5728;&#x4F8B;3-1&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E2A;&#x6765;&#x81EA;bash_history&#x6587;&#x4EF6;&#x7684;&#x719F;&#x6089;&#x7684;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x3002;&#x5B83;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8FD0;&#x8425;&#x5546;&#xFF0C;&#x4F5C;&#x4E3A;&#x63CF;&#x8FF0;&#x57FA;&#x7840;&#x670D;&#x52A1;&#x5668;&#x4E0E;&#x7F51;&#x7EDC;&#x3001;&#x5B58;&#x50A8;&#x548C;&#x8F6C;&#x79DF;&#x670D;&#x52A1;&#x8FD0;&#x884C;&#x7684;&#x56FE;&#x8868;&#x7684;&#x53D7;&#x4F17;&#x3002;</p>
<p>&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x5DF2;&#x7ECF;&#x624B;&#x52A8;&#x90E8;&#x7F72;&#x4E86;&#x4E00;&#x53F0;&#x65B0;&#x7684;&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;SSH&#x8FDE;&#x63A5;&#x5230;&#x4E86;&#x8BE5;&#x673A;&#x5668;&#x5E76;&#x5F00;&#x59CB;&#x914D;&#x7F6E;&#x5B83;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4EBA;&#x7C7B;&#x5145;&#x5F53;&#x56FE;&#x89E3;&#x91CA;&#x8005;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x73AF;&#x5883;&#x4E2D;&#x91C7;&#x53D6;&#x884C;&#x52A8;&#x3002;</p>
<p>&#x5927;&#x591A;&#x6570;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5DE5;&#x7A0B;&#x5E08;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x4E2D;&#x90FD;&#x8FD9;&#x6837;&#x505A;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E9B;&#x6B65;&#x9AA4;&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x6765;&#x8BF4;&#x5E94;&#x8BE5;&#x662F;&#x975E;&#x5E38;&#x719F;&#x6089;&#x7684;&#x3002;</p>
</blockquote>
<p>&#x4F8B;3-1. bash_history</p>
<pre class="language-"><code class="lang-bash"><span class="token function">sudo</span> emacs /etc/networking/interfaces
<span class="token function">sudo</span> <span class="token function">ifdown</span> eth0
<span class="token function">sudo</span> <span class="token function">ifup</span> eth0
<span class="token function">sudo</span> <span class="token function">fdisk</span> -l
<span class="token function">sudo</span> emacs /etc/fstab
<span class="token function">sudo</span> <span class="token function">mount</span> -a
<span class="token function">sudo</span> systemctl <span class="token function">enable</span> kubelet
</code></pre>
<h3 id="&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x811A;&#x672C;">&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x811A;&#x672C;</h3>
<p>&#x5982;&#x679C;&#x60A8;&#x662F;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#xFF0C;&#x60A8;&#x5DE5;&#x4F5C;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x5728;&#x590D;&#x6742;&#x7CFB;&#x7EDF;&#x4E2D;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#xFF1B;&#x786E;&#x4FDD;&#x8FD9;&#x4E9B;&#x66F4;&#x6539;&#x662F;&#x6B63;&#x786E;&#x7684;&#x4E5F;&#x662F;&#x60A8;&#x7684;&#x8D23;&#x4EFB;&#x3002;&#x9700;&#x8981;&#x5C06;&#x8FD9;&#x4E9B;&#x53D8;&#x5316;&#x4F20;&#x64AD;&#x5230;&#x5E7F;&#x9614;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#x662F;&#x975E;&#x5E38;&#x73B0;&#x5B9E;&#x7684;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x4EBA;&#x4E3A;&#x9519;&#x8BEF;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;&#x7BA1;&#x7406;&#x5458;&#x4E3A;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x7F16;&#x5199;&#x4FBF;&#x5229;&#x811A;&#x672C;&#x5E76;&#x4E0D;&#x5947;&#x602A;&#x3002;</p>
<p>&#x811A;&#x672C;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x51CF;&#x5C11;&#x91CD;&#x590D;&#x4EFB;&#x52A1;&#x4E2D;&#x4EBA;&#x4E3A;&#x9519;&#x8BEF;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x4F46;&#x81EA;&#x52A8;&#x5316;&#x662F;&#x4E00;&#x628A;&#x53CC;&#x5203;&#x5251;&#x3002;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x51C6;&#x786E;&#x6027;&#x6216;&#x6210;&#x529F;&#x3002;</p>
<blockquote>
<p>&#x5BF9;&#x4E8E;SRE&#xFF0C;&#x81EA;&#x52A8;&#x5316;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x529B;&#x91CF;&#x500D;&#x589E;&#xFF0C;&#x5355;&#x5B83;&#x4E0D;&#x662F;&#x4E07;&#x80FD;&#x836F;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x52A0;&#x500D;&#x7684;&#x529B;&#x91CF;&#x5E76;&#x4E0D;&#x4F1A;&#x81EA;&#x7136;&#x5730;&#x6539;&#x53D8;&#x5E94;&#x7528;&#x529B;&#x7684;&#x51C6;&#x786E;&#x6027;&#xFF1A;&#x4E0D;&#x7ECF;&#x610F;&#x5730;&#x8FDB;&#x884C;&#x81EA;&#x52A8;&#x5316;&#x53EF;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x5F88;&#x591A;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x2014;&#x2014;Niall Murphy&#x3001;John Looney&#x548C;Kacirek&#xFF0C;&#x81EA;&#x52A8;&#x5316;&#x5728;&#x8C37;&#x6B4C;&#x7684;&#x6F14;&#x53D8;</p>
</blockquote>
<p>&#x7F16;&#x5199;&#x811A;&#x672C;&#x662F;&#x81EA;&#x52A8;&#x6267;&#x884C;&#x6B65;&#x9AA4;&#x4EE5;&#x4EA7;&#x751F;&#x6240;&#x9700;&#x7ED3;&#x679C;&#x7684;&#x597D;&#x65B9;&#x6CD5;&#x3002;&#x8BE5;&#x811A;&#x672C;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x5404;&#x79CD;&#x4EFB;&#x52A1;&#xFF0C;&#x4F8B;&#x5982;&#x5B89;&#x88C5;HTTP&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x914D;&#x7F6E;&#x5E76;&#x8FD0;&#x884C;&#x5B83;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x811A;&#x672C;&#x4E2D;&#x7684;&#x6B65;&#x9AA4;&#x5728;&#x8C03;&#x7528;&#x65F6;&#x5F88;&#x5C11;&#x8003;&#x8651;&#x5230;&#x5B83;&#x4EEC;&#x7684;&#x7ED3;&#x679C;&#x6216;&#x7CFB;&#x7EDF;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x811A;&#x672C;&#x662F;&#x7F16;&#x7801;&#x6570;&#x636E;&#xFF0C;&#x8868;&#x793A;&#x521B;&#x5EFA;&#x6240;&#x9700;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5E94;&#x8BE5;&#x53D1;&#x751F;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x53E6;&#x4E00;&#x4F4D;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x6216;&#x7BA1;&#x7406;&#x5458;&#x53EF;&#x4EE5;&#x8BC4;&#x4F30;&#x60A8;&#x7684;&#x811A;&#x672C;&#xFF0C;&#x5E76;&#x5E0C;&#x671B;&#x4E86;&#x89E3;&#x811A;&#x672C;&#x6B63;&#x5728;&#x505A;&#x4EC0;&#x4E48;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x4ED6;&#x4EEC;&#x4F1A;&#x89E3;&#x91CA;&#x4F60;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8868;&#x793A;&#x3002;&#x4E86;&#x89E3;&#x6240;&#x9700;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x6B65;&#x9AA4;&#x5982;&#x4F55;&#x5F71;&#x54CD;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x811A;&#x672C;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x4F1A;&#x6309;&#x7167;&#x5B83;&#x4EEC;&#x5B9A;&#x4E49;&#x7684;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x8FD9;&#x4E9B;&#x6B65;&#x9AA4;&#xFF0C;&#x4F46;&#x8FD0;&#x884C;&#x65F6;&#x4E0D;&#x77E5;&#x9053;&#x5B83;&#x6B63;&#x5728;&#x751F;&#x6210;&#x4EC0;&#x4E48;&#x3002;&#x811A;&#x672C;&#x662F;&#x4EE3;&#x7801;&#xFF0C;&#x811A;&#x672C;&#x7684;&#x6267;&#x884C;&#x7ED3;&#x679C;&#x5E0C;&#x671B;&#x662F;&#x6240;&#x9700;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;</p>
<p>&#x8FD9;&#x9002;&#x7528;&#x4E8E;&#x666E;&#x904D;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x4F46;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x7F3A;&#x9677;&#x3002;&#x6700;&#x660E;&#x663E;&#x7684;&#x7F3A;&#x9677;&#x662F;&#x8FD0;&#x884C;&#x76F8;&#x540C;&#x7684;&#x811A;&#x672C;&#x53EF;&#x80FD;&#x83B7;&#x5F97;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x5982;&#x679C;&#x811A;&#x672C;&#x7B2C;&#x4E00;&#x6B21;&#x8FD0;&#x884C;&#x7684;&#x73AF;&#x5883;&#x4E0E;&#x7B2C;&#x4E8C;&#x6B21;&#x8FD0;&#x884C;&#x7684;&#x73AF;&#x5883;&#x5927;&#x4E0D;&#x76F8;&#x540C;&#xFF1F;&#x4ECE;&#x79D1;&#x5B66;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x5C06;&#x7C7B;&#x4F3C;&#x4E8E;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x7F3A;&#x9677;&#xFF0C;&#x5E76;&#x4F1A;&#x4F7F;&#x5B9E;&#x9A8C;&#x6570;&#x636E;&#x65E0;&#x6548;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x811A;&#x672C;&#x6765;&#x8868;&#x793A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x7F3A;&#x9677;&#x662F;&#x7F3A;&#x5C11;&#x58F0;&#x660E;&#x72B6;&#x6001;&#x3002;&#x811A;&#x672C;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x4E0D;&#x7406;&#x89E3;&#x7ED3;&#x675F;&#x72B6;&#x6001;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EA;&#x63D0;&#x4F9B;&#x4E86;&#x6267;&#x884C;&#x6B65;&#x9AA4;&#x3002;&#x4EBA;&#x7C7B;&#x9700;&#x8981;&#x4ECE;&#x6B65;&#x9AA4;&#x4E2D;&#x89E3;&#x91CA;&#x7406;&#x60F3;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4EE5;&#x4E86;&#x89E3;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x6539;&#x53D8;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x770B;&#x5230;&#x8FC7;&#x5F88;&#x591A;&#x4EBA;&#x7C7B;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x968F;&#x7740;&#x914D;&#x7F6E;&#x811A;&#x672C;&#x590D;&#x6742;&#x6027;&#x7684;&#x589E;&#x957F;&#xFF0C;&#x6211;&#x4EEC;&#x89E3;&#x91CA;&#x811A;&#x672C;&#x7684;&#x80FD;&#x529B;&#x5C31;&#x4F1A;&#x51CF;&#x5F31;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x60A8;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x9875;&#x9700;&#x8981;&#x968F;&#x65F6;&#x95F4;&#x800C;&#x53D8;&#x5316;&#xFF0C;&#x811A;&#x672C;&#x5C06;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x9700;&#x8981;&#x66F4;&#x6539;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E0D;&#x5C06;&#x6B65;&#x9AA4;&#x62BD;&#x8C61;&#x4E3A;&#x58F0;&#x660E;&#x6027;&#x72B6;&#x6001;&#xFF0C;&#x4E3A;&#x4E86;&#x7ED9;&#x6BCF;&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x521D;&#x59CB;&#x72B6;&#x6001;&#x521B;&#x5EFA;&#x8FC7;&#x7A0B;&#xFF0C;&#x811A;&#x672C;&#x5C06;&#x4E0D;&#x65AD;&#x589E;&#x957F;&#x3002;&#x8FD9;&#x5305;&#x62EC;&#x62BD;&#x8C61;&#x51FA;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF08;&#x4F8B;&#x5982;apt&#x548C;DNF&#xFF09;&#x4E4B;&#x95F4;&#x7684;&#x6B65;&#x9AA4;&#x548C;&#x5DEE;&#x5F02;&#xFF0C;&#x4EE5;&#x53CA;&#x9A8C;&#x8BC1;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x8DF3;&#x8FC7;&#x54EA;&#x4E9B;&#x6B65;&#x9AA4;&#x3002;</p>
<p>&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x4EE3;&#x7801;&#x5E26;&#x6765;&#x4E86;&#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#xFF0C;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x62BD;&#x8C61;&#xFF0C;&#x4EE5;&#x5E2E;&#x52A9;&#x51CF;&#x8F7B;&#x4F7F;&#x7528;&#x811A;&#x672C;&#x7BA1;&#x7406;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x8D1F;&#x62C5;&#x3002;</p>
<blockquote>
<p><strong>&#x4ECE;&#x811A;&#x672C;&#x90E8;&#x7F72;</strong></p>
<p>&#x521B;&#x5EFA;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x53D1;&#x5C55;&#x662F;&#x5F00;&#x59CB;&#x91C7;&#x7528;&#x5148;&#x524D;&#x624B;&#x52A8;&#x7BA1;&#x7406;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x6D41;&#x7A0B;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x5C06;&#x5DE5;&#x4F5C;&#x5C01;&#x88C5;&#x5728;&#x811A;&#x672C;&#x4E2D;&#x6765;&#x7B80;&#x5316;&#x5B83;&#x3002;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;createVm.sh&#x7684;bash&#x811A;&#x672C;&#xFF0C;&#x5B83;&#x5C06;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x672C;&#x5730;&#x5DE5;&#x4F5C;&#x7AD9;&#x4E2D;&#x521B;&#x5EFA;&#x4E00;&#x53F0;&#x865A;&#x62DF;&#x673A;&#x3002;</p>
<p>&#x8BE5;&#x811A;&#x672C;&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x5206;&#x914D;&#x7ED9;&#x865A;&#x62DF;&#x673A;&#x4E0A;&#x7684;&#x7F51;&#x7EDC;&#x63A5;&#x53E3;&#x7684;&#x9759;&#x6001;IP&#x5730;&#x5740;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x4EE5;&#x5343;&#x5146;&#x5B57;&#x8282;&#x4E3A;&#x5355;&#x4F4D;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x5377;&#x5E76;&#x5C06;&#x5176;&#x6302;&#x8F7D;&#x5230;&#x865A;&#x62DF;&#x673A;&#x3002;</p>
<p>&#x793A;&#x4F8B;3-2&#x5C06;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x57FA;&#x672C;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#x663E;&#x793A;&#x4E3A;&#x811A;&#x672C;&#x3002;&#x8BE5;&#x811A;&#x672C;&#x5C06;&#x63D0;&#x4F9B;&#x65B0;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x5E76;&#x5728;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E0A;&#x8FD0;&#x884C;&#x4EFB;&#x610F;&#x914D;&#x7F6E;&#x811A;&#x672C;&#x3002;&#x8BE5;&#x811A;&#x672C;&#x53EF;&#x80FD;&#x6F14;&#x53D8;&#x4E3A;&#x9AD8;&#x5EA6;&#x53EF;&#x5B9A;&#x5236;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x80FD;&#x662F;&#xFF08;&#x5371;&#x9669;&#x5730;&#xFF09;&#x81EA;&#x52A8;&#x5316;&#x7684;&#xFF0C;&#x53EA;&#x9700;&#x70B9;&#x51FB;&#x4E00;&#x4E0B;&#x6309;&#x94AE;&#x5373;&#x53EF;&#x8FD0;&#x884C;&#x3002;</p>
</blockquote>
<p>&#x4F8B;3-2. &#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x811A;&#x672C;</p>
<pre class="language-"><code class="lang-bash"><span class="token shebang important">#!/bin/bash</span>

<span class="token comment" spellcheck="true"># Create a VM with a NIC on 10.0.0.17 and a 100gb volume</span>

createVm.sh 10.0.0.17 100

<span class="token comment" spellcheck="true"># Transfer the bootstrapping script</span>

<span class="token function">scp</span> ~/vm_provision.sh user@10.0.0.17:vm_provision.sh -v

<span class="token comment" spellcheck="true"># Run the bootstrap script</span>

<span class="token function">ssh</span> user@10.0.0.17 sh ~/vm_provision.sh
</code></pre>
<h3 id="&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x4EE3;&#x7801;">&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x4EE3;&#x7801;</h3>
<p>&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x66FE;&#x7ECF;&#x662F;&#x4EE3;&#x8868;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x4E3B;&#x8981;&#x89D2;&#x8272;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x89C6;&#x4E3A;&#x62BD;&#x8C61;&#x811A;&#x672C;&#xFF0C;&#x81EA;&#x52A8;&#x8003;&#x8651;&#x521D;&#x59CB;&#x72B6;&#x6001;&#x4EE5;&#x6267;&#x884C;&#x6B63;&#x786E;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x5141;&#x8BB8;&#x4F5C;&#x8005;&#x58F0;&#x660E;&#x8282;&#x70B9;&#x7684;&#x671F;&#x671B;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5B9E;&#x73B0;&#x5B83;&#x6240;&#x9700;&#x7684;&#x6BCF;&#x4E00;&#x6B65;&#x3002;</p>
<p>&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x662F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x4EE3;&#x7801;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x4F46;&#x76F8;&#x5173;&#x5DE5;&#x5177;&#x5F88;&#x5C11;&#x8D85;&#x51FA;&#x5355;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8303;&#x56F4;&#x3002;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#x5728;&#x5B9A;&#x4E49;&#x7279;&#x5B9A;&#x8D44;&#x6E90;&#x548C;&#x4ED6;&#x4EEC;&#x7684;&#x72B6;&#x6001;&#x65B9;&#x9762;&#x505A;&#x5F97;&#x975E;&#x5E38;&#x51FA;&#x8272;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x9700;&#x8981;&#x8D44;&#x6E90;&#x4E4B;&#x95F4;&#x7684;&#x534F;&#x8C03;&#xFF0C;&#x6240;&#x4EE5;&#x51FA;&#x73B0;&#x4E86;&#x590D;&#x6742;&#x6027;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x670D;&#x52A1;&#x7684;DNS&#x6761;&#x76EE;&#x5728;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x4E4B;&#x524D;&#x4E0D;&#x53EF;&#x7528;&#x3002;&#x5728;&#x4E3B;&#x673A;&#x53EF;&#x7528;&#x4E4B;&#x524D;&#x4E0D;&#x5E94;&#x8BE5;&#x63D0;&#x4F9B;&#x8BE5;&#x670D;&#x52A1;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x80FD;&#x5728;&#x72EC;&#x7ACB;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x534F;&#x8C03;&#x591A;&#x4E2A;&#x8D44;&#x6E90;&#xFF0C;&#x5219;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x63D0;&#x4F9B;&#x7684;&#x62BD;&#x8C61;&#x5316;&#x662F;&#x4E0D;&#x8DB3;&#x7684;&#x3002;&#x6709;&#x4E9B;&#x5DE5;&#x5177;&#x589E;&#x52A0;&#x4E86;&#x534F;&#x8C03;&#x8D44;&#x6E90;&#x4E4B;&#x95F4;&#x914D;&#x7F6E;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4F46;&#x534F;&#x8C03;&#x901A;&#x5E38;&#x662F;&#x7A0B;&#x5E8F;&#x6027;&#x7684;&#xFF0C;&#x8D23;&#x4EFB;&#x843D;&#x5230;&#x4E86;&#x4EBA;&#x4EEC;&#x7684;&#x534F;&#x8C03;&#x8D44;&#x6E90;&#x548C;&#x7406;&#x89E3;&#x6240;&#x9700;&#x72B6;&#x6001;&#x4E0A;&#x3002;</p>
<p>&#x60A8;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E0D;&#x5305;&#x542B;&#x6CA1;&#x6709;&#x901A;&#x4FE1;&#x7684;&#x72EC;&#x7ACB;&#x5B9E;&#x4F53;&#x3002;&#x4EE3;&#x8868;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x5DE5;&#x5177;&#x9700;&#x8981;&#x8003;&#x8651;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x9700;&#x8981;&#x53E6;&#x4E00;&#x79CD;&#x8868;&#x793A;&#x6765;&#x7BA1;&#x7406;&#x4F4E;&#x7EA7;&#x522B;&#x62BD;&#x8C61;&#xFF08;&#x4F8B;&#x5982;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF09;&#x4EE5;&#x53CA;&#x4F9B;&#x5E94;&#x548C;&#x534F;&#x8C03;&#x3002;</p>
<p>2014&#x5E74;7&#x6708;&#xFF0C;&#x6709;&#x4E2A;&#x5F00;&#x6E90;&#x5DE5;&#x5177;&#x5728;&#x4EE3;&#x7801;&#x53D1;&#x5E03;&#x7684;&#x65F6;&#x5019;&#x91C7;&#x7528;&#x4E86;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x62BD;&#x8C61;&#x6982;&#x5FF5;&#x3002;&#x8FD9;&#x4E2A;&#x540D;&#x4E3A;Terraform&#x7684;&#x5DE5;&#x5177;&#x975E;&#x5E38;&#x6210;&#x529F;&#x3002;&#x5B83;&#x5728;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x5B8C;&#x5584;&#x5E76;&#x4E14;&#x516C;&#x6709;&#x4E91;&#x7684;&#x91C7;&#x7528;&#x5448;&#x4E0A;&#x5347;&#x8D8B;&#x52BF;&#x7684;&#x65F6;&#x95F4;&#x8282;&#x70B9;&#x53D1;&#x5E03;&#x3002;&#x7528;&#x6237;&#x770B;&#x5230;&#x4E86;&#x65B0;&#x73AF;&#x5883;&#x4E2D;&#x5DE5;&#x5177;&#x7684;&#x5C40;&#x9650;&#x6027;&#xFF0C;Terraform&#x5F88;&#x597D;&#x7684;&#x6EE1;&#x8DB3;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<blockquote>
<p>&#x5728;2011&#x5E74;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x521D;&#x5C06;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x89C6;&#x4EE3;&#x7801;&#x3002;&#x6211;&#x4EEC;&#x6CE8;&#x610F;&#x5230;&#x6211;&#x4EEC;&#x6B63;&#x5728;&#x7F16;&#x5199;&#x5DE5;&#x5177;&#x6765;&#x89E3;&#x51B3;&#x8BB8;&#x591A;&#x9879;&#x76EE;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x5E0C;&#x671B;&#x5C06;&#x6D41;&#x7A0B;&#x6807;&#x51C6;&#x5316;&#x3002;</p>
<p>&#x2014;&#x2014;Hashicorp&#x9996;&#x5E2D;&#x6267;&#x884C;&#x5B98;&#x517C;Terraform&#x521B;&#x59CB;&#x4EBA;Mitchell Hashimoto</p>
</blockquote>
<p>Terraform&#x4F7F;&#x7528;&#x4E13;&#x95E8;&#x7684;&#x9886;&#x57DF;&#x7279;&#x5B9A;&#x8BED;&#x8A00;&#xFF08;DSL&#xFF09;&#x8868;&#x793A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x5B83;&#x5728;&#x4EBA;&#x7C7B;&#x53EF;&#x7406;&#x89E3;&#x7684;&#x56FE;&#x50CF;&#x548C;&#x673A;&#x5668;&#x53EF;&#x5206;&#x6790;&#x7684;&#x4EE3;&#x7801;&#x4E4B;&#x95F4;&#x505A;&#x4E86;&#x826F;&#x597D;&#x7684;&#x6298;&#x8877;&#x3002;Terraform&#x6700;&#x6210;&#x529F;&#x7684;&#x90E8;&#x5206;&#x662F;&#x62BD;&#x8C61;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x89C6;&#x56FE;&#xFF0C;&#x8D44;&#x6E90;&#x534F;&#x8C03;&#x4EE5;&#x53CA;&#x5E94;&#x7528;&#x65F6;&#x5229;&#x7528;&#x73B0;&#x6709;&#x5DE5;&#x5177;&#x7684;&#x80FD;&#x529B;&#x3002;Terraform&#x4E0E;&#x4E91;API&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x4EE5;&#x914D;&#x7F6E;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x5E76;&#x53EF;&#x5728;&#x5FC5;&#x8981;&#x65F6;&#x4F7F;&#x7528;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x6765;&#x914D;&#x7F6E;&#x8282;&#x70B9;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x8BE5;&#x884C;&#x4E1A;&#x7684;&#x6839;&#x672C;&#x6027;&#x8F6C;&#x53D8;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E00;&#x6B21;&#x6027;&#x914D;&#x7F6E;&#x811A;&#x672C;&#x6B63;&#x5728;&#x6D88;&#x5931;&#x3002;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x8FD0;&#x8425;&#x5546;&#x5F00;&#x59CB;&#x5728;&#x65B0;&#x7684;DSL&#x4E2D;&#x5F00;&#x53D1;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8868;&#x793A;&#x3002;&#x8FC7;&#x53BB;&#x5728;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E0A;&#x624B;&#x52A8;&#x64CD;&#x4F5C;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x73B0;&#x5728;&#x6B63;&#x5728;&#x5F00;&#x53D1;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x65B0;&#x7684;DSL&#x89E3;&#x51B3;&#x4E86;&#x5C06;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8868;&#x793A;&#x4E3A;&#x811A;&#x672C;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x6210;&#x4E3A;&#x8868;&#x793A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x6807;&#x51C6;&#x3002;&#x5DE5;&#x7A0B;&#x5E08;&#x53D1;&#x73B0;&#x4ED6;&#x4EEC;&#x6B63;&#x5728;&#x5F00;&#x53D1;&#x66F4;&#x597D;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;Terraform&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x89E3;&#x91CA;&#x3002;&#x4E0E;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x4EE3;&#x7801;&#x4E00;&#x6837;&#xFF0C;&#x5DE5;&#x7A0B;&#x5E08;&#x4EEC;&#x5F00;&#x59CB;&#x5C06;&#x4ED6;&#x4EEC;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8868;&#x8FF0;&#x5B58;&#x50A8;&#x5728;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5E76;&#x5C06;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E0E;&#x8F6F;&#x4EF6;&#x7B49;&#x540C;&#x770B;&#x5F85;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x8868;&#x8FF0;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x6807;&#x51C6;&#x5316;&#x65B9;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x6446;&#x8131;&#x4E86;&#x5B66;&#x4E60;&#x5404;&#x79CD;&#x4E13;&#x6709;&#x4E91;API&#x7684;&#x75DB;&#x82E6;&#x3002;&#x5C3D;&#x7BA1;&#x5E76;&#x975E;&#x6240;&#x6709;&#x4E91;&#x8D44;&#x6E90;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x5355;&#x4E00;&#x8868;&#x793A;&#x62BD;&#x8C61;&#x51FA;&#x6765;&#xFF0C;&#x4F46;&#x5927;&#x591A;&#x6570;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x5176;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x4E91;&#x9501;&#x5B9A;&#x3002;&#x62E5;&#x6709;&#x4EBA;&#x7C7B;&#x53EF;&#x8BFB;&#x5E76;&#x4E14;&#x673A;&#x5668;&#x53EF;&#x89E3;&#x6790;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8868;&#x793A;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#x8D44;&#x6E90;&#x58F0;&#x660E;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x6C38;&#x8FDC;&#x5F97;&#x6539;&#x53D8;&#x4E86;&#x884C;&#x4E1A;&#x3002;</p>
<blockquote>
<p><strong>&#x4ECE;&#x4EE3;&#x7801;&#x90E8;&#x7F72;</strong></p>
<p>&#x5728;&#x9762;&#x4E34;&#x5C06;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x90E8;&#x7F72;&#x4E3A;&#x811A;&#x672C;&#x7684;&#x6311;&#x6218;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x6765;&#x89E3;&#x6790;&#x8F93;&#x5165;&#x5E76;&#x9488;&#x5BF9;&#x6211;&#x4EEC;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x91C7;&#x53D6;&#x884C;&#x52A8;&#x3002;</p>
<p>&#x4F8B;3-3&#x663E;&#x793A;&#x4E86;&#x4ECE;Terraform&#x5F00;&#x6E90;&#x5E93;&#x4E2D;&#x83B7;&#x53D6;&#x7684;Terraform&#x914D;&#x7F6E;&#x3002;&#x6CE8;&#x610F;&#x4EE3;&#x7801;&#x4E2D;&#x6709;&#x53D8;&#x91CF;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x89E3;&#x6790;&#x3002;</p>
<p>&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x58F0;&#x660E;&#x6027;&#x8868;&#x793A;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6CA1;&#x6709;&#x5B9A;&#x4E49;&#x521B;&#x5EFA;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x5404;&#x4E2A;&#x6B65;&#x9AA4;&#x3002;&#x8FD9;&#x4F7F;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x5206;&#x79BB;&#x9700;&#x8981;&#x8C03;&#x914D;&#x7684;&#x90E8;&#x5206;&#x548C;&#x8C03;&#x914D;&#x7684;&#x90E8;&#x5206;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4F7F;&#x8FD9;&#x79CD;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4EE3;&#x8868;&#x6210;&#x4E3A;&#x65B0;&#x8303;&#x4F8B;&#x7684;&#x539F;&#x56E0;&#xFF1B;&#x8FD9;&#x4E5F;&#x662F;&#x5411;&#x8F6F;&#x4EF6;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x6F14;&#x8FDB;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x3002;</p>
<p>&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x8868;&#x793A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5BF9;&#x4E8E;&#x5DE5;&#x7A0B;&#x5E08;&#x6765;&#x8BF4;&#x662F;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x5F3A;&#x5927;&#x505A;&#x6CD5;&#x3002;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Terraform&#x6765;&#x5E94;&#x7528;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;</p>
</blockquote>
<p>&#x4F8B;3-3. example.tf</p>
<pre class="language-"><code class="lang-bash"><span class="token comment" spellcheck="true"># Create our DNSimple record</span>
resource <span class="token string">&quot;dnsimple_record&quot;</span> <span class="token string">&quot;web&quot;</span> <span class="token punctuation">{</span>
domain <span class="token operator">=</span> <span class="token string">&quot;<span class="token variable">${var.dnsimple_domain}</span>&quot;</span>
name <span class="token operator">=</span> <span class="token string">&quot;terraform&quot;</span>
value <span class="token operator">=</span> <span class="token string">&quot;<span class="token variable">${hostname}</span>&quot;</span>
<span class="token function">type</span> <span class="token operator">=</span> <span class="token string">&quot;CNAME&quot;</span>
ttl <span class="token operator">=</span> 3600
<span class="token punctuation">}</span>
</code></pre>
<h3 id="&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x8F6F;&#x4EF6;">&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x8F6F;&#x4EF6;</h3>
<p>&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x4EE3;&#x7801;&#x662F;&#x671D;&#x7740;&#x6B63;&#x786E;&#x65B9;&#x5411;&#x53D1;&#x5C55;&#x7684;&#x5F3A;&#x5927;&#x4E3E;&#x63AA;&#x3002;&#x4F46;&#x662F;&#x4EE3;&#x7801;&#x662F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x9759;&#x6001;&#x8868;&#x793A;&#xFF0C;&#x5E76;&#x4E14;&#x6709;&#x5176;&#x5C40;&#x9650;&#x6027;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x6267;&#x884C;&#x90E8;&#x7F72;&#x4EE3;&#x7801;&#x66F4;&#x6539;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F46;&#x9664;&#x975E;&#x90E8;&#x7F72;&#x5DE5;&#x5177;&#x6301;&#x7EED;&#x8FD0;&#x884C;&#xFF0C;&#x5426;&#x5219;&#x4ECD;&#x4F1A;&#x51FA;&#x73B0;&#x914D;&#x7F6E;&#x6F02;&#x79FB;&#x3002;&#x4F20;&#x7EDF;&#x4E0A;&#xFF0C;&#x90E8;&#x7F72;&#x5DE5;&#x5177;&#x53EA;&#x80FD;&#x5728;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#x4E0A;&#x5DE5;&#x4F5C;&#xFF1A;&#x5B83;&#x53EA;&#x80FD;&#x521B;&#x5EFA;&#x65B0;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x80FD;&#x8F7B;&#x6613;&#x5220;&#x9664;&#x6216;&#x4FEE;&#x6539;&#x73B0;&#x6709;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x638C;&#x63E1;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x90E8;&#x7F72;&#x5DE5;&#x5177;&#x9700;&#x8981;&#x6839;&#x636E;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x521D;&#x59CB;&#x8868;&#x793A;&#x8FDB;&#x884C;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E76;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x53D8;&#x66F4;&#x4EE5;&#x521B;&#x5EFA;&#x66F4;&#x7075;&#x6D3B;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5C06;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8868;&#x793A;&#x89C6;&#x4E3A;&#x4E00;&#x4E2A;&#x53EF;&#x6301;&#x7EED;&#x6267;&#x884C;&#x6240;&#x9700;&#x72B6;&#x6001;&#x7684;&#x53EF;&#x7248;&#x672C;&#x5316;&#x6570;&#x636E;&#x4F53;&#x65F6;&#xFF0C;&#x4E0B;&#x4E00;&#x6B65;&#x5C31;&#x662F;&#x5C06;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x89C6;&#x4E3A;&#x8F6F;&#x4EF6;&#x3002;</p>
<p>Terraform&#x4ECE;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x4E2D;&#x5438;&#x53D6;&#x6559;&#x8BAD;&#x5E76;&#x6539;&#x8FDB;&#x4E86;&#x8FD9;&#x4E00;&#x6982;&#x5FF5;&#xFF0C;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x914D;&#x7F6E;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x548C;&#x534F;&#x8C03;&#x8D44;&#x6E90;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x5C42;&#x6765;&#x66F4;&#x6709;&#x6548;&#x5730;&#x5229;&#x7528;&#x8D44;&#x6E90;&#x3002;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x7B2C;1&#x7AE0;&#x4E2D;&#x6240;&#x89E3;&#x91CA;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x5728;IaaS&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x9700;&#x8981;&#x5728;&#x53EF;&#x4EE5;&#x7BA1;&#x7406;&#x8D44;&#x6E90;&#x548C;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5E73;&#x53F0;&#x4E0A;&#x8FD0;&#x884C;&#x3002;</p>
<p>IaaS&#x5C06;&#x539F;&#x59CB;&#x7EC4;&#x4EF6;&#x4F5C;&#x4E3A;&#x4E34;&#x65F6;API&#x7AEF;&#x70B9;&#x5448;&#x73B0;&#xFF0C;&#x5E73;&#x53F0;&#x5448;&#x73B0;&#x66F4;&#x5BB9;&#x6613;&#x88AB;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x7684;&#x8D44;&#x6E90;&#x7684;API&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x8D44;&#x6E90;&#x53EF;&#x80FD;&#x63D0;&#x4F9B;IaaS&#x7EC4;&#x4EF6;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x6216;&#x78C1;&#x76D8;&#x5377;&#xFF09;&#xFF0C;&#x4F46;&#x5176;&#x4E2D;&#x8BB8;&#x591A;&#x8D44;&#x6E90;&#x5C06;&#x7531;&#x5E73;&#x53F0;&#x7BA1;&#x7406;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#xFF09;&#x3002;</p>
<p>&#x5E73;&#x53F0;&#x63ED;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5C42;&#xFF0C;&#x5E76;&#x4E0D;&#x65AD;&#x5F3A;&#x5316;&#x6240;&#x9700;&#x7684;&#x72B6;&#x6001;&#x3002;&#x5E73;&#x53F0;&#x7684;&#x7EC4;&#x4EF6;&#x4E5F;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x672C;&#x8EAB;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x671F;&#x671B;&#x72B6;&#x6001;&#x58F0;&#x660E;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#x3002;</p>
<p>API&#x673A;&#x5236;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x83B7;&#x5F97;&#x5C06;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x6807;&#x51C6;&#x5316;&#x4E3A;&#x4EE3;&#x7801;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x5E76;&#x589E;&#x52A0;&#x4E86;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x7248;&#x672C;&#x5316;&#x548C;&#x66F4;&#x6539;&#x8868;&#x793A;&#x7684;&#x80FD;&#x529B;&#x3002;API&#x5141;&#x8BB8;&#x901A;&#x8FC7;&#x6807;&#x51C6;&#x5B9E;&#x8DF5;&#xFF08;&#x5982;API&#x7248;&#x672C;&#x63A7;&#x5236;&#xFF09;&#x6D88;&#x8D39;&#x8D44;&#x6E90;&#x7684;&#x65B0;&#x65B9;&#x5F0F;&#x3002;API&#x7684;&#x4F7F;&#x7528;&#x8005;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6784;&#x5EFA;&#x5230;&#x7279;&#x5B9A;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x5E76;&#x76F8;&#x4FE1;&#x5728;&#x4F7F;&#x7528;&#x65B0;&#x7684;API&#x7248;&#x672C;&#x4E4B;&#x524D;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x4F7F;&#x7528;&#x4E0D;&#x4F1A;&#x4E2D;&#x65AD;&#x3002;&#x5176;&#x4E2D;&#x6709;&#x4E9B;&#x505A;&#x6CD5;&#x662F;&#x4EE5;&#x524D;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x4EE3;&#x7801;&#x5DE5;&#x5177;&#x6240;&#x7F3A;&#x5C11;&#x7684;&#x91CD;&#x8981;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x6301;&#x7EED;&#x5F3A;&#x5316;&#x8868;&#x793A;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x6211;&#x4EEC;&#x7CFB;&#x7EDF;&#x7684;&#x5F53;&#x524D;&#x72B6;&#x6001;&#x3002;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;&#x6B63;&#x786E;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x5E73;&#x53F0;&#x5C42;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x6613;&#x4E8E;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x60A8;&#x53EF;&#x80FD;&#x6B63;&#x5728;&#x7ED8;&#x5236;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x6F14;&#x53D8;&#x4E0E;&#x8F6F;&#x4EF6;&#x6F14;&#x8FDB;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#x3002;&#x5806;&#x6808;&#x4E2D;&#x7684;&#x8FD9;&#x4E24;&#x5C42;&#x4EE5;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x5316;&#x3002;</p>
<blockquote>
<p>&#x8F6F;&#x4EF6;&#x6B63;&#x5728;&#x541E;&#x566C;&#x4E16;&#x754C;&#x3002;</p>
<p>&#x2014;&#x2014;Marc Andreessen</p>
</blockquote>
<p>&#x5C01;&#x88C5;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5E76;&#x5C06;&#x5176;&#x89C6;&#x4E3A;&#x7248;&#x672C;&#x5316;&#x7684;API&#x5C06;&#x4F1A;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#x3002;&#x8FD9;&#x6781;&#x5927;&#x5730;&#x63D0;&#x9AD8;&#x4E86;&#x8D1F;&#x8D23;&#x89E3;&#x91CA;&#x8868;&#x793A;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x7684;&#x901F;&#x5EA6;&#x3002;&#x7531;&#x5E73;&#x53F0;&#x63D0;&#x4F9B;&#x7684;&#x62BD;&#x8C61;&#x662F;&#x8DDF;&#x4E0A;&#x5FEB;&#x901F;&#x589E;&#x957F;&#x7684;&#x4E91;&#x6240;&#x5FC5;&#x9700;&#x7684;&#x3002;&#x8FD9;&#x79CD;&#x65B0;&#x6A21;&#x5F0F;&#x662F;&#x5F53;&#x4ECA;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;&#x5DF2;&#x7ECF;&#x88AB;&#x8BC1;&#x660E;&#x53EF;&#x4EE5;&#x6269;&#x5C55;&#x5230;&#x96BE;&#x4EE5;&#x4F30;&#x91CF;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<blockquote>
<p><strong>&#x4ECE;&#x8F6F;&#x4EF6;&#x90E8;&#x7F72;</strong></p>
<p>&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x4EE3;&#x7801;&#x548C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E0E;&#x8F6F;&#x4EF6;&#x4E4B;&#x95F4;&#x7684;&#x6839;&#x672C;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF0C;&#x8F6F;&#x4EF6;&#x80FD;&#x591F;&#x6539;&#x53D8;&#x6570;&#x636E;&#x5B58;&#x50A8;&#xFF0C;&#x4ECE;&#x800C;&#x6539;&#x53D8;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x8868;&#x793A;&#x3002;&#x8FD9;&#x662F;&#x7531;&#x8F6F;&#x4EF6;&#x6765;&#x7BA1;&#x7406;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x4EE3;&#x8868;&#x662F;&#x8FD0;&#x8425;&#x5546;&#x548C;&#x8F6F;&#x4EF6;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x6362;&#x3002;</p>
<p>&#x5728;&#x4F8B;3-4&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x4F7F;&#x7528;YAML&#x8868;&#x793A;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4FE1;&#x4EFB;&#x8BE5;&#x8F6F;&#x4EF6;&#x6765;&#x89E3;&#x91CA;&#x8FD9;&#x79CD;&#x8868;&#x793A;&#xFF0C;&#x5E76;&#x4E3A;&#x5448;&#x73B0;YAML&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x5C31;&#x50CF;&#x4E0E;&#x6211;&#x4EEC;&#x5F00;&#x53D1;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4EE3;&#x7801;&#x65F6;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x8868;&#x793A;&#x5F00;&#x59CB;&#x3002;&#x4F46;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x8F6F;&#x4EF6;&#x4F1A;&#x6301;&#x7EED;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x8868;&#x793A;&#x4F1A;&#x968F;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x3002;&#x4ECE;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x8BF4;&#xFF0C;&#x8FD9;&#x4ECD;&#x7136;&#x662F;&#x53EA;&#x8BFB;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8F6F;&#x4EF6;&#x53EF;&#x4EE5;&#x6269;&#x5C55;&#x8FD9;&#x4E2A;&#x5B9A;&#x4E49;&#x6765;&#x6DFB;&#x52A0;&#x81EA;&#x5DF1;&#x7684;&#x5143;&#x4FE1;&#x606F;&#xFF0C;&#x6BD4;&#x5982;&#x6807;&#x8BB0;&#x548C;&#x8D44;&#x6E90;&#x521B;&#x5EFA;&#x65F6;&#x95F4;&#x3002;</p>
</blockquote>
<p>&#x4F8B;3-4. infrastructure.yaml</p>
<pre class="language-"><code class="lang-yaml">  <span class="token key atrule">location</span><span class="token punctuation">:</span> <span class="token string">&quot;New York 1&quot;</span>
  <span class="token key atrule">name</span><span class="token punctuation">:</span> example
  <span class="token key atrule">dns</span><span class="token punctuation">:</span>
      <span class="token key atrule">fqdn</span><span class="token punctuation">:</span> infra.example.com
  <span class="token key atrule">network</span><span class="token punctuation">:</span>
    <span class="token key atrule">cidr</span><span class="token punctuation">:</span> 172.0.0.0/12
  <span class="token key atrule">serverPools</span><span class="token punctuation">:</span>
    <span class="token punctuation">-</span> <span class="token key atrule">bootstrapScript</span><span class="token punctuation">:</span> /home/user/bootstrap.sh
      <span class="token key atrule">diskSize</span><span class="token punctuation">:</span> 40gb
      <span class="token key atrule">firewalls</span><span class="token punctuation">:</span>
        <span class="token punctuation">-</span> <span class="token key atrule">rules</span><span class="token punctuation">:</span>
            <span class="token punctuation">-</span> <span class="token key atrule">ingressFromPort</span><span class="token punctuation">:</span> <span class="token number">443</span>
              <span class="token key atrule">ingressProtocol</span><span class="token punctuation">:</span> tcp
              <span class="token key atrule">ingressSource</span><span class="token punctuation">:</span> 0.0.0.0/0
              <span class="token key atrule">ingressToPort</span><span class="token punctuation">:</span> <span class="token number">443</span>
      <span class="token key atrule">maxCount</span><span class="token punctuation">:</span> <span class="token number">1</span>
      <span class="token key atrule">minCount</span><span class="token punctuation">:</span> <span class="token number">1</span>
      <span class="token key atrule">image</span><span class="token punctuation">:</span> centos<span class="token punctuation">-</span>amd64<span class="token punctuation">-</span><span class="token number">7</span>
      <span class="token key atrule">subnets</span><span class="token punctuation">:</span>
        <span class="token punctuation">-</span> <span class="token key atrule">cidr</span><span class="token punctuation">:</span> 172.0.100.0/24
</code></pre>
<h2 id="&#x90E8;&#x7F72;&#x5DE5;&#x5177;">&#x90E8;&#x7F72;&#x5DE5;&#x5177;</h2>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x4E86;&#x89E3;&#x90E8;&#x7F72;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x4E24;&#x4E2A;&#x89D2;&#x8272;&#xFF1A;</p>
<p><strong>&#x4F5C;&#x8005;</strong></p>
<p>&#x5B9A;&#x4E49;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x7EC4;&#x4EF6;</p>
<p><strong>&#x89C2;&#x4F17;</strong></p>
<p>&#x90E8;&#x7F72;&#x5DE5;&#x5177;&#x89E3;&#x91CA;&#x8868;&#x793A;&#x5E76;&#x91C7;&#x53D6;&#x884C;&#x52A8;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5F88;&#x591A;&#x9014;&#x5F84;&#x6765;&#x8868;&#x8FF0;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x91C7;&#x53D6;&#x884C;&#x52A8;&#x7684;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x662F;&#x5BF9;&#x6700;&#x521D;&#x8868;&#x793A;&#x7684;&#x903B;&#x8F91;&#x53CD;&#x6620;&#x3002;&#x51C6;&#x786E;&#x5730;&#x8868;&#x793A;&#x9002;&#x5F53;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5C42;&#x5E76;&#x5C3D;&#x53EF;&#x80FD;&#x6D88;&#x9664;&#x8BE5;&#x5C42;&#x7684;&#x590D;&#x6742;&#x6027;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x3001;&#x6709;&#x9488;&#x5BF9;&#x6027;&#x7684;&#x53D1;&#x5E03;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x80FD;&#x591F;&#x66F4;&#x52A0;&#x51C6;&#x786E;&#x5730;&#x5E94;&#x7528;&#x6240;&#x9700;&#x7684;&#x66F4;&#x6539;&#x3002;</p>
<p>&#x300A;&#x7AD9;&#x70B9;&#x53EF;&#x9760;&#x6027;&#x5DE5;&#x7A0B;&#x300B;&#xFF08;O&apos;Reilly&#xFF0C;2016&#xFF09;&#x603B;&#x7ED3;&#x8BF4;&#xFF1A;&#x201C;&#x7B80;&#x5355;&#x7248;&#x672C;&#x901A;&#x5E38;&#x6BD4;&#x590D;&#x6742;&#x7248;&#x672C;&#x66F4;&#x597D;&#x3002;&#x8861;&#x91CF;&#x548C;&#x7406;&#x89E3;&#x5355;&#x4E00;&#x53D8;&#x66F4;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x540C;&#x65F6;&#x53D1;&#x5E03;&#x7684;&#x4E00;&#x6279;&#x53D8;&#x66F4;&#x8981;&#x5BB9;&#x6613;&#x5F97;&#x591A;&#x3002;&#x201C;</p>
<p>&#x968F;&#x7740;&#x6211;&#x4EEC;&#x5BF9;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x8868;&#x793A;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x800C;&#x53D8;&#x5316;&#xFF0C;&#x4EE5;&#x4FBF;&#x4ECE;&#x5E95;&#x5C42;&#x7EC4;&#x4EF6;&#x4E2D;&#x62BD;&#x8C61;&#x51FA;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x90E8;&#x7F72;&#x5DE5;&#x5177;&#x5DF2;&#x7ECF;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x4EE5;&#x5339;&#x914D;&#x65B0;&#x7684;&#x62BD;&#x8C61;&#x76EE;&#x6807;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6B63;&#x5728;&#x5C06;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x89C6;&#x4E3A;&#x8F6F;&#x4EF6;&#x8FB9;&#x754C;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x90E8;&#x7F72;&#x5DE5;&#x5177;&#x65B0;&#x65F6;&#x4EE3;&#x7684;&#x65E9;&#x671F;&#x8FF9;&#x8C61;&#x3002;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x6B63;&#x5728;&#x51FA;&#x73B0;&#xFF0C;&#x58F0;&#x79F0;&#x80FD;&#x591F;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x7BA1;&#x7406;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#x4E86;&#x89E3;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5C42;&#x4EE5;&#x53CA;&#x5B83;&#x5982;&#x4F55;&#x5F71;&#x54CD;&#x5176;&#x73B0;&#x6709;&#x5DE5;&#x5177;&#x548C;&#x5176;&#x4ED6;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5C42;&#x3002;</p>
<p>&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x65B9;&#x5411;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x662F;&#x91C7;&#x7528;&#x914D;&#x7F6E;&#x811A;&#x672C;&#x5E76;&#x5B89;&#x6392;&#x5B83;&#x4EEC;&#x6301;&#x7EED;&#x8FD0;&#x884C;&#x3002;&#x6709;&#x4E9B;&#x5DE5;&#x7A0B;&#x5E08;&#x4F1A;&#x6545;&#x610F;&#x8BBE;&#x8BA1;&#x8FD9;&#x4E9B;&#x811A;&#x672C;&#xFF0C;&#x4EE5;&#x4FBF;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x5B89;&#x6392;&#x597D;&#x3002;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x770B;&#x5230;&#x7CBE;&#x5FC3;&#x8BBE;&#x8BA1;&#x7684;&#x5168;&#x5C40;&#x9501;&#x5B9A;&#x673A;&#x5236;&#x3001;&#x9AD8;&#x7EA7;&#x8C03;&#x5EA6;&#x7B56;&#x7565;&#x548C;&#x5206;&#x5E03;&#x5F0F;&#x8C03;&#x5EA6;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x8FD9;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x627F;&#x8BFA;&#x7684;&#xFF0C;&#x5C3D;&#x7BA1;&#x5728;&#x66F4;&#x5177;&#x8D44;&#x6E90;&#x7279;&#x5B9A;&#x7684;&#x62BD;&#x8C61;&#x4E2D;&#x3002;&#x611F;&#x8C22;&#x4E91;&#x8BA1;&#x7B97;&#xFF0C;&#x7BA1;&#x7406;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x811A;&#x672C;&#x7684;&#x65E5;&#x5B50;&#x5DF2;&#x7ECF;&#x8FC7;&#x53BB;&#x4E86;&#x3002;</p>
<blockquote>
<p>&#x81EA;&#x52A8;&#x5316;&#x5DF2;&#x6B7B;&#x3002;</p>
<p>&#x2014;&#x2014;Honeycomb&#x9996;&#x5E2D;&#x6267;&#x884C;&#x5B98;Charity Majors</p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x6B63;&#x5728;&#x60F3;&#x8C61;&#x4E00;&#x4E2A;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x4EE5;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x770B;&#x5F85;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5DE5;&#x5177;&#x7684;&#x4E16;&#x754C;&#x3002;&#x5982;&#x679C;&#x60A8;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x65E8;&#x5728;&#x8FD0;&#x884C;&#x5728;&#x4E91;&#x4E0A;&#xFF0C;&#x90A3;&#x4E48;IaaS&#x4E0D;&#x662F;&#x60A8;&#x5E94;&#x8BE5;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4F7F;&#x7528;&#x4E91;&#x63D0;&#x4F9B;&#x7684;API&#xFF0C;&#x5E76;&#x6784;&#x5EFA;&#x53EF;&#x76F4;&#x63A5;&#x7531;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x7684;&#x65B0;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5C42;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5728;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x53D1;&#x5C55;&#x65B9;&#x9762;&#x5904;&#x4E8E;&#x7279;&#x6B8A;&#x5730;&#x4F4D;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x7B2C;&#x4E00;&#x5929;&#x5F00;&#x59CB;&#x5C31;&#x5C06;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x90E8;&#x7F72;&#x5DE5;&#x5177;&#x8BBE;&#x8BA1;&#x4E3A;&#x4F18;&#x96C5;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x826F;&#x597D;&#x7684;&#x90E8;&#x7F72;&#x5DE5;&#x5177;&#x662F;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x4ECE;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x4EBA;&#x6027;&#x5316;&#x8868;&#x793A;&#x5230;&#x53EF;&#x5DE5;&#x4F5C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x66F4;&#x597D;&#x7684;&#x90E8;&#x7F72;&#x5DE5;&#x5177;&#x662F;&#x64A4;&#x9500;&#x4EFB;&#x4F55;&#x4E0E;&#x521D;&#x59CB;&#x8868;&#x793A;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x53D8;&#x66F4;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x6700;&#x597D;&#x7684;&#x90E8;&#x7F72;&#x5DE5;&#x5177;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x4EBA;&#x5DE5;&#x53C2;&#x4E0E;&#x3002;</p>
<p>&#x5728;&#x6211;&#x4EEC;&#x6784;&#x5EFA;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x5FD8;&#x8BB0;&#x4ECE;&#x5904;&#x7406;&#x590D;&#x6742;&#x7CFB;&#x7EDF;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x4E13;&#x4E1A;&#x5DE5;&#x5177;&#x548C;&#x8F6F;&#x4EF6;&#x5B9E;&#x8DF5;&#x4E2D;&#x5B66;&#x5230;&#x7684;&#x91CD;&#x8981;&#x7ECF;&#x9A8C;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x7684;&#x90E8;&#x7F72;&#x5DE5;&#x5177;&#x7684;&#x4E00;&#x4E9B;&#x5173;&#x952E;&#x65B9;&#x9762;&#x662F;&#x5E42;&#x7B49;&#x6027;&#x548C;&#x5904;&#x7406;&#x5931;&#x8D25;&#x3002;</p>
<h3 id="&#x5E42;&#x7B49;&#x6027;">&#x5E42;&#x7B49;&#x6027;</h3>
<p>&#x8F6F;&#x4EF6;&#x5E94;&#x8BE5;&#x662F;&#x5E42;&#x7B49;&#x7684;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6301;&#x7EED;&#x8F93;&#x5165;&#x76F8;&#x540C;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x5FC5;&#x987B;&#x5E76;&#x59CB;&#x7EC8;&#x83B7;&#x5F97;&#x76F8;&#x540C;&#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x5728;&#x6280;&#x672F;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x88AB;&#x8D85;&#x6587;&#x672C;&#x4F20;&#x8F93;&#x534F;&#x8BAE;&#xFF08;HTTP&#xFF09;&#x901A;&#x8FC7;&#x50CF;PUT&#x548C;DELETE&#x8FD9;&#x6837;&#x7684;&#x5E42;&#x7B49;&#x65B9;&#x6CD5;&#x800C;&#x8457;&#x540D;&#x3002;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x98DE;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x8F6F;&#x4EF6;&#x4E2D;&#x5BA3;&#x4F20;&#x5E42;&#x7B49;&#x6027;&#x7684;&#x4FDD;&#x8BC1;&#x53EF;&#x4EE5;&#x5851;&#x9020;&#x51FA;&#x66F4;&#x4F73;&#x590D;&#x6742;&#x7684;&#x8F6F;&#x4EF6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4ECE;&#x65E9;&#x671F;&#x7684;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#x4E2D;&#x5B66;&#x5230;&#x7684;&#x7ECF;&#x9A8C;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x5E42;&#x7B49;&#x6027;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BB0;&#x4F4F;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x4E3A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5DE5;&#x7A0B;&#x5E08;&#x63D0;&#x4F9B;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x5E76;&#x4E14;&#x7EE7;&#x7EED;&#x5C06;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x6784;&#x5EFA;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x5DE5;&#x5177;&#x4E2D;&#x3002;</p>
<p>&#x80FD;&#x591F;&#x81EA;&#x52A8;&#x521B;&#x5EFA;&#x3001;&#x66F4;&#x65B0;&#x6216;&#x5220;&#x9664;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x4FDD;&#x8BC1;&#x65E0;&#x8BBA;&#x60A8;&#x8FD0;&#x884C;&#x4EFB;&#x52A1;&#x7684;&#x9891;&#x7387;&#x5982;&#x4F55;&#xFF0C;&#x59CB;&#x7EC8;&#x90FD;&#x4F1A;&#x8F93;&#x51FA;&#x76F8;&#x540C;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x8FD9;&#x975E;&#x5E38;&#x4EE4;&#x4EBA;&#x5174;&#x594B;&#x3002;&#x5B83;&#x5141;&#x8BB8;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x5F00;&#x59CB;&#x81EA;&#x52A8;&#x5316;&#x4EFB;&#x52A1;&#x548C;&#x6742;&#x4E8B;&#x3002;&#x8FC7;&#x53BB;&#x5BF9;&#x4E8E;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x8FC7;&#x53BB;&#x76F8;&#x5F53;&#x5927;&#x91CF;&#x7684;&#x5DE5;&#x4F5C;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x50CF;&#x5728;&#x7F51;&#x9875;&#x4E2D;&#x70B9;&#x51FB;&#x6309;&#x94AE;&#x4E00;&#x6837;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x5E42;&#x7B49;&#x4FDD;&#x8BC1;&#x4E5F;&#x6709;&#x52A9;&#x4E8E;&#x8FD0;&#x8425;&#x5546;&#x5728;&#x5176;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E0A;&#x6267;&#x884C;&#x8D28;&#x91CF;&#x79D1;&#x5B66;&#x3002;&#x8FD0;&#x8425;&#x5546;&#x53EF;&#x4EE5;&#x5728;&#x8BB8;&#x591A;&#x7269;&#x7406;&#x4F4D;&#x7F6E;&#x5F00;&#x59CB;&#x590D;&#x5236;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x5E76;&#x77E5;&#x9053;&#x522B;&#x4EBA;&#x91CD;&#x590D;&#x4ED6;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x4F1A;&#x5F97;&#x5230;&#x540C;&#x6837;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x6CE8;&#x610F;&#x5230;&#x56F4;&#x7ED5;&#x8FD9;&#x79CD;&#x81EA;&#x52A8;&#x6267;&#x884C;&#x4EFB;&#x610F;&#x4EFB;&#x52A1;&#x4EE5;&#x5B9E;&#x73B0;&#x53EF;&#x91CD;&#x590D;&#x6027;&#x7684;&#x601D;&#x60F3;&#x6784;&#x5EFA;&#x7684;&#x6574;&#x4E2A;&#x6846;&#x67B6;&#x548C;&#x5DE5;&#x5177;&#x94FE;&#x3002;</p>
<p>&#x5C31;&#x50CF;&#x8F6F;&#x4EF6;&#x4E00;&#x6837;&#xFF0C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;&#x8FD0;&#x8425;&#x5546;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x8868;&#x793A;&#x548C;&#x90E8;&#x7F72;&#x5DE5;&#x5177;&#x81EA;&#x52A8;&#x7BA1;&#x7406;&#x6574;&#x4E2A;&#x7BA1;&#x7406;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x6D41;&#x6C34;&#x7EBF;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x7684;&#x5DE5;&#x4F5C;&#x53D8;&#x6210;&#x4E86;&#x5F00;&#x53D1;&#x81EA;&#x52A8;&#x6267;&#x884C;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x800C;&#x4E0D;&#x518D;&#x662F;&#x81EA;&#x5DF1;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;</p>
<h3 id="&#x5904;&#x7406;&#x5931;&#x8D25;">&#x5904;&#x7406;&#x5931;&#x8D25;</h3>
<p>&#x4EFB;&#x4F55;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#x90FD;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x4F60;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x5904;&#x7406;&#x6545;&#x969C;&#x548C;&#x8FB9;&#x7F18;&#x6848;&#x4F8B;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;&#x4F5C;&#x4E3A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7BA1;&#x7406;&#x5458;&#x6211;&#x4EEC;&#x81EA;&#x7136;&#x800C;&#x7136;&#x5C31;&#x8981;&#x8003;&#x8651;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5982;&#x679C;&#x90E8;&#x7F72;&#x4F5C;&#x4E1A;&#x5728;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x5931;&#x8D25;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#xFF1F;</p>
<p>&#x5728;&#x8003;&#x8651;&#x5931;&#x8D25;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8BBE;&#x8BA1;&#x6211;&#x4EEC;&#x7684;&#x90E8;&#x7F72;&#x5DE5;&#x5177;&#x662F;&#x671D;&#x7740;&#x6B63;&#x786E;&#x65B9;&#x5411;&#x8FC8;&#x51FA;&#x7684;&#x53C8;&#x4E00;&#x6B65;&#x3002;&#x5931;&#x8D25;&#x65F6;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x6216;&#x5728;&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#x4E2D;&#x6CE8;&#x518C;&#x8B66;&#x62A5;&#x3002;&#x6211;&#x4EEC;&#x4FDD;&#x5B58;&#x4E86;&#x81EA;&#x52A8;&#x5316;&#x4EFB;&#x52A1;&#x7684;&#x8BE6;&#x7EC6;&#x65E5;&#x5FD7;&#x3002;&#x5728;&#x5931;&#x8D25;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x751A;&#x81F3;&#x5C06;&#x903B;&#x8F91;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6C89;&#x8FF7;&#x4E8E;&#x5931;&#x8D25;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x5931;&#x8D25;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5F00;&#x59CB;&#x91C7;&#x53D6;&#x884C;&#x52A8;&#xFF0C;&#x5E76;&#x5728;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x65F6;&#x91C7;&#x53D6;&#x884C;&#x52A8;&#x3002;</p>
<p>&#x4F46;&#x56F4;&#x7ED5;&#x5355;&#x4E2A;&#x7EC4;&#x4EF6;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x7684;&#x60F3;&#x6CD5;&#x6765;&#x6784;&#x5EFA;&#x7CFB;&#x7EDF;&#x4E0E;&#x6784;&#x5EFA;&#x7EC4;&#x4EF6;&#x4EE5;&#x4F7F;&#x5176;&#x66F4;&#x5BB9;&#x6613;&#x51FA;&#x6545;&#x969C;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x3002;&#x6839;&#x636E;&#x6545;&#x969C;&#x91CD;&#x8BD5;&#x7EC4;&#x4EF6;&#x6216;&#x8C03;&#x6574;&#x5176;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x7CFB;&#x7EDF;&#x7684;&#x5F39;&#x6027;&#x8FDB;&#x4E00;&#x6B65;&#x6DF1;&#x5165;&#x5230;&#x8F6F;&#x4EF6;&#x4E2D;&#x3002;&#x8FD9;&#x5141;&#x8BB8;&#x66F4;&#x7A33;&#x5B9A;&#x7684;&#x7CFB;&#x7EDF;&#x5E76;&#x51CF;&#x5C11;&#x7CFB;&#x7EDF;&#x672C;&#x8EAB;&#x6240;&#x9700;&#x7684;&#x6574;&#x4F53;&#x652F;&#x6301;&#x3002;</p>
<p>&#x9762;&#x5411;&#x6545;&#x969C;&#x800C;&#x8BBE;&#x8BA1;&#x7EC4;&#x4EF6;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7CFB;&#x7EDF;&#x3002;</p>
<p><strong>&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;</strong></p>
<p>&#x4EE5;&#x8BBE;&#x8BA1;&#x5931;&#x8D25;&#x7684;&#x7EC4;&#x4EF6;&#x4E3A;&#x540D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x63CF;&#x8FF0;&#x5904;&#x7406;&#x5931;&#x8D25;&#x7684;&#x5E38;&#x7528;&#x65B9;&#x6CD5;&#x7684;&#x672F;&#x8BED;&#x3002;</p>
<p>&#x6700;&#x7EC8;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x610F;&#x5473;&#x7740;&#x4F01;&#x56FE;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x8C03;&#x548C;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x3002;&#x8F83;&#x5927;&#x7684;&#x7CFB;&#x7EDF;&#x548C;&#x8F83;&#x5C0F;&#x7684;&#x7EC4;&#x4EF6;&#x90FD;&#x53EF;&#x4EE5;&#x9075;&#x5FAA;&#x8FD9;&#x79CD;&#x968F;&#x65F6;&#x95F4;&#x63A8;&#x79FB;&#x91CD;&#x8BD5;&#x5931;&#x8D25;&#x8FC7;&#x7A0B;&#x7684;&#x7406;&#x5FF5;&#x3002;</p>
<p>&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x7684;&#x7CFB;&#x7EDF;&#x7684;&#x597D;&#x5904;&#x4E4B;&#x4E00;&#x662F;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x786E;&#x4FE1;&#x5B83;&#x6700;&#x7EC8;&#x4F1A;&#x8FBE;&#x5230;&#x9884;&#x671F;&#x7684;&#x72B6;&#x6001;&#x3002;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E2A;&#x62C5;&#x5FE7;&#x662F;&#xFF0C;&#x6709;&#x65F6;&#x4ED6;&#x4EEC;&#x53EF;&#x80FD;&#x82B1;&#x8D39;&#x4E0D;&#x6070;&#x5F53;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x8FBE;&#x5230;&#x6240;&#x9700;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x7A33;&#x5B9A;&#x4F46;&#x7F13;&#x6162;&#x7684;&#x7CFB;&#x7EDF;&#x4E0E;&#x4E00;&#x4E2A;&#x4E0D;&#x53EF;&#x9760;&#x4F46;&#x5FEB;&#x901F;&#x7684;&#x7CFB;&#x7EDF;&#x662F;&#x7BA1;&#x7406;&#x5458;&#x5FC5;&#x987B;&#x505A;&#x51FA;&#x7684;&#x6280;&#x672F;&#x51B3;&#x7B56;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x51B3;&#x5B9A;&#x4E2D;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x91CD;&#x8981;&#x5173;&#x7CFB;&#x662F;&#x7CFB;&#x7EDF;&#x4EA4;&#x6362;&#x901F;&#x5EA6;&#x7684;&#x53EF;&#x9760;&#x6027;&#x3002;&#x8FD9;&#x5E76;&#x4E0D;&#x5BB9;&#x6613;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x6709;&#x7591;&#x95EE;&#xFF0C;&#x8BF7;&#x59CB;&#x7EC8;&#x9009;&#x62E9;&#x53EF;&#x9760;&#x7684;&#x7CFB;&#x7EDF;&#x3002;</p>
<p><strong>&#x539F;&#x5B50;&#x6027;</strong></p>
<p>&#x4E0E;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x7684;&#x7CFB;&#x7EDF;&#x76F8;&#x53CD;&#x7684;&#x662F;&#x539F;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x9879;&#x4FDD;&#x8BC1;&#x4EA4;&#x6613;&#xFF0C;&#x51B3;&#x5B9A;&#x4E86;&#x6574;&#x4E2A;&#x5DE5;&#x4F5C;&#x7684;&#x6210;&#x529F;&#x3002;&#x5982;&#x679C;&#x4F5C;&#x4E1A;&#x65E0;&#x6CD5;&#x5B8C;&#x6210;&#xFF0C;&#x5219;&#x4F1A;&#x6062;&#x590D;&#x6240;&#x505A;&#x7684;&#x66F4;&#x6539;&#x5E76;&#x5B8C;&#x5168;&#x5931;&#x8D25;&#x3002;</p>
<p>&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#x9700;&#x8981;&#x521B;&#x5EFA;10&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x5DE5;&#x4F5C;&#x5230;&#x8FBE;&#x7B2C;&#x4E03;&#x53F0;&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x3002;&#x6839;&#x636E;&#x6700;&#x7EC8;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x4F1A;&#x53CD;&#x590D;&#x5C1D;&#x8BD5;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E0C;&#x671B;&#x6700;&#x7EC8;&#x83B7;&#x5F97;10&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x3002;</p>
<p>&#x4E86;&#x89E3;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x521B;&#x5EFA;7&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x7684;&#x539F;&#x56E0;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x4E91;&#x8BA1;&#x7B97;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x591A;&#x5C11;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x662F;&#x6709;&#x9650;&#x5236;&#x7684;&#x3002;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x6A21;&#x578B;&#x5C06;&#x7EE7;&#x7EED;&#x5C1D;&#x8BD5;&#x521B;&#x5EFA;&#x53E6;&#x5916;&#x4E09;&#x53F0;&#x673A;&#x5668;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x4F1A;&#x5931;&#x8D25;&#x6BCF;&#x6B21;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x662F;&#x8BBE;&#x8BA1;&#x6210;&#x539F;&#x5B50;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C06;&#x5728;&#x7B2C;&#x4E03;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x8FBE;&#x5230;&#x6781;&#x9650;&#xFF0C;&#x5E76;&#x610F;&#x8BC6;&#x5230;&#x8FD9;&#x662F;&#x4E00;&#x573A;&#x707E;&#x96BE;&#x6027;&#x7684;&#x5931;&#x8D25;&#x3002;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x5C06;&#x8D1F;&#x8D23;&#x5220;&#x9664;&#x90E8;&#x5206;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x653E;&#x5FC3;&#xFF0C;&#x4ED6;&#x4EEC;&#x6216;&#x8005;&#x5B8C;&#x5168;&#x6309;&#x7167;&#x9884;&#x671F;&#x5EFA;&#x7ACB;&#x7CFB;&#x7EDF;&#xFF0C;&#x6216;&#x8005;&#x6839;&#x672C;&#x4E0D;&#x4F1A;&#x521B;&#x5EFA;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x610F;&#x4E49;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x4E3A;&#x4E86;&#x80FD;&#x8BA9;&#x7CFB;&#x7EDF;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x7EC4;&#x4EF6;&#x90FD;&#x4F9D;&#x8D56;&#x4E8E;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F15;&#x5165;&#x4FE1;&#x5FC3;&#x6765;&#x6362;&#x53D6;&#x4E0D;&#x4FBF;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x4F1A;&#x76F8;&#x4FE1;&#x4ED6;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x72B6;&#x6001;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#xFF0C;&#x9664;&#x975E;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x5B8C;&#x7F8E;&#x7684;&#x6539;&#x53D8;&#x3002;&#x4E3A;&#x4E86;&#x4EA4;&#x6362;&#x8FD9;&#x4E2A;&#x5B8C;&#x7F8E;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x53EF;&#x80FD;&#x4F1A;&#x9762;&#x4E34;&#x5F88;&#x5927;&#x7684;&#x4E0D;&#x4FBF;&#xFF0C;&#x56E0;&#x4E3A;&#x7CFB;&#x7EDF;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5F88;&#x591A;&#x5DE5;&#x4F5C;&#x624D;&#x80FD;&#x4FDD;&#x6301;&#x5E73;&#x7A33;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x539F;&#x5B50;&#x7CFB;&#x7EDF;&#x662F;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x4F46;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x3002;&#x5DE5;&#x7A0B;&#x5E08;&#x9700;&#x8981;&#x77E5;&#x9053;&#x4ED6;&#x4EEC;&#x60F3;&#x8981;&#x4EC0;&#x4E48;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EE5;&#x53CA;&#x4F55;&#x65F6;&#x9009;&#x62E9;&#x539F;&#x5B50;&#x6027;&#x4E0E;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x3002;</p>
<h2 id="&#x7ED3;&#x8BBA;">&#x7ED3;&#x8BBA;</h2>
<p>&#x90E8;&#x7F72;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x6A21;&#x5F0F;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x4E91;&#x53EF;&#x7528;&#x4E4B;&#x524D;&#x4E00;&#x76F4;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;&#x6211;&#x4EEC;&#x4EE3;&#x8868;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x4E00;&#x4E9B;&#x8BBE;&#x5907;&#xFF0C;&#x5C06;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x53D8;&#x4E3A;&#x73B0;&#x5B9E;&#x3002;</p>
<p>&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5C42;&#x4E0E;&#x8F6F;&#x4EF6;&#x5E94;&#x7528;&#x5C42;&#x5177;&#x6709;&#x60CA;&#x4EBA;&#x7684;&#x7C7B;&#x4F3C;&#x5386;&#x53F2;&#x3002;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E5F;&#x4E0D;&#x4F8B;&#x5916;&#x3002;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x5728;&#x91CD;&#x590D;&#x5386;&#x53F2;&#xFF0C;&#x5E76;&#x4EE5;&#x65B0;&#x7684;&#x65B9;&#x5F0F;&#x5B66;&#x4E60;&#x53E4;&#x8001;&#x7684;&#x6559;&#x8BAD;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x5176;&#x8F6F;&#x4EF6;&#x5BF9;&#x624B;&#x7684;&#x672A;&#x6765;&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;&#x4E8E;&#x9884;&#x6D4B;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x884C;&#x4E1A;&#x672A;&#x6765;&#x7684;&#x80FD;&#x529B;&#x8FD8;&#x6709;&#x4EC0;&#x4E48;&#x8981;&#x8BF4;&#x7684;&#xFF1F;</p>
<p>&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x662F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x6F14;&#x53D8;&#x7684;&#x4E00;&#x79CD;&#x81EA;&#x7136;&#x800C;&#x53EF;&#x80FD;&#x9884;&#x671F;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x80FD;&#x591F;&#x4EE5;&#x53EF;&#x9760;&#x548C;&#x53EF;&#x91CD;&#x590D;&#x7684;&#x65B9;&#x5F0F;&#x90E8;&#x7F72;&#x3001;&#x8868;&#x793A;&#x548C;&#x7BA1;&#x7406;&#x5B83;&#x662F;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x90E8;&#x7F72;&#x6211;&#x4EEC;&#x7684;&#x90E8;&#x7F72;&#x5DE5;&#x5177;&#xFF0C;&#x5E76;&#x8F6C;&#x79FB;&#x6211;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x5C06;&#x6211;&#x4EEC;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4FDD;&#x6301;&#x5728;&#x4E00;&#x4E2A;&#x80FD;&#x591F;&#x652F;&#x6301;&#x5176;&#x5E94;&#x7528;&#x5C42;&#x7684;&#x7A7A;&#x95F4;&#x4E2D;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;</p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; 2018 cloudnativego.com all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification"> Updated at 
2018-05-26 18:25:19
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch02-when-to-adopt-cloud-native.html" class="navigation navigation-prev " aria-label="Previous page: 第2章 何时采用云原生">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch04-designing-infrastructure-applicaitons.html" class="navigation navigation-next " aria-label="Next page: 第4章 设计基础架构应用程序">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第3章 云原生部署的演变","level":"1.6","depth":1,"next":{"title":"第4章 设计基础架构应用程序","level":"1.7","depth":1,"path":"ch04-designing-infrastructure-applicaitons.md","ref":"ch04-designing-infrastructure-applicaitons.md","articles":[]},"previous":{"title":"第2章 何时采用云原生","level":"1.5","depth":1,"path":"ch02-when-to-adopt-cloud-native.md","ref":"ch02-when-to-adopt-cloud-native.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","codesnippet","splitter","page-toc-button","editlink","back-to-top-button","-lunr","-search","search-plus","github-buttons@2.1.0","favicon@^0.0.2","tbfed-pagefooter@^0.0.1","3-ba","theme-default","-highlight","prism","prism-themes"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © 2018 cloudnativego.com","modify_label":" Updated at ","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prism-themes/themes/prism-ghcolors.css"]},"github":{"url":"https://github.com/CloudNativeInfra/cni"},"editlink":{"label":"Edit this page","multilingual":false,"base":"https://github.com/CloudNativeInfra/cni/blob/master/cn"},"splitter":{},"codesnippet":{},"fontsettings":{"theme":"white","family":"sans","size":2},"favicon":{"shortcut":"favicon.ico","bookmark":"favicon.ico"},"page-toc-button":{},"back-to-top-button":{},"prism-themes":{},"github-buttons":{"repo":"CloudNativeInfra/cni","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"c889b4cfd2df3f575151a52b18610b26"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"search-plus":{}},"theme":"default","author":"cloudnativego.com","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"云原生基础设施 - cloudnativego.com","language":"cn","links":{"sidebar":{"CloudNativeGo":"https://cloudnativego.com"}},"gitbook":"*","description":"云原生基础设施|Cloud Native Infrastructure|cloudnativego.com"},"file":{"path":"ch03-evolution-of-cloud-native-developments.md","mtime":"2018-05-26T10:25:19.533Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-06-29T15:20:36.528Z"},"basePath":".","book":{"language":"cn"}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

