
<!DOCTYPE HTML>
<html lang="cn" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第4章 设计基础架构应用程序 · 云原生基础设施 - cloudnativego.com</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="cloudnativego.com">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-ghcolors.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch05-developing-infrastructure-applications.html" />
    
    
    <link rel="prev" href="ch03-evolution-of-cloud-native-developments.html" />
    

    
        <link rel="shortcut icon" href='favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"CloudNativeInfra/cni","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://cloudnativego.com" target="_blank" class="custom-link">CloudNativeGo</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io" target="_blank" class="custom-link">Jimmy Song</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    关于本书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="foreword.html">
            
                <a href="foreword.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="introduction.html">
            
                <a href="introduction.html">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch01-what-is-cloud-native-infrastructure.html">
            
                <a href="ch01-what-is-cloud-native-infrastructure.html">
            
                    
                    第1章 什么是云原生基础设施？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch02-when-to-adopt-cloud-native.html">
            
                <a href="ch02-when-to-adopt-cloud-native.html">
            
                    
                    第2章 何时采用云原生
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch03-evolution-of-cloud-native-developments.html">
            
                <a href="ch03-evolution-of-cloud-native-developments.html">
            
                    
                    第3章 云原生部署的演变
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.7" data-path="ch04-designing-infrastructure-applicaitons.html">
            
                <a href="ch04-designing-infrastructure-applicaitons.html">
            
                    
                    第4章 设计基础架构应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch05-developing-infrastructure-applications.html">
            
                <a href="ch05-developing-infrastructure-applications.html">
            
                    
                    第5章 开发基础架构应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch06-testing-cloud-native-infrastructure.html">
            
                <a href="ch06-testing-cloud-native-infrastructure.html">
            
                    
                    第6章 测试云原生基础设施
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch07-managing-cloud-native-applications.html">
            
                <a href="ch07-managing-cloud-native-applications.html">
            
                    
                    第7章 管理云原生应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch08-securing-applications.html">
            
                <a href="ch08-securing-applications.html">
            
                    
                    第8章 保护应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch09-implementing-cloud-native-infrasctructure.html">
            
                <a href="ch09-implementing-cloud-native-infrasctructure.html">
            
                    
                    第9章 实施云原生基础设施
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="appendix-a-patterns-for-network-resiilency.html">
            
                <a href="appendix-a-patterns-for-network-resiilency.html">
            
                    
                    附录A 网络弹性模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="appendix-b-lock-in.html">
            
                <a href="appendix-b-lock-in.html">
            
                    
                    附录B 锁定
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="appendix-c-box-case-study.html">
            
                <a href="appendix-c-box-case-study.html">
            
                    
                    附录C Box：案例研究
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第4章 设计基础架构应用程序</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;4&#x7AE0;-&#x8BBE;&#x8BA1;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;">&#x7B2C;4&#x7AE0; &#x8BBE;&#x8BA1;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;</h1>
<p>&#x5728;&#x524D;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E86;&#x89E3;&#x4E86;&#x4EE3;&#x8868;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4EE5;&#x53CA;&#x56F4;&#x7ED5;&#x5B83;&#x7684;&#x90E8;&#x7F72;&#x5DE5;&#x5177;&#x7684;&#x5404;&#x79CD;&#x65B9;&#x6CD5;&#x3002;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x770B;&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#x90E8;&#x7F72;&#x548C;&#x7BA1;&#x7406;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x5728;&#x4E0A;&#x4E00;&#x7AE0;&#x4E2D;&#x6211;&#x4EEC;&#x91CD;&#x70B9;&#x5173;&#x6CE8;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x8F6F;&#x4EF6;&#x7684;&#x5F00;&#x653E;&#x4E16;&#x754C;&#xFF0C;&#x6709;&#x65F6;&#x79F0;&#x4E3A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x5E94;&#x7528;&#x3002;</p>
<p>&#x5728;&#x4E91;&#x539F;&#x751F;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x4F20;&#x7EDF;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x9700;&#x8981;&#x6210;&#x4E3A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#x3002;&#x8FD9;&#x4ECD;&#x7136;&#x662F;&#x4E00;&#x79CD;&#x65B0;&#x5174;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x4E0E;&#x8FC7;&#x53BB;&#x7684;&#x5176;&#x4ED6;&#x8FD0;&#x8425;&#x89D2;&#x8272;&#x4E0D;&#x540C;&#x3002;&#x6211;&#x4EEC;&#x8FEB;&#x5207;&#x9700;&#x8981;&#x5F00;&#x59CB;&#x63A2;&#x7D22;&#x6A21;&#x5F0F;&#x548C;&#x5236;&#x5B9A;&#x6807;&#x51C6;&#x3002;</p>
<p>&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x8F6F;&#x4EF6;&#x4E0E;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x4EE3;&#x7801;&#x4E4B;&#x95F4;&#x7684;&#x6839;&#x672C;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF0C;&#x8F6F;&#x4EF6;&#x4F1A;&#x6301;&#x7EED;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x4F1A;&#x6839;&#x636E;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x521B;&#x5EFA;&#x6216;&#x6539;&#x53D8;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x672C;&#x7AE0;&#x540E;&#x9762;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x89E3;&#x91CA;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x8F6F;&#x4EF6;&#x7684;&#x65B0;&#x8303;&#x4F8B;&#x662F;&#xFF0C;&#x8F6F;&#x4EF6;&#x73B0;&#x5728;&#x4E0E;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5177;&#x6709;&#x66F4;&#x4F20;&#x7EDF;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5E76;&#x516C;&#x5F00;&#x7528;&#x4E8E;&#x5B9A;&#x4E49;&#x6240;&#x9700;&#x72B6;&#x6001;&#x7684;API&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8BE5;&#x8F6F;&#x4EF6;&#x53EF;&#x80FD;&#x4F1A;&#x6839;&#x636E;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x4E2D;&#x7684;&#x9700;&#x8981;&#x6539;&#x53D8;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x5730;&#x7BA1;&#x7406;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x672C;&#x8EAB;&#xFF01;&#x5E0C;&#x671B;&#x8FDB;&#x884C;&#x534F;&#x8C03;&#x7684;&#x72B6;&#x6001;&#x66F4;&#x6539;&#x901A;&#x8FC7;API&#x53D1;&#x9001;&#x5230;&#x8F6F;&#x4EF6;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x901A;&#x8FC7;&#x8FD0;&#x884C;&#x9759;&#x6001;&#x4EE3;&#x7801;&#x5E93;&#x4E2D;&#x7684;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x8FC8;&#x5411;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x8F6F;&#x4EF6;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x662F;&#x8BA9;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x610F;&#x8BC6;&#x5230;&#x81EA;&#x5DF1;&#x662F;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#x3002;&#x6211;&#x4EEC;&#x70ED;&#x70C8;&#x6B22;&#x8FCE;&#x60A8;&#x6765;&#x5230;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#xFF01;&#x5148;&#x524D;&#x7684;&#x5DE5;&#x5177;&#xFF08;&#x4F8B;&#x5982;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#xFF09;&#x4E5F;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x76EE;&#x6807;&#x6765;&#x6539;&#x53D8;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x7684;&#x5DE5;&#x4F5C;&#x804C;&#x80FD;&#xFF0C;&#x4F46;&#x662F;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x901A;&#x5E38;&#x53EA;&#x4F1A;&#x5728;&#x72ED;&#x7A84;&#x7684;&#x5E94;&#x7528;&#x8303;&#x56F4;&#x5185;&#x7F16;&#x5199;&#x6709;&#x9650;&#x7684;DSL&#xFF08;&#x5373;&#x5355;&#x4E00;&#x8282;&#x70B9;&#x62BD;&#x8C61;&#xFF09;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x4E00;&#x540D;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x60A8;&#x7684;&#x4EFB;&#x52A1;&#x4E0D;&#x4EC5;&#x662F;&#x638C;&#x63E1;&#x8BBE;&#x8BA1;&#x3001;&#x7BA1;&#x7406;&#x548C;&#x8FD0;&#x7EF4;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x57FA;&#x672C;&#x539F;&#x5219;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x5177;&#x6709;&#x5C06;&#x60A8;&#x7684;&#x4E13;&#x4E1A;&#x77E5;&#x8BC6;&#x5C01;&#x88C5;&#x6210;&#x575A;&#x5982;&#x78D0;&#x77F3;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x80FD;&#x529B;&#x3002;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x8868;&#x4E86;&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x7BA1;&#x7406;&#x548C;&#x6539;&#x53D8;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;</p>
<p>&#x6784;&#x5EFA;&#x7BA1;&#x7406;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x4E0D;&#x662F;&#x4E00;&#x4EF6;&#x5BB9;&#x6613;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6211;&#x4EEC;&#x6709;&#x7BA1;&#x7406;&#x4F20;&#x7EDF;&#x5E94;&#x7528;&#x7684;&#x6240;&#x6709;&#x95EE;&#x9898;&#x548C;&#x62C5;&#x5FE7;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x4EEC;&#x6B63;&#x5904;&#x4E8E;&#x4E00;&#x4E2A;&#x5C34;&#x5C2C;&#x7684;&#x5883;&#x5730;&#x3002;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x770B;&#x4E0A;&#x53BB;&#x4F3C;&#x4E4E;&#x5F88;&#x8352;&#x8C2C;&#xFF0C;&#x6784;&#x5EFA;&#x8F6F;&#x4EF6;&#x6765;&#x90E8;&#x7F72;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E4B;&#x4E0A;&#x8FD0;&#x884C;&#x76F8;&#x540C;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x8FD9;&#x5F88;&#x5C34;&#x5C2C;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x8FD9;&#x4E2A;&#x65B0;&#x9886;&#x57DF;&#x4E2D;&#x5DE5;&#x7A0B;&#x8F6F;&#x4EF6;&#x7684;&#x7EC6;&#x5FAE;&#x5DEE;&#x522B;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x7814;&#x7A76;&#x5728;&#x4E91;&#x539F;&#x751F;&#x793E;&#x533A;&#x4E2D;&#x5F97;&#x5230;&#x9A8C;&#x8BC1;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x4EE5;&#x4E86;&#x89E3;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7F16;&#x5199;&#x5E72;&#x51C0;&#x548C;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;&#x4F46;&#x9996;&#x5148;&#xFF0C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4ECE;&#x54EA;&#x91CC;&#x6765;&#xFF1F;</p>
<h2 id="&#x81EA;&#x4E3E;&#x95EE;&#x9898;">&#x81EA;&#x4E3E;&#x95EE;&#x9898;</h2>
<p>1987&#x5E74;3&#x6708;22&#x65E5;&#xFF0C;&#x5468;&#x65E5;&#xFF0C;Richard M. Stallman&#x53D1;&#x9001;&#x4E86;&#x4E00;&#x5C01;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5230;GCC&#x90AE;&#x4EF6;&#x5217;&#x8868;&#xFF0C;&#x62A5;&#x544A;&#x6210;&#x529F;&#x4F7F;&#x7528;C&#x7F16;&#x8BD1;&#x5668;&#x5B8C;&#x6210;&#x4E86;&#x81EA;&#x884C;&#x7F16;&#x8BD1;&#xFF1A;</p>
<p><em>&#x8BE5;&#x7F16;&#x8BD1;&#x5668;&#x5728;68020&#x4E0A;&#x7F16;&#x8BD1;&#x6B63;&#x786E;&#xFF0C;&#x6700;&#x8FD1;&#x53C8;&#x5728;vax&#x4E0A;&#x8FDB;&#x884C;&#x4E86;&#x7F16;&#x8BD1;&#x3002;&#x6700;&#x8FD1;&#x5728;68020&#x4E0A;&#x6B63;&#x786E;&#x7F16;&#x8BD1;&#x4E86;Emacs&#xFF0C;&#x5E76;&#x4E14;&#x8FD8;&#x7F16;&#x8BD1;&#x4E86;tex-in-C&#x548C;Kyoto Common Lisp&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x53EF;&#x80FD;&#x4ECD;&#x7136;&#x6709;&#x8BB8;&#x591A;&#x9519;&#x8BEF;&#xFF0C;&#x5E0C;&#x671B;&#x4F60;&#x80FD;&#x5E2E;&#x6211;&#x627E;&#x5230;&#x3002;</em></p>
<p><em>&#x6211;&#x5C06;&#x79BB;&#x5F00;&#x4E00;&#x4E2A;&#x6708;&#xFF0C;&#x6240;&#x4EE5;&#x73B0;&#x5728;&#x62A5;&#x544A;&#x7684;&#x9519;&#x8BEF;&#x5C06;&#x5F97;&#x4E0D;&#x5230;&#x5904;&#x7406;&#x3002;&#x2014;&#x2014;Richard M. Stallman</em></p>
<p>&#x8FD9;&#x662F;&#x8F6F;&#x4EF6;&#x5386;&#x53F2;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x8F6C;&#x6298;&#x70B9;&#xFF0C;&#x56E0;&#x4E3A;&#x5DE5;&#x7A0B;&#x8F6F;&#x4EF6;&#x9996;&#x6B21;&#x5B8C;&#x6210;&#x4E86;&#x81EA;&#x4E3E;&#x3002;Stallman&#x5F00;&#x521B;&#x4E86;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x81EA;&#x884C;&#x7F16;&#x8BD1;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x3002;&#x5373;&#x4F7F;&#x5728;&#x54F2;&#x5B66;&#x4E0A;&#x63A5;&#x53D7;&#x8FD9;&#x4E2A;&#x8868;&#x8FF0;&#x53EF;&#x80FD;&#x4E5F;&#x662F;&#x56F0;&#x96BE;&#x7684;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x6B63;&#x5728;&#x89E3;&#x51B3;&#x4E0E;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x76F8;&#x540C;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5DE5;&#x7A0B;&#x5E08;&#x5FC5;&#x987B;&#x60F3;&#x529E;&#x6CD5;&#x89E3;&#x51B3;&#x51E0;&#x4E4E;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x7CFB;&#x7EDF;&#x81EA;&#x4E3E;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x751F;&#x6548;&#x3002;</p>
<p>&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x624B;&#x52A8;&#x521B;&#x5EFA;&#x4E91;&#x8BA1;&#x7B97;&#x548C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;&#x5C3D;&#x7BA1;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x786E;&#x5B9E;&#x6709;&#x6548;&#xFF0C;&#x4F46;&#x5B83;&#x901A;&#x5E38;&#x4F34;&#x968F;&#x7740;&#x8B66;&#x544A;&#xFF0C;&#x5373;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x5E94;&#x8BE5;&#x5728;&#x90E8;&#x7F72;&#x66F4;&#x5408;&#x9002;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x540E;&#x9500;&#x6BC1;&#x521D;&#x59CB;&#x5F15;&#x5BFC;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4E4F;&#x5473;&#x3001;&#x96BE;&#x4EE5;&#x91CD;&#x590D;&#x4E14;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x4EBA;&#x4E3A;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x66F4;&#x4F18;&#x96C5;&#x548C;&#x4E91;&#x539F;&#x751F;&#x65B9;&#x6CD5;&#x662F;&#x505A;&#x51FA;&#xFF08;&#x901A;&#x5E38;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF09;&#x5047;&#x8BBE;&#xFF0C;&#x8BD5;&#x56FE;&#x5F15;&#x5BFC;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8F6F;&#x4EF6;&#x7684;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x6709;&#x672C;&#x5730;&#x673A;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x8FD9;&#x4E2A;&#x672C;&#x5730;&#x673A;&#x5668;&#x3002;&#x73B0;&#x6709;&#x673A;&#x5668;&#xFF08;&#x60A8;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF09;&#x53EF;&#x4F5C;&#x4E3A;&#x7B2C;&#x4E00;&#x4E2A;&#x90E8;&#x7F72;&#x5DE5;&#x5177;&#xFF0C;&#x81EA;&#x52A8;&#x5728;&#x4E91;&#x4E2D;&#x521B;&#x5EFA;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5C31;&#x4F4D;&#x540E;&#xFF0C;&#x60A8;&#x7684;&#x672C;&#x5730;&#x90E8;&#x7F72;&#x5DE5;&#x5177;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x81EA;&#x8EAB;&#x90E8;&#x7F72;&#x5230;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5E76;&#x6301;&#x7EED;&#x8FD0;&#x884C;&#x3002;&#x826F;&#x597D;&#x7684;&#x90E8;&#x7F72;&#x5DE5;&#x5177;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5728;&#x5B8C;&#x6210;&#x540E;&#x8F7B;&#x677E;&#x6E05;&#x7406;&#x3002;</p>
<p>&#x5728;&#x521D;&#x59CB;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5F15;&#x5BFC;&#x95EE;&#x9898;&#x89E3;&#x51B3;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6765;&#x5F15;&#x5BFC;&#x65B0;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;&#x73B0;&#x5728;&#x672C;&#x5730;&#x8BA1;&#x7B97;&#x673A;&#x5DF2;&#x7ECF;&#x88AB;&#x6392;&#x9664;&#x5728;&#x5916;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5B8C;&#x5168;&#x8FD0;&#x884C;&#x5728;&#x4E91;&#x7AEF;&#x3002;</p>
<h2 id="api">API</h2>
<p>&#x5728;&#x524D;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x8868;&#x793A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x5404;&#x79CD;&#x65B9;&#x6CD5;&#x3002;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x63A2;&#x8BA8;&#x4E3A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x63D0;&#x4F9B;API&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x5F53;&#x7528;&#x8F6F;&#x4EF6;&#x5B9E;&#x73B0;API&#x65F6;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x5B8C;&#x6210;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6839;&#x636E;&#x60A8;&#x4F7F;&#x7528;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x5C06;API&#x89C6;&#x4E3A;&#x7C7B;&#x3001;&#x5B57;&#x5178;&#x3001;&#x6570;&#x7EC4;&#x3001;&#x5BF9;&#x8C61;&#x6216;&#x7ED3;&#x6784;&#x662F;&#x5B89;&#x5168;&#x7684;&#x3002;</p>
<p>API&#x5C06;&#x662F;&#x6570;&#x636E;&#x503C;&#x7684;&#x4EFB;&#x610F;&#x5B9A;&#x4E49;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x3001;&#x6574;&#x6570;&#x6216;&#x5E03;&#x5C14;&#x503C;&#x3002;API&#x5C06;&#x901A;&#x8FC7;JSON&#x6216;YAML&#x683C;&#x5F0F;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#x548C;&#x89E3;&#x7801;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x5B58;&#x50A8;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#x6765;&#x8BF4;&#xFF0C;&#x4E3A;&#x7A0B;&#x5E8F;&#x63D0;&#x4F9B;&#x53EF;&#x7248;&#x672C;&#x5316;&#x7684;API&#x662F;&#x5F88;&#x5E38;&#x89C1;&#x7684;&#x505A;&#x6CD5;&#x3002;&#x8FD9;&#x5141;&#x8BB8;&#x7A0B;&#x5E8F;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x79FB;&#x52A8;&#x3001;&#x6539;&#x53D8;&#x548C;&#x589E;&#x957F;&#x3002;&#x5DE5;&#x7A0B;&#x5E08;&#x53EF;&#x4EE5;&#x58F0;&#x79F0;&#x652F;&#x6301;&#x8F83;&#x65E7;&#x7684;API&#x7248;&#x672C;&#x5E76;&#x63D0;&#x4F9B;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x6027;&#x4FDD;&#x8BC1;&#x3002;&#x5728;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x8F6F;&#x4EF6;&#x4E2D;&#xFF0C;&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x539F;&#x56E0;&#xFF0C;&#x4F7F;&#x7528;API&#x662F;&#x4F18;&#x9009;&#x7684;&#x3002;</p>
<p>&#x5BFB;&#x627E;&#x4E00;&#x4E2A;API&#x4F5C;&#x4E3A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x63A5;&#x53E3;&#x662F;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x8F6F;&#x4EF6;&#x7684;&#x8BB8;&#x591A;&#x7EBF;&#x7D22;&#x4E4B;&#x4E00;&#x3002;&#x4F20;&#x7EDF;&#x4E0A;&#xFF0C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x4EE3;&#x7801;&#x662F;&#x7528;&#x6237;&#x5C06;&#x8981;&#x7BA1;&#x7406;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x76F4;&#x63A5;&#x8868;&#x793A;&#xFF0C;&#x800C;API&#x662F;&#x7BA1;&#x7406;&#x7684;&#x786E;&#x5207;&#x5E95;&#x5C42;&#x8D44;&#x6E90;&#x4E4B;&#x4E0A;&#x7684;&#x62BD;&#x8C61;&#x3002;</p>
<p>&#x6700;&#x7EC8;&#xFF0C;API&#x53EA;&#x662F;&#x4EE3;&#x8868;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<h2 id="&#x72B6;&#x6001;">&#x72B6;&#x6001;</h2>
<p>&#x5728;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x8F6F;&#x4EF6;&#x5DE5;&#x5177;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x7BA1;&#x7406;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5BF9;&#x8C61;&#x72B6;&#x6001;&#x53EA;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x5BF9;&#x8F6F;&#x4EF6;&#x7684;&#x5BA1;&#x8BA1;&#x8868;&#x793A;&#x3002;</p>
<p>&#x5BF9;&#x8C61;&#x7684;&#x72B6;&#x6001;&#x6700;&#x7EC8;&#x5C06;&#x56DE;&#x5230;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8868;&#x793A;&#x7684;&#x5185;&#x5B58;&#x4E2D;&#x3002;&#x8FD9;&#x4E9B;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x8868;&#x793A;&#x5E94;&#x6620;&#x5C04;&#x5230;&#x7528;&#x4E8E;&#x58F0;&#x660E;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x539F;&#x59CB;API&#x3002;&#x5BA1;&#x8BA1;&#x7684;API&#x6216;&#x5BF9;&#x8C61;&#x72B6;&#x6001;&#x901A;&#x5E38;&#x9700;&#x8981;&#x4FDD;&#x5B58;&#x3002;</p>
<p>&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#xFF08;&#x6709;&#x65F6;&#x79F0;&#x4E3A;&#x72B6;&#x6001;&#x5B58;&#x50A8;&#xFF09;&#x53EF;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x65B0;&#x5BA1;&#x8BA1;&#x7684;API&#x3002;&#x4ECB;&#x8D28;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x4F55;&#x4F20;&#x7EDF;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F8B;&#x5982;&#x672C;&#x5730;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3001;&#x4E91;&#x5BF9;&#x8C61;&#x5B58;&#x50A8;&#x6216;&#x6570;&#x636E;&#x5E93;&#x3002;&#x5982;&#x679C;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5728;&#x7C7B;&#x4F3C;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x5B58;&#x50A8;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x5DE5;&#x5177;&#x5C06;&#x5F88;&#x53EF;&#x80FD;&#x4EE5;&#x903B;&#x8F91;&#x65B9;&#x5F0F;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x4EE5;&#x4FBF;&#x53EF;&#x4EE5;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x8F7B;&#x677E;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#x548C;&#x89E3;&#x7801;&#x3002;&#x5E38;&#x89C1;&#x7684;&#x7F16;&#x7801;&#x5305;&#x62EC;JSON&#x3001;YAML&#x548C;TOML&#x3002;</p>
<p>&#x5F53;&#x8BBE;&#x8BA1;&#x7A0B;&#x5E8F;&#x65F6;&#x60A8;&#x53EF;&#x80FD;&#x4F1A;&#x60F3;&#x8981;&#x5C06;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x7684;&#x7279;&#x6743;&#x4FE1;&#x606F;&#x5B58;&#x50A8;&#x8D77;&#x6765;&#x3002;&#x8FD9;&#x7A76;&#x7ADF;&#x662F;&#x4E0D;&#x662F;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x5177;&#x4F53;&#x53D6;&#x51B3;&#x4E8E;&#x60A8;&#x7684;&#x5B89;&#x5168;&#x6027;&#x8981;&#x6C42;&#x4EE5;&#x53CA;&#x60A8;&#x8BA1;&#x5212;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x8BB0;&#x4F4F;&#x5B58;&#x50A8;&#x79D8;&#x5BC6;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x6F0F;&#x6D1E;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x5728;&#x8BBE;&#x8BA1;&#x8F6F;&#x4EF6;&#x6765;&#x63A7;&#x5236;&#x5806;&#x6808;&#x6700;&#x57FA;&#x672C;&#x7684;&#x90E8;&#x5206;&#x65F6;&#xFF0C;&#x5B89;&#x5168;&#x6027;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;&#x6240;&#x4EE5;&#x901A;&#x5E38;&#x503C;&#x5F97;&#x989D;&#x5916;&#x7684;&#x52AA;&#x529B;&#x6765;&#x786E;&#x4FDD;&#x79D8;&#x5BC6;&#x662F;&#x5B89;&#x5168;&#x7684;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x5B58;&#x50A8;&#x6709;&#x5173;&#x7A0B;&#x5E8F;&#x548C;&#x4E91;&#x63D0;&#x4F9B;&#x5546;&#x51ED;&#x8BC1;&#x7684;&#x5143;&#x4FE1;&#x606F;&#x4E4B;&#x5916;&#xFF0C;&#x5DE5;&#x7A0B;&#x5E08;&#x8FD8;&#x9700;&#x8981;&#x5B58;&#x50A8;&#x6709;&#x5173;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x91CD;&#x8981;&#x7684;&#x662F;&#x8981;&#x8BB0;&#x4F4F;&#xFF0C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5C06;&#x4EE5;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x5448;&#x73B0;&#xFF0C;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BE5;&#x7A0B;&#x5E8F;&#x6613;&#x4E8E;&#x89E3;&#x7801;&#x3002;&#x8BB0;&#x4F4F;&#x5BF9;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#x4E0D;&#x4F1A;&#x7ACB;&#x5373;&#x53D1;&#x751F;&#xFF0C;&#x800C;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x4E5F;&#x5F88;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x5B58;&#x50A8;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x5E76;&#x80FD;&#x591F;&#x8F7B;&#x677E;&#x8BBF;&#x95EE;&#x662F;&#x8BBE;&#x8BA1;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7BA1;&#x7406;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x91CD;&#x8981;&#x90E8;&#x5206;&#x3002;&#x4EC5;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5B9A;&#x4E49;&#x5F88;&#x53EF;&#x80FD;&#x5C31;&#x5DF2;&#x7ECF;&#x662F;&#x7CFB;&#x7EDF;&#x4E2D;&#x6700;&#x5177;&#x667A;&#x6167;&#x4EF7;&#x503C;&#x7684;&#x90E8;&#x5206;&#x3002;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x770B;&#x770B;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x548C;&#x7A0B;&#x5E8F;&#x5982;&#x4F55;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x91CD;&#x65B0;&#x5BA1;&#x89C6;&#x4F8B;4-1&#x81F3;4-4&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x88AB;&#x7528;&#x4F5C;&#x672C;&#x7AE0;&#x8FDB;&#x4E00;&#x6B65;&#x6F14;&#x793A;&#x7684;&#x5177;&#x4F53;&#x4F8B;&#x5B50;&#x3002;</p>
<p><strong>&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x72B6;&#x6001;&#x5B58;&#x50A8;&#x793A;&#x4F8B;</strong></p>
<p>&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;state&#x7684;&#x76EE;&#x5F55;&#x4E2D;&#x3002;&#x5728;&#x8BE5;&#x76EE;&#x5F55;&#x4E2D;&#xFF0C;&#x6709;&#x4E09;&#x4E2A;&#x6587;&#x4EF6;&#xFF1A;</p>
<ul>
<li>meta_information.yaml</li>
<li>secrets.yaml</li>
<li>infrastructure.yaml</li>
</ul>
<p>&#x8FD9;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x53EF;&#x4EE5;&#x51C6;&#x786E;&#x5730;&#x5C01;&#x88C5;&#x9700;&#x8981;&#x4FDD;&#x7559;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4EE5;&#x4FBF;&#x6709;&#x6548;&#x7BA1;&#x7406;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;</p>
<p><code>secrets.yaml</code>&#x548C;<code>infrastructure.yaml</code>&#x6587;&#x4EF6;&#x5B58;&#x50A8;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#xFF0C;<code>meta_information.yaml</code>&#x6587;&#x4EF6;&#xFF08;&#x793A;&#x4F8B;4-1&#xFF09;&#x5B58;&#x50A8;&#x5176;&#x4ED6;&#x91CD;&#x8981;&#x4FE1;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E0A;&#x6B21;&#x8C03;&#x914D;&#x65F6;&#x95F4;&#xFF0C;&#x8C03;&#x914D;&#x65F6;&#x95F4;&#x548C;&#x65E5;&#x5FD7;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x4F8B;4-1. state/meta_information.yaml</p>
<pre class="language-"><code class="lang-yaml"><span class="token key atrule">lastExecution</span><span class="token punctuation">:</span>
  <span class="token key atrule">exitCode</span><span class="token punctuation">:</span> <span class="token number">0</span>
  <span class="token key atrule">timestamp</span><span class="token punctuation">:</span> <span class="token datetime number">2017-08-01 15:32:11 +00:00</span>
  <span class="token key atrule">user</span><span class="token punctuation">:</span> kris
  <span class="token key atrule">logFile</span><span class="token punctuation">:</span> /var/log/infra.log
</code></pre>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x6587;&#x4EF6;<code>secrets.yaml</code>&#x4FDD;&#x5B58;&#x79C1;&#x4EBA;&#x4FE1;&#x606F;&#xFF0C;&#x7528;&#x4E8E;&#x5728;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x4EE5;&#x4EFB;&#x610F;&#x65B9;&#x5F0F;&#x9A8C;&#x8BC1;&#xFF08;&#x4F8B;4-2&#xFF09;&#x3002;</p>
<p>&#x91CD;&#x7533;&#x4E00;&#x4E0B;&#xFF0C;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5B58;&#x50A8;&#x79D8;&#x5BC6;&#x53EF;&#x80FD;&#x662F;&#x4E0D;&#x5B89;&#x5168;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x4EC5;&#x4EE5;<code>secrets.yaml</code>&#x4E3A;&#x4F8B;&#x3002;</p>
<p>&#x4F8B;4-2. state/secrets.yaml</p>
<pre class="language-"><code class="lang-yaml"><span class="token key atrule">apiAccessToken</span><span class="token punctuation">:</span> a8233fc28d09a9c27b2e2f
<span class="token key atrule">apiSecret</span><span class="token punctuation">:</span> 8a2976744f239eaa9287f83b23309023d
<span class="token key atrule">privateKeyPath</span><span class="token punctuation">:</span> ~/.ssh/id_rsa
</code></pre>
<p>&#x7B2C;&#x4E09;&#x4E2A;&#x6587;&#x4EF6;<code>infrastructure.yaml</code>&#x5C06;&#x5305;&#x542B;API&#x7684;&#x7F16;&#x7801;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#xFF0C;&#x5305;&#x62EC;&#x4F7F;&#x7528;&#x7684;API&#x7248;&#x672C;&#xFF08;&#x793A;&#x4F8B;4-3&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x627E;&#x5230;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8868;&#x793A;&#xFF0C;&#x4F8B;&#x5982;&#x7F51;&#x7EDC;&#x548C;DNS&#x4FE1;&#x606F;&#xFF0C;&#x9632;&#x706B;&#x5899;&#x89C4;&#x5219;&#x548C;&#x865A;&#x62DF;&#x673A;&#x5B9A;&#x4E49;&#x3002;</p>
<p>&#x4F8B;4-3. state/infrastructure.yaml</p>
<pre class="language-"><code class="lang-yaml"><span class="token key atrule">location</span><span class="token punctuation">:</span> <span class="token string">&quot;San Francisco 2&quot;</span>
<span class="token key atrule">name</span><span class="token punctuation">:</span> infra1
<span class="token key atrule">dns</span><span class="token punctuation">:</span>
    <span class="token key atrule">fqdn</span><span class="token punctuation">:</span> infra.example.com
<span class="token key atrule">network</span><span class="token punctuation">:</span>
  <span class="token key atrule">cidr</span><span class="token punctuation">:</span> 10.0.0.0/12
  <span class="token key atrule">serverPools</span><span class="token punctuation">:</span>
  <span class="token punctuation">-</span> <span class="token key atrule">bootstrapScript</span><span class="token punctuation">:</span> /opt/infra/bootstrap.sh
    <span class="token key atrule">diskSize</span><span class="token punctuation">:</span> large
    <span class="token key atrule">workload</span><span class="token punctuation">:</span> medium
    <span class="token key atrule">memory</span><span class="token punctuation">:</span> medium
    <span class="token key atrule">subnetHostsCount</span><span class="token punctuation">:</span> <span class="token number">256</span>
    <span class="token key atrule">firewalls</span><span class="token punctuation">:</span>
      <span class="token punctuation">-</span> <span class="token key atrule">rules</span><span class="token punctuation">:</span>
          <span class="token punctuation">-</span> <span class="token key atrule">ingressFromPort</span><span class="token punctuation">:</span> <span class="token number">22</span>
            <span class="token key atrule">ingressProtocol</span><span class="token punctuation">:</span> tcp
            <span class="token key atrule">ingressSource</span><span class="token punctuation">:</span> 0.0.0.0/0
            <span class="token key atrule">ingressToPort</span><span class="token punctuation">:</span> <span class="token number">22</span>
    <span class="token key atrule">image</span><span class="token punctuation">:</span> ubuntu<span class="token punctuation">-</span>16<span class="token punctuation">-</span>04<span class="token punctuation">-</span>x64
</code></pre>
<p>&#x8D77;&#x521D;<code>infrastructure.yaml</code>&#x6587;&#x4EF6;&#x53EF;&#x80FD;&#x770B;&#x8D77;&#x6765;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4EE3;&#x7801;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4ED4;&#x7EC6;&#x89C2;&#x5BDF;&#xFF0C;&#x60A8;&#x4F1A;&#x53D1;&#x73B0;&#x8BB8;&#x591A;&#x5B9A;&#x4E49;&#x7684;&#x6307;&#x4EE4;&#x90FD;&#x662F;&#x5177;&#x4F53;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E4B;&#x4E0A;&#x7684;&#x62BD;&#x8C61;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<code>subnetHostsCount</code>&#x6307;&#x4EE4;&#x662F;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x503C;&#x5E76;&#x5B9A;&#x4E49;&#x4E86;&#x5B50;&#x7F51;&#x4E2D;&#x4E3B;&#x673A;&#x7684;&#x9884;&#x5B9A;&#x6570;&#x91CF;&#x3002;&#x8BE5;&#x7A0B;&#x5E8F;&#x5C06;&#x8BBE;&#x6CD5;&#x4E3A;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x5212;&#x5206;&#x7F51;&#x7EDC;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x66F4;&#x5927;&#x7684;&#x65E0;&#x7C7B;&#x522B;&#x57DF;&#x95F4;&#x8DEF;&#x7531;&#xFF08;CIDR&#xFF09;&#x503C;&#x3002;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x4E0D;&#x4F1A;&#x58F0;&#x660E;&#x5B50;&#x7F51;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x58F0;&#x660E;&#x6709;&#x591A;&#x5C11;&#x4E3B;&#x673A;&#x3002;&#x8F6F;&#x4EF6;&#x4F1A;&#x5E2E;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x5B8C;&#x6210;&#x5269;&#x4E0B;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x65B0;API&#x5E76;&#x5C06;&#x65B0;&#x7684;&#x8868;&#x793A;&#x5199;&#x5165;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x533A;&#xFF08;&#x672C;&#x6848;&#x4F8B;&#x4E2D;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF09;&#x3002;&#x7EE7;&#x7EED;&#x6211;&#x4EEC;&#x7684;<code>subnetHostsCount</code>&#x793A;&#x4F8B;&#xFF0C;&#x5047;&#x8BBE;&#x7A0B;&#x5E8F;&#x786E;&#x5B9E;&#x4E3A;&#x6211;&#x4EEC;&#x6311;&#x9009;&#x4E86;&#x4E00;&#x4E2A;&#x5B50;&#x7F51;CIDR&#x3002;&#x65B0;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x53EF;&#x80FD;&#x5982;&#x4F8B;4-4&#x6240;&#x793A;&#x3002;</p>
<pre class="language-"><code class="lang-yaml"><span class="token key atrule">location</span><span class="token punctuation">:</span> <span class="token string">&quot;San Francisco 2&quot;</span>
<span class="token key atrule">name</span><span class="token punctuation">:</span> infra1
<span class="token key atrule">dns</span><span class="token punctuation">:</span>
    <span class="token key atrule">fqdn</span><span class="token punctuation">:</span> infra.example.com
<span class="token key atrule">network</span><span class="token punctuation">:</span>
  <span class="token key atrule">cidr</span><span class="token punctuation">:</span> 10.0.0.0/12
<span class="token key atrule">serverPools</span><span class="token punctuation">:</span>
  <span class="token punctuation">-</span> <span class="token key atrule">bootstrapScript</span><span class="token punctuation">:</span> /opt/infra/bootstrap.sh
    <span class="token key atrule">diskSize</span><span class="token punctuation">:</span> large
    <span class="token key atrule">workload</span><span class="token punctuation">:</span> medium
    <span class="token key atrule">memory</span><span class="token punctuation">:</span> medium
    <span class="token key atrule">subnetHostsCount</span><span class="token punctuation">:</span> <span class="token number">256</span>
    <span class="token key atrule">assignedSubnetCIDR</span><span class="token punctuation">:</span> 10.0.100.0/24
    <span class="token key atrule">firewalls</span><span class="token punctuation">:</span>
      <span class="token punctuation">-</span> <span class="token key atrule">rules</span><span class="token punctuation">:</span>
          <span class="token punctuation">-</span> <span class="token key atrule">ingressFromPort</span><span class="token punctuation">:</span> <span class="token number">22</span>
            <span class="token key atrule">ingressProtocol</span><span class="token punctuation">:</span> tcp
            <span class="token key atrule">ingressSource</span><span class="token punctuation">:</span> 0.0.0.0/0
            <span class="token key atrule">ingressToPort</span><span class="token punctuation">:</span> <span class="token number">22</span>
    <span class="token key atrule">image</span><span class="token punctuation">:</span> ubuntu<span class="token punctuation">-</span>16<span class="token punctuation">-</span>04<span class="token punctuation">-</span>x64
</code></pre>
<p>&#x8BF7;&#x6CE8;&#x610F;&#x7A0B;&#x5E8F;&#x5982;&#x4F55;&#x7F16;&#x5199;assignedSubnetCIDR&#x6307;&#x4EE4;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7531;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x64CD;&#x4F5C;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x8BF7;&#x8BB0;&#x4F4F;&#x66F4;&#x65B0;API&#x7684;&#x7A0B;&#x5E8F;&#x662F;&#x7528;&#x6237;&#x5982;&#x4F55;&#x4EE5;&#x8F6F;&#x4EF6;&#x65B9;&#x5F0F;&#x4E0E;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x7684;&#x6807;&#x5FD7;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x4E3B;&#x5F20;&#x4F7F;&#x7528;&#x62BD;&#x8C61;&#x8BA1;&#x7B97;&#x5B50;&#x7F51;CIDR&#x3002;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x4F8B;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x8FDB;&#x884C;&#x4E0D;&#x540C;&#x7684;&#x62BD;&#x8C61;&#x548C;&#x5B9E;&#x73B0;&#x3002;&#x5173;&#x4E8E;&#x6784;&#x5EFA;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4E00;&#x4E2A;&#x597D;&#x5904;&#x662F;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x4EE5;&#x4EFB;&#x4F55;&#x4ED6;&#x4EEC;&#x8BA4;&#x4E3A;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x81EA;&#x5DF1;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x5F0F;&#x8BBE;&#x8BA1;&#x8F6F;&#x4EF6;&#x3002;</p>
<p>&#x6570;&#x636E;&#x5B58;&#x50A8;&#xFF08;<code>infrastructure.yaml</code>&#x6587;&#x4EF6;&#xFF09;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x9886;&#x57DF;&#x7684;&#x4F20;&#x7EDF;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8BE5;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5BF9;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x5B8C;&#x5168;&#x7684;&#x5199;&#x5165;&#x63A7;&#x5236;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x8FD9;&#x4F1A;&#x5E26;&#x6765;&#x98CE;&#x9669;&#xFF0C;&#x4F46;&#x5BF9;&#x5DE5;&#x7A0B;&#x5E08;&#x6765;&#x8BF4;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x80DC;&#x5229;&#x3002;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8868;&#x793A;&#x4E0D;&#x5FC5;&#x5B58;&#x50A8;&#x5728;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x6587;&#x4EF6;&#x4E2D;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x5728;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x4E2D;&#xFF0C;&#x5982;&#x4F20;&#x7EDF;&#x6570;&#x636E;&#x5E93;&#x6216;&#x952E;/&#x503C;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x7406;&#x89E3;&#x8F6F;&#x4EF6;&#x5982;&#x4F55;&#x5904;&#x7406;&#x8FD9;&#x79CD;&#x65B0;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8868;&#x793A;&#x7684;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x7406;&#x89E3;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4E24;&#x79CD;&#x72B6;&#x6001;&#x2014;&#x2014;API&#x5F62;&#x5F0F;&#x7684;&#x9884;&#x671F;&#x72B6;&#x6001;&#xFF0C;&#x53EF;&#x5728;<code>infrastructure.yaml</code>&#x6587;&#x4EF6;&#x4E2D;&#x627E;&#x5230;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x53EF;&#x4EE5;&#x5728;&#x73B0;&#x5B9E;&#xFF08;&#x6216;&#x5BA1;&#x8BA1;&#xFF09;&#x4E2D;&#x89C2;&#x5BDF;&#x5230;&#x7684;&#x5B9E;&#x9645;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x8F6F;&#x4EF6;&#x8FD8;&#x6CA1;&#x6709;&#x505A;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#x6216;&#x8005;&#x91C7;&#x53D6;&#x4EFB;&#x4F55;&#x884C;&#x52A8;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x6B63;&#x5904;&#x4E8E;&#x7BA1;&#x7406;&#x65F6;&#x95F4;&#x7EBF;&#x7684;&#x5F00;&#x59CB;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5B9E;&#x9645;&#x72B6;&#x6001;&#x5C06;&#x662F;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x800C;&#x9884;&#x671F;&#x72B6;&#x6001;&#x5C06;&#x662F;&#x5C01;&#x88C5;&#x5728;<code>infrastructure.yaml</code>&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x72B6;&#x6001;&#x3002;</p>
<h2 id="&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;">&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;</h2>
<p>&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#xFF08;reconciler pattern&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x8F6F;&#x4EF6;&#x6A21;&#x5F0F;&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x7BA1;&#x7406;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;&#x8BE5;&#x6A21;&#x5F0F;&#x5F3A;&#x5316;&#x4E86;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x4E24;&#x79CD;&#x8868;&#x73B0;&#x5F62;&#x5F0F;&#x2014;&#x2014;&#x7B2C;&#x4E00;&#x79CD;&#x662F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x5B9E;&#x9645;&#x72B6;&#x6001;&#xFF0C;&#x7B2C;&#x4E8C;&#x79CD;&#x662F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x9884;&#x671F;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x5C06;&#x8FEB;&#x4F7F;&#x5DE5;&#x7A0B;&#x5E08;&#x4EE5;&#x4E24;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x9014;&#x5F84;&#x5FD8;&#x8BB0;&#x8FD9;&#x4E9B;&#x8868;&#x793A;&#xFF0C;&#x4EE5;&#x53CA;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4EE5;&#x534F;&#x8C03;&#x5B9E;&#x9645;&#x72B6;&#x6001;&#x8FBE;&#x5230;&#x9884;&#x671F;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x534F;&#x8C03;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x5957;&#x56DB;&#x79CD;&#x65B9;&#x6CD5;&#x548C;&#x56DB;&#x79CD;&#x54F2;&#x5B66;&#x89C4;&#x5219;&#xFF1A;</p>
<ol>
<li>&#x6240;&#x6709;&#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x90FD;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</li>
<li>&#x786E;&#x4FDD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#x3002;</li>
<li>&#x4FDD;&#x6301;&#x8D44;&#x6E90;&#x6620;&#x5C04;&#x7B80;&#x5355;&#x3002;</li>
<li>&#x4F7F;&#x5B9E;&#x9645;&#x72B6;&#x6001;&#x7B26;&#x5408;&#x9884;&#x671F;&#x72B6;&#x6001;&#x3002;</li>
</ol>
<p>&#x8FD9;&#x4E9B;&#x6A21;&#x5F0F;&#x7684;&#x6D88;&#x8D39;&#x8005;&#x53EF;&#x4EE5;&#x4F9D;&#x9760;&#x8FD9;&#x4E9B;&#x5F3A;&#x5927;&#x7684;&#x4FDD;&#x8BC1;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C06;&#x6D88;&#x8D39;&#x8005;&#x4ECE;&#x5B9E;&#x65BD;&#x7EC6;&#x8282;&#x4E2D;&#x89E3;&#x653E;&#x51FA;&#x6765;&#x3002;</p>
<h3 id="&#x89C4;&#x5219;1&#xFF1A;&#x4E3A;&#x6240;&#x6709;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x7ED3;&#x6784;">&#x89C4;&#x5219;1&#xFF1A;&#x4E3A;&#x6240;&#x6709;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x7ED3;&#x6784;</h3>
<p>&#x5B9E;&#x73B0;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x7684;&#x65B9;&#x6CD5;&#x53EA;&#x80FD;&#x63A5;&#x53D7;&#x548C;&#x8FD4;&#x56DE;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x7ED3;&#x6784;&#x5FC5;&#x987B;&#x5728;&#x8C03;&#x89E3;&#x5668;&#x5B9E;&#x73B0;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E4B;&#x5916;&#x5B9A;&#x4E49;&#xFF0C;&#x4F46;&#x5B9E;&#x73B0;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#x5B83;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x4EC5;&#x63A5;&#x53D7;&#x7528;&#x4E8E;&#x8F93;&#x5165;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5E76;&#x5C06;&#x5176;&#x4F5C;&#x4E3A;&#x8F93;&#x51FA;&#x8FD4;&#x56DE;&#xFF0C;&#x6D88;&#x8D39;&#x8005;&#x53EF;&#x4EE5;&#x534F;&#x8C03;&#x5176;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x4EFB;&#x4F55;&#x7ED3;&#x6784;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x62C5;&#x5FC3;&#x8BE5;&#x534F;&#x8C03;&#x5982;&#x4F55;&#x53D1;&#x751F;&#x3002;&#x8FD9;&#x4E5F;&#x5141;&#x8BB8;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x6216;&#x8005;&#x7A0B;&#x5E8F;&#x7684;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x4E2D;&#x6539;&#x53D8;&#x3001;&#x4FEE;&#x6539;&#x6216;&#x5207;&#x6362;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5C3D;&#x53EF;&#x80FD;&#x7ECF;&#x5E38;&#x9075;&#x5B88;&#x7B2C;&#x4E00;&#x6761;&#x89C4;&#x5219;&#xFF0C;&#x4F46;&#x662F;&#x6C38;&#x8FDC;&#x4E0D;&#x8981;&#x5C06;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x4EE3;&#x7801;&#x5E93;&#x7D27;&#x5BC6;&#x7ED3;&#x5408;&#x4E5F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x59CB;&#x7EC8;&#x9075;&#x5B88;&#x6700;&#x4F73;&#x7684;&#x62BD;&#x8C61;&#x548C;&#x5206;&#x79BB;&#x5B9E;&#x8DF5;&#xFF0C;&#x7EDD;&#x4E0D;&#x4F7F;&#x7528;API&#x7684;&#x5B50;&#x96C6;&#x6765;&#x4F20;&#x9012;&#x51FD;&#x6570;&#x6216;&#x7C7B;&#x3002;</p>
<h3 id="&#x89C4;&#x5219;2&#xFF1A;&#x786E;&#x4FDD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0D;&#x53EF;&#x53D8;">&#x89C4;&#x5219;2&#xFF1A;&#x786E;&#x4FDD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0D;&#x53EF;&#x53D8;</h3>
<p>&#x8003;&#x8651;&#x50CF;&#x5408;&#x540C;&#x6216;&#x62C5;&#x4FDD;&#x8FD9;&#x6837;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x5728;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#xFF0C;&#x5B9E;&#x9645;&#x548C;&#x671F;&#x671B;&#x7684;&#x7ED3;&#x6784;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x8BBE;&#x7F6E;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x3002;&#x8FD9;&#x4FDD;&#x8BC1;&#x4E86;&#x5728;&#x8C03;&#x89E3;&#x4E4B;&#x524D;&#x7ED3;&#x6784;&#x662F;&#x51C6;&#x786E;&#x7684;&#x3002;&#x5728;&#x534F;&#x8C03;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x7ED3;&#x6784;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x76F8;&#x540C;&#x4FDD;&#x8BC1;&#x7684;&#x65B0;&#x7ED3;&#x6784;&#x3002;&#x660E;&#x667A;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x5F3A;&#x5236;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x4E0D;&#x53D8;&#x6027;&#xFF0C;&#x5373;&#x4F7F;&#x5DE5;&#x7A0B;&#x5E08;&#x8BD5;&#x56FE;&#x6539;&#x53D8;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5B83;&#x4E5F;&#x4E0D;&#x4F1A;&#x5DE5;&#x4F5C;&#xFF0C;&#x6216;&#x8005;&#x7A0B;&#x5E8F;&#x4F1A;&#x51FA;&#x9519;&#xFF08;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x4F1A;&#x7F16;&#x8BD1;&#x4E0D;&#x8FC7;&#xFF09;&#x3002;</p>
<p>&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6838;&#x5FC3;&#x7EC4;&#x4EF6;&#x662F;&#x5C06;&#x8868;&#x793A;&#x6620;&#x5C04;&#x5230;&#x4E00;&#x7EC4;&#x8D44;&#x6E90;&#x7684;&#x80FD;&#x529B;&#x3002;&#x8D44;&#x6E90;&#x662F;&#x9700;&#x8981;&#x8FD0;&#x884C;&#x4EE5;&#x6EE1;&#x8DB3;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8981;&#x6C42;&#x7684;&#x5355;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x5C06;&#x8D1F;&#x8D23;&#x4EE5;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x66F4;&#x6539;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;</p>
<p>&#x57FA;&#x672C;&#x793A;&#x4F8B;&#x53EF;&#x80FD;&#x662F;&#x90E8;&#x7F72;&#x65B0;&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x8BBE;&#x7F6E;&#x65B0;&#x7F51;&#x7EDC;&#x6216;&#x914D;&#x7F6E;&#x73B0;&#x6709;&#x865A;&#x62DF;&#x673A;&#x3002;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x5355;&#x5143;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x5C06;&#x88AB;&#x79F0;&#x4E3A;&#x8D44;&#x6E90;&#x3002;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x90FD;&#x5E94;&#x6620;&#x5C04;&#x5230;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8D1F;&#x8D23;&#x63A8;&#x7406;&#x7ED3;&#x6784;&#x5E76;&#x521B;&#x5EFA;&#x8D44;&#x6E90;&#x96C6;&#x3002;&#x56FE;4-1&#x4E2D;&#x663E;&#x793A;&#x4E86;API&#x6620;&#x5C04;&#x5230;&#x5355;&#x4E2A;&#x8D44;&#x6E90;&#x7684;&#x793A;&#x4F8B;&#x3002;</p>
<p><img src="../images/f-4-1.jpg" alt="f4-1"></p>
<p>&#x56FE;4-1. &#x5C06;&#x7ED3;&#x6784;&#x6620;&#x5C04;&#x5230;&#x8D44;&#x6E90;&#x7684;&#x56FE;&#x8868;</p>
<p>&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x6F14;&#x793A;&#x4E86;&#x4E00;&#x79CD;&#x5904;&#x7406;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x7A33;&#x5B9A;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4F1A;&#x6539;&#x53D8;&#x8D44;&#x6E90;&#x3002;&#x7531;&#x4E8E;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x9700;&#x8981;&#x6BD4;&#x8F83;&#x8D44;&#x6E90;&#x72B6;&#x6001;&#xFF0C;&#x6240;&#x4EE5;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5FC5;&#x987B;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x65E0;&#x8BBA;&#x4F55;&#x65F6;&#x9700;&#x8981;&#x66F4;&#x65B0;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x90FD;&#x5FC5;&#x987B;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x53D8;&#x5316;&#x3002;&#x6BCF;&#x6B21;&#x53D1;&#x751F;&#x7A81;&#x53D8;&#x65F6;&#xFF0C;&#x5B9E;&#x9645;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x90FD;&#x662F;&#x9648;&#x65E7;&#x7684;&#x3002;&#x4E00;&#x4E2A;&#x806A;&#x660E;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x610F;&#x8BC6;&#x5230;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5E76;&#x76F8;&#x5E94;&#x5730;&#x5904;&#x7406;&#x5B83;&#x3002;</p>
<p>&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x5728;&#x53D1;&#x751F;&#x7A81;&#x53D8;&#x65F6;&#x66F4;&#x65B0;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x5982;&#x679C;&#x6BCF;&#x6B21;&#x7A81;&#x53D8;&#x90FD;&#x66F4;&#x65B0;&#x5B9E;&#x9645;&#x72B6;&#x6001;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x89C2;&#x5BDF;&#x8C03;&#x89E3;&#x8FC7;&#x7A0B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B9E;&#x9645;&#x72B6;&#x6001;&#x4F1A;&#x968F;&#x65F6;&#x95F4;&#x7ECF;&#x5386;&#x4E00;&#x7CFB;&#x5217;&#x66F4;&#x6539;&#xFF0C;&#x76F4;&#x5230;&#x6700;&#x7EC8;&#x5339;&#x914D;&#x9884;&#x671F;&#x72B6;&#x6001;&#x5E76;&#x4E14;&#x8C03;&#x89E3;&#x5B8C;&#x6210;&#x3002;</p>
<h3 id="&#x89C4;&#x5219;3&#xFF1A;&#x4FDD;&#x6301;&#x8D44;&#x6E90;&#x6620;&#x5C04;&#x7B80;&#x5355;">&#x89C4;&#x5219;3&#xFF1A;&#x4FDD;&#x6301;&#x8D44;&#x6E90;&#x6620;&#x5C04;&#x7B80;&#x5355;</h3>
<p>&#x5728;&#x8C03;&#x89E3;&#x8005;&#x7684;&#x5E55;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0;&#x3002;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0;&#x53EA;&#x662F;&#x4E00;&#x7EC4;&#x4EE3;&#x7801;&#xFF0C;&#x5177;&#x6709;&#x521B;&#x5EFA;&#xFF0C;&#x4FEE;&#x6539;&#x548C;&#x5220;&#x9664;&#x57FA;&#x7840;&#x7ED3;&#x6784;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x6709;&#x5F88;&#x591A;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x5B9E;&#x73B0;&#x6700;&#x7EC8;&#x90FD;&#x9700;&#x8981;&#x5C06;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6620;&#x5C04;&#x5230;&#x4E00;&#x7EC4;&#x8D44;&#x6E90;&#x3002;&#x8FD9;&#x7EC4;&#x8D44;&#x6E90;&#x9700;&#x8981;&#x6309;&#x903B;&#x8F91;&#x65B9;&#x5F0F;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4EE5;&#x4FBF;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x63A8;&#x65AD;&#x6BCF;&#x4E2A;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x521B;&#x5EFA;&#x8D44;&#x6E90;&#x7684;&#x57FA;&#x672C;&#x6A21;&#x578B;&#x4E4B;&#x5916;&#xFF0C;&#x60A8;&#x5FC5;&#x987B;&#x975E;&#x5E38;&#x6CE8;&#x610F;&#x6BCF;&#x4E2A;&#x8D44;&#x6E90;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;&#x8BB8;&#x591A;&#x8D44;&#x6E90;&#x4F9D;&#x8D56;&#x4E8E;&#x5176;&#x4ED6;&#x8D44;&#x6E90;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8BB8;&#x591A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x90FD;&#x4F9D;&#x8D56;&#x4E8E;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x5C06;&#x865A;&#x62DF;&#x673A;&#x653E;&#x5165;&#x7F51;&#x7EDC;&#x4E4B;&#x524D;&#xFF0C;&#x7F51;&#x7EDC;&#x9700;&#x8981;&#x5B58;&#x5728;&#x3002;</p>
<p>&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x89C4;&#x5B9A;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x7528;&#x4E8E;&#x5206;&#x7EC4;&#x8D44;&#x6E90;&#x7684;&#x6700;&#x7B80;&#x5355;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x8D44;&#x6E90;&#x6620;&#x5C04;&#x95EE;&#x9898;&#x662F;&#x4E00;&#x4E2A;&#x5DE5;&#x7A0B;&#x51B3;&#x7B56;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B9E;&#x73B0;&#x90FD;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;&#x4ED4;&#x7EC6;&#x6311;&#x9009;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x4ECE;&#x5DE5;&#x7A0B;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x8C03;&#x89E3;&#x5668;&#x9700;&#x8981;&#x7A33;&#x5B9A;&#x4E14;&#x6613;&#x4E8E;&#x7406;&#x89E3;&#x3002;</p>
<p>&#x6620;&#x5C04;&#x6570;&#x636E;&#x7684;&#x4E24;&#x79CD;&#x5E38;&#x89C1;&#x7ED3;&#x6784;&#x662F;&#x96C6;&#x5408;&#x548C;&#x56FE;&#x5F62;&#x3002;</p>
<p>&#x4E00;&#x7EC4;&#x662F;&#x53EF;&#x4EE5;&#x8FED;&#x4EE3;&#x7684;&#x8D44;&#x6E90;&#x7684;&#x5E73;&#x9762;&#x5217;&#x8868;&#x3002;&#x5728;&#x8BB8;&#x591A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x88AB;&#x79F0;&#x4E3A;&#x5217;&#x8868;&#x3001;&#x96C6;&#x5408;&#x3001;&#x6570;&#x7EC4;&#x7B49;&#x3002;</p>
<p>&#x56FE;&#x5F62;&#x662F;&#x901A;&#x8FC7;&#x6307;&#x9488;&#x94FE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x9876;&#x70B9;&#xFF08;vertex&#xFF09;&#x7684;&#x96C6;&#x5408;&#x3002;&#x6839;&#x636E;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x56FE;&#x7684;&#x9876;&#x70B9;&#x901A;&#x5E38;&#x662F;&#x7ED3;&#x6784;&#x6216;&#x7C7B;&#x3002;&#x9876;&#x70B9;&#x901A;&#x8FC7;&#x5728;&#x9876;&#x70B9;&#x67D0;&#x5904;&#x5B9A;&#x4E49;&#x7684;&#x6307;&#x9488;&#x6709;&#x4E00;&#x4E2A;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x7684;&#x94FE;&#x63A5;&#x3002;&#x56FE;&#x5F62;&#x5B9E;&#x73B0;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6307;&#x9488;&#x4ECE;&#x4E00;&#x4E2A;&#x8DF3;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x6765;&#x8BBF;&#x95EE;&#x6BCF;&#x4E2A;&#x9876;&#x70B9;&#x3002;</p>
<p>&#x4F8B;4-5&#x662F;Go&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x9876;&#x70B9;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<p>&#x4F8B;4-5. &#x793A;&#x4F8B;&#x9876;&#x70B9;</p>
<pre class="language-"><code class="lang-go"><span class="token comment" spellcheck="true">// Vertex is a data structure that represents a single point on a graph. // A single Vertex can have N number of children vertices or none at all. type Vertex struct {</span>
Name <span class="token builtin">string</span>
    Children <span class="token punctuation">[</span><span class="token punctuation">]</span><span class="token operator">*</span>Vertex
<span class="token punctuation">}</span>
</code></pre>
<p>&#x904D;&#x5386;&#x56FE;&#x7684;&#x4F8B;&#x5B50;&#x53EF;&#x80FD;&#x50CF;&#x8FED;&#x4EE3;&#x904D;&#x5386;&#x6BCF;&#x4E2A;&#x5B50;&#x5143;&#x7D20;&#x4E00;&#x6837;&#x7B80;&#x5355;&#x3002;&#x8FD9;&#x79CD;&#x904D;&#x5386;&#x6709;&#x65F6;&#x88AB;&#x79F0;&#x4E3A;&#x201C;walking the graph&#x201D;&#x3002;</p>
<p>&#x4F8B;4-6&#x662F;&#x901A;&#x8FC7;Go&#x4E2D;&#x5199;&#x5165;&#x7684;&#x6DF1;&#x5EA6;&#x4F18;&#x5148;&#x904D;&#x5386;&#x9012;&#x5F52;&#x8BBF;&#x95EE;&#x56FE;&#x4E2D;&#x6BCF;&#x4E2A;&#x9876;&#x70B9;&#x7684;&#x793A;&#x4F8B;&#x3002;</p>
<p>&#x4F8B;4-6. &#x6DF1;&#x5EA6;&#x4F18;&#x5148;&#x904D;&#x5386;</p>
<pre class="language-"><code class="lang-go"><span class="token comment" spellcheck="true">// recursiveWalk will recursively dig into all children, // and their children accordingly and echo the name of // the vertex currently being visited to STDOUT.</span>
<span class="token keyword">func</span> <span class="token function">recursiveWalk</span><span class="token punctuation">(</span>v <span class="token operator">*</span>Vertex<span class="token punctuation">)</span><span class="token punctuation">{</span>
fmt<span class="token punctuation">.</span><span class="token function">Printf</span><span class="token punctuation">(</span><span class="token string">&quot;Currently visiting vertex: %s\n&quot;</span><span class="token punctuation">,</span> v<span class="token punctuation">.</span>Name<span class="token punctuation">)</span> <span class="token keyword">for</span> <span class="token boolean">_</span><span class="token punctuation">,</span> child <span class="token operator">:=</span> <span class="token keyword">range</span> v<span class="token punctuation">.</span>Children <span class="token punctuation">{</span>
        <span class="token function">recursiveWalk</span><span class="token punctuation">(</span>child<span class="token punctuation">)</span>
    <span class="token punctuation">}</span>
<span class="token punctuation">}</span>
</code></pre>
<p>&#x9996;&#x5148;&#xFF0C;&#x56FE;&#x7684;&#x7B80;&#x5355;&#x5B9E;&#x73B0;&#x4F3C;&#x4E4E;&#x662F;&#x89E3;&#x51B3;&#x8D44;&#x6E90;&#x56FE;&#x7684;&#x5408;&#x7406;&#x9009;&#x62E9;&#xFF0C;&#x56E0;&#x4E3A;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x903B;&#x8F91;&#x65B9;&#x5F0F;&#x6784;&#x5EFA;&#x56FE;&#x6765;&#x5904;&#x7406;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;&#x867D;&#x7136;&#x56FE;&#x4F1A;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x4F46;&#x5B83;&#x4E5F;&#x4F1A;&#x5E26;&#x6765;&#x98CE;&#x9669;&#x548C;&#x590D;&#x6742;&#x6027;&#x3002;&#x5B9E;&#x65BD;&#x56FE;&#x6765;&#x7ED8;&#x5236;&#x8D44;&#x6E90;&#x7684;&#x6700;&#x5927;&#x98CE;&#x9669;&#x662F;&#x5728;&#x56FE;&#x4E2D;&#x6709;&#x5468;&#x671F;&#x3002;&#x4E00;&#x4E2A;&#x5FAA;&#x73AF;&#x662F;&#x5F53;&#x4E00;&#x4E2A;&#x56FE;&#x7684;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x901A;&#x8FC7;&#x4E00;&#x6761;&#x4EE5;&#x4E0A;&#x7684;&#x8DEF;&#x5F84;&#x6307;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x65F6;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x904D;&#x5386;&#x8BE5;&#x56FE;&#x662F;&#x4E00;&#x4E2A;&#x65E0;&#x6B62;&#x5883;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x5FC5;&#x8981;&#x65F6;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x56FE;&#xFF0C;&#x4F46;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x5E94;&#x8BE5;&#x6620;&#x5C04;&#x4E00;&#x7EC4;&#x8D44;&#x6E90;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x56FE;&#x3002;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#xFF0C;&#x8C03;&#x89E3;&#x5668;&#x53EF;&#x4EE5;&#x7A0B;&#x5E8F;&#x5316;&#x5730;&#x904D;&#x5386;&#x8D44;&#x6E90;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x7EBF;&#x6027;&#x65B9;&#x6CD5;&#x6765;&#x89E3;&#x51B3;&#x6620;&#x5C04;&#x95EE;&#x9898;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x64A4;&#x9500;&#x6216;&#x5220;&#x9664;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x8FC7;&#x7A0B;&#x4E0E;&#x901A;&#x8FC7;&#x53CD;&#x5411;&#x904D;&#x5386;&#x96C6;&#x5408;&#x4E00;&#x6837;&#x7B80;&#x5355;&#x3002;</p>
<h3 id="&#x89C4;&#x5219;4&#xFF1A;&#x4F7F;&#x5B9E;&#x9645;&#x72B6;&#x6001;&#x7B26;&#x5408;&#x9884;&#x671F;&#x72B6;&#x6001;">&#x89C4;&#x5219;4&#xFF1A;&#x4F7F;&#x5B9E;&#x9645;&#x72B6;&#x6001;&#x7B26;&#x5408;&#x9884;&#x671F;&#x72B6;&#x6001;</h3>
<p>&#x5728;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x4E2D;&#x63D0;&#x4F9B;&#x7684;&#x4FDD;&#x8BC1;&#x662F;&#x7528;&#x6237;&#x83B7;&#x5F97;&#x51C6;&#x786E;&#x7684;&#x6216;&#x8005;&#x9519;&#x8BEF;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4FDD;&#x8BC1;&#x4F7F;&#x7528;&#x8C03;&#x89E3;&#x5668;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x53EF;&#x4EE5;&#x4FE1;&#x8D56;&#x7684;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x6D88;&#x8D39;&#x8005;&#x4E0D;&#x5FC5;&#x5173;&#x5FC3;&#x9A8C;&#x8BC1;&#x8C03;&#x89E3;&#x5668;&#x7A81;&#x53D8;&#x662F;&#x5426;&#x662F;&#x5E42;&#x7B49;&#x6027;&#x7684;&#x5E76;&#x6309;&#x9884;&#x671F;&#x7ED3;&#x675F;&#x3002;&#x5B9E;&#x65BD;&#x6700;&#x7EC8;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x6709;&#x4E86;&#x8FD9;&#x79CD;&#x4FDD;&#x8BC1;&#xFF0C;&#x5728;&#x66F4;&#x590D;&#x6742;&#x7684;&#x64CD;&#x4F5C;&#x4E2D;&#x4F7F;&#x7528;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#xFF0C;&#x5982;&#x63A7;&#x5236;&#x5668;&#x6216;operator&#xFF0C;&#x73B0;&#x5728;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x5728;&#x8FD4;&#x56DE;&#x8C03;&#x7528;&#x4EE3;&#x7801;&#x4E4B;&#x524D;&#xFF0C;&#x5B9E;&#x73B0;&#x5E94;&#x68C0;&#x67E5;&#x65B0;&#x8C03;&#x89E3;&#x7684;&#x5B9E;&#x9645;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x662F;&#x5426;&#x4E0E;&#x6700;&#x521D;&#x9884;&#x671F;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5339;&#x914D;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#xFF0C;&#x5B83;&#x5E94;&#x8BE5;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x3002;&#x6D88;&#x8D39;&#x8005;&#x4E0D;&#x5E94;&#x8BE5;&#x5173;&#x5FC3;&#x9A8C;&#x8BC1;API&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x8BE5;&#x76F8;&#x4FE1;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x8C03;&#x89E3;&#x5668;&#x4F1A;&#x62A5;&#x9519;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x5982;&#x679C;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x4E0D;&#x6210;&#x529F;&#xFF0C;API&#x5C06;&#x4F1A;&#x51FA;&#x9519;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x9AD8;&#x5EA6;&#x4FE1;&#x4EFB;API&#x3002;&#x5BF9;&#x4E8E;&#x590D;&#x6742;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x60A8;&#x80FD;&#x591F;&#x76F8;&#x4FE1;&#x60A8;&#x7684;&#x8F6F;&#x4EF6;&#x53EF;&#x4EE5;&#x5DE5;&#x4F5C;&#x6216;&#x4EE5;&#x53EF;&#x9884;&#x6D4B;&#x7684;&#x65B9;&#x5F0F;&#x5931;&#x8D25;&#x3002;</p>
<h2 id="&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x7684;&#x65B9;&#x6CD5;">&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x7684;&#x65B9;&#x6CD5;</h2>
<p>&#x6839;&#x636E;&#x6211;&#x4EEC;&#x521A;&#x521A;&#x89E3;&#x91CA;&#x7684;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x7684;&#x4FE1;&#x606F;&#x548C;&#x89C4;&#x5219;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x901A;&#x8FC7;&#x67E5;&#x770B;&#x5B9E;&#x73B0;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x9700;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x7684;&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;<code>GetActual()</code>&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x6709;&#x65F6;&#x79F0;&#x4E3A;&#x5BA1;&#x8BA1;&#xFF0C;&#x7528;&#x4E8E;&#x67E5;&#x8BE2;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x5B9E;&#x9645;&#x72B6;&#x6001;&#x3002;&#x8BE5;&#x65B9;&#x6CD5;&#x901A;&#x8FC7;&#x751F;&#x6210;&#x8D44;&#x6E90;&#x6620;&#x5C04;&#xFF0C;&#x7136;&#x540E;&#x7A0B;&#x5E8F;&#x5730;&#x8C03;&#x7528;&#x6BCF;&#x4E2A;&#x8D44;&#x6E90;&#x4EE5;&#x67E5;&#x770B;&#x5B58;&#x5728;&#x4EC0;&#x4E48;&#xFF08;&#x5982;&#x679C;&#x6709;&#x7684;&#x8BDD;&#xFF09;&#x3002;&#x8BE5;&#x65B9;&#x6CD5;&#x5C06;&#x6839;&#x636E;&#x67E5;&#x8BE2;&#x66F4;&#x65B0;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x8868;&#x793A;&#x5B9E;&#x9645;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x4EE5;&#x586B;&#x5145;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;<code>GetExpected()</code>&#x5C06;&#x4ECE;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x4E2D;&#x8BFB;&#x53D6;&#x5BF9;&#x8C61;&#x7684;&#x9884;&#x671F;&#x72B6;&#x6001;&#x3002;&#x5728;<code>infrastructure.yaml</code>&#x793A;&#x4F8B;&#xFF08;&#x4F8B;4-4&#xFF09;&#x4E2D;&#xFF0C;<code>GetExpected()</code>&#x5C06;&#x7B80;&#x5355;&#x5730;&#x89E3;&#x7EC4;&#x8FD9;&#x4E2A;YAML&#x5E76;&#x5C06;&#x5176;&#x4EE5;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x5F62;&#x5F0F;&#x8FD4;&#x56DE;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x6B65;&#x6CA1;&#x6709;&#x8FDB;&#x884C;&#x8D44;&#x6E90;&#x5BA1;&#x8BA1;&#x3002;</p>
<p>&#x6700;&#x4EE4;&#x4EBA;&#x5174;&#x594B;&#x7684;&#x65B9;&#x6CD5;&#x662F;<code>Reconcile()</code>&#x65B9;&#x6CD5;&#xFF0C;&#x5176;&#x4E2D;&#x8C03;&#x89E3;&#x5668;&#x5B9E;&#x73B0;&#x5C06;&#x83B7;&#x5F97;&#x5BF9;&#x8C61;&#x7684;&#x5B9E;&#x9645;&#x72B6;&#x6001;&#x548C;&#x9884;&#x671F;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x7684;&#x610F;&#x56FE;&#x9A71;&#x52A8;&#x884C;&#x4E3A;&#x7684;&#x6838;&#x5FC3;&#x3002;&#x5E95;&#x5C42;&#x8C03;&#x89E3;&#x5668;&#x5B9E;&#x73B0;&#x5C06;&#x4F7F;&#x7528;&#x5728;<code>GetActual()</code>&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x76F8;&#x540C;&#x8D44;&#x6E90;&#x6620;&#x5C04;&#x903B;&#x8F91;&#x6765;&#x5B9A;&#x4E49;&#x4E00;&#x7EC4;&#x8D44;&#x6E90;&#x3002;&#x7136;&#x540E;&#x534F;&#x8C03;&#x6267;&#x884C;&#x5C06;&#x5BF9;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x72EC;&#x7ACB;&#x534F;&#x8C03;&#x6BCF;&#x4E00;&#x4E2A;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x4E86;&#x89E3;&#x6BCF;&#x4E2A;&#x8D44;&#x6E90;&#x8C03;&#x89E3;&#x6B65;&#x9AA4;&#x7684;&#x590D;&#x6742;&#x6027;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x8C03;&#x89E3;&#x5668;&#x5B9E;&#x73B0;&#x5FC5;&#x987B;&#x4EE5;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x4ECE;&#x6240;&#x9700;&#x548C;&#x5B9E;&#x9645;&#x72B6;&#x6001;&#x83B7;&#x53D6;&#x8D44;&#x6E90;&#x5C5E;&#x6027;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x5C06;&#x66F4;&#x6539;&#x5E94;&#x7528;&#x5230;&#x6700;&#x5C0F;&#x7684;&#x4E00;&#x7EC4;&#x5C5E;&#x6027;&#xFF0C;&#x4EE5;&#x4F7F;&#x5B9E;&#x9645;&#x72B6;&#x6001;&#x4E0E;&#x6240;&#x9700;&#x7684;&#x72B6;&#x6001;&#x5339;&#x914D;&#x3002;</p>
<p>&#x53EA;&#x8981;&#x8FD9;&#x4E24;&#x4E2A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x8868;&#x793A;&#x6709;&#x51B2;&#x7A81;&#xFF0C;&#x8C03;&#x89E3;&#x5668;&#x6267;&#x884C;&#x5FC5;&#x987B;&#x91C7;&#x53D6;&#x884C;&#x52A8;&#x5E76;&#x6539;&#x53D8;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;&#x534F;&#x8C03;&#x6B65;&#x9AA4;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x8C03;&#x89E3;&#x5668;&#x5B9E;&#x65BD;&#x5FC5;&#x987B;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8868;&#x793A;&#xFF0C;&#x7136;&#x540E;&#x8F6C;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x8D44;&#x6E90;&#x3002;&#x5728;&#x6240;&#x6709;&#x8D44;&#x6E90;&#x8C03;&#x548C;&#x540E;&#xFF0C;&#x8C03;&#x89E3;&#x5668;&#x5B9E;&#x73B0;&#x5C06;&#x65B0;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x8FD4;&#x56DE;&#x7ED9;&#x63A5;&#x53E3;&#x7684;&#x8C03;&#x7528;&#x8005;&#x3002;&#x73B0;&#x5728;&#x8FD9;&#x4E2A;&#x65B0;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x51C6;&#x786E;&#x5730;&#x4EE3;&#x8868;&#x4E86;&#x5BF9;&#x8C61;&#x7684;&#x5B9E;&#x9645;&#x72B6;&#x6001;&#xFF0C;&#x5E76;&#x5E94;&#x8BE5;&#x4FDD;&#x8BC1;&#x5B83;&#x4E0E;&#x539F;&#x59CB;&#x7684;&#x5B9E;&#x9645;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x76F8;&#x5339;&#x914D;&#x3002;</p>
<p>&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x662F;<code>Destroy()</code>&#x65B9;&#x6CD5;&#x3002;<code>wordDestroy()</code>&#x662F;&#x6545;&#x610F;&#x9009;&#x62E9;&#x5728;<code>Delete()</code>&#x4E0A;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5DE5;&#x7A0B;&#x5E08;&#x610F;&#x8BC6;&#x5230;&#x8BE5;&#x65B9;&#x6CD5;&#x5E94;&#x8BE5;&#x9500;&#x6BC1;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x5E76;&#x4E14;&#x4ECE;&#x4E0D;&#x7981;&#x7528;&#x5B83;&#x3002;<code>Destroy()</code>&#x65B9;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#x5F88;&#x7B80;&#x5355;&#x3002;&#x5B83;&#x4F7F;&#x7528;&#x4E0E;&#x524D;&#x9762;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x8D44;&#x6E90;&#x6620;&#x5C04;&#x76F8;&#x540C;&#x7684;&#x8D44;&#x6E90;&#x6620;&#x5C04;&#xFF0C;&#x4F46;&#x4EC5;&#x5BF9;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x53CD;&#x5411;&#x64CD;&#x4F5C;&#x3002;</p>
<h3 id="go&#x4E2D;&#x7684;&#x6A21;&#x5F0F;&#x793A;&#x4F8B;">Go&#x4E2D;&#x7684;&#x6A21;&#x5F0F;&#x793A;&#x4F8B;</h3>
<p>&#x4F8B;4-7&#x662F;Go&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x7684;&#x56DB;&#x79CD;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x77E5;&#x9053;Go&#xFF0C;&#x522B;&#x62C5;&#x5FC3;&#x3002;&#x8BE5;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x7528;&#x4EFB;&#x4F55;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x3002;&#x6211;&#x4EEC;&#x53EA;&#x4F7F;&#x7528;Go&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6E05;&#x695A;&#x5730;&#x5B9A;&#x4E49;&#x4E86;&#x6BCF;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x7C7B;&#x578B;&#x3002;&#x8BF7;&#x9605;&#x8BFB;&#x6BCF;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5B9A;&#x4E49;&#x4E86;&#x6BCF;&#x79CD;&#x65B9;&#x6CD5;&#x9700;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#x4EE5;&#x53CA;&#x4F55;&#x65F6;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x4F8B;4-7. &#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x63A5;&#x53E3;</p>
<pre class="language-"><code class="lang-go"><span class="token comment" spellcheck="true">// The reconciler interface below is an example of the reconciler pattern.</span>
<span class="token comment" spellcheck="true">// It should be used whenever a user intends on mutating infrastructure based on a // state that might have changed over time.</span>
<span class="token keyword">type</span> Reconciler <span class="token keyword">interface</span> <span class="token punctuation">{</span>
    <span class="token comment" spellcheck="true">// GetActual takes no arguments for input and returns a populated data</span>
    <span class="token comment" spellcheck="true">// structure as well as a possible error. The data structure should</span>
    <span class="token comment" spellcheck="true">// contain a complete representation of the infrastructure.</span>
    <span class="token comment" spellcheck="true">// This is sometimes called an audit. This method</span>
    <span class="token comment" spellcheck="true">// should be used to get a real-time representation of what infrastructure is</span>
    <span class="token comment" spellcheck="true">// in existence.</span>
<span class="token function">GetActual</span><span class="token punctuation">(</span><span class="token punctuation">)</span> <span class="token punctuation">(</span><span class="token operator">*</span>Api<span class="token punctuation">,</span> <span class="token builtin">error</span><span class="token punctuation">)</span>
    <span class="token comment" spellcheck="true">// GetExpected takes no arguments for input and returns a populated data</span>
    <span class="token comment" spellcheck="true">// structure that represents what infrastructure an operator has declared to</span>
    <span class="token comment" spellcheck="true">// exist, as well as a possible error. This is sometimes called expected or</span>
    <span class="token comment" spellcheck="true">// intended state. This method should be used to get a real-time representation</span>
    <span class="token comment" spellcheck="true">// of what infrastructure an operator intends to be in existence.</span>
<span class="token function">GetExpected</span><span class="token punctuation">(</span><span class="token punctuation">)</span> <span class="token punctuation">(</span><span class="token operator">*</span>Api<span class="token punctuation">,</span> <span class="token builtin">error</span><span class="token punctuation">)</span>
    <span class="token comment" spellcheck="true">// Reconcile takes two arguments.</span>
    <span class="token comment" spellcheck="true">// actualApi is a populated data structure that is returned from the GetActual</span>
    <span class="token comment" spellcheck="true">// method. expectedApi is a populated data structure that is returned from the</span>
    <span class="token comment" spellcheck="true">// GetExpected method. Reconcile will return a populated data structure that is</span>
    <span class="token comment" spellcheck="true">// a representation of the new &quot;actual&quot; state, as well as a possible error.</span>
    <span class="token comment" spellcheck="true">// By definition, the data structure returned here should match</span>
    <span class="token comment" spellcheck="true">// the data structure returned from the GetExpected method. This method is</span>
    <span class="token comment" spellcheck="true">// responsible for making changes to infrastructure.</span>
    <span class="token function">Reconcile</span><span class="token punctuation">(</span>actualApi<span class="token punctuation">,</span> expectedApi <span class="token operator">*</span>Api<span class="token punctuation">)</span> <span class="token punctuation">(</span><span class="token operator">*</span>Api<span class="token punctuation">,</span> <span class="token builtin">error</span><span class="token punctuation">)</span>
    <span class="token comment" spellcheck="true">// Destroy takes one argument.</span>
    <span class="token comment" spellcheck="true">// actualApi is a populated data structure that is returned from the GetActual</span>
    <span class="token comment" spellcheck="true">// method. Destroy will return a populated data structure that is a</span>
    <span class="token comment" spellcheck="true">// representation of the new &quot;actual&quot; state, as well as a possible error. By</span>
    <span class="token comment" spellcheck="true">// definition, the data structure returned here should match</span>
    <span class="token comment" spellcheck="true">// the data structure returned from the GetExpected method.</span>
    <span class="token function">Destroy</span><span class="token punctuation">(</span>actualApi <span class="token operator">*</span>Api<span class="token punctuation">)</span> <span class="token punctuation">(</span><span class="token operator">*</span>Api<span class="token punctuation">,</span> <span class="token builtin">error</span><span class="token punctuation">)</span>
<span class="token punctuation">}</span>
</code></pre>
<h2 id="&#x5BA1;&#x8BA1;&#x5173;&#x7CFB;">&#x5BA1;&#x8BA1;&#x5173;&#x7CFB;</h2>
<p>&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x6211;&#x4EEC;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x5BA1;&#x8BA1;&#x53D8;&#x5F97;&#x9648;&#x65E7;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x6211;&#x4EEC;&#x5BF9;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x8868;&#x793A;&#x4E0D;&#x51C6;&#x786E;&#x7684;&#x98CE;&#x9669;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6298;&#x8877;&#x7684;&#x529E;&#x6CD5;&#x662F;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x5BA1;&#x8BA1;&#x9891;&#x7387;&#x4EE5;&#x786E;&#x5B9A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8868;&#x793A;&#x7684;&#x51C6;&#x786E;&#x6027;&#x3002;</p>
<p>&#x8C03;&#x89E3;&#x662F;&#x9690;&#x5F0F;&#x7684;&#x5BA1;&#x8BA1;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x53D8;&#x5316;&#xFF0C;&#x8C03;&#x89E3;&#x5668;&#x5C31;&#x4EC0;&#x4E48;&#x4E5F;&#x4E0D;&#x7528;&#x505A;&#xFF0C;&#x8FD9;&#x4E00;&#x6B65;&#x5C31;&#x6210;&#x4E3A;&#x4E86;&#x5BA1;&#x8BA1;&#xFF0C;&#x9A8C;&#x8BC1;&#x6211;&#x4EEC;&#x5BF9;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x8868;&#x793A;&#x662F;&#x5426;&#x51C6;&#x786E;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E2D;&#x78B0;&#x5DE7;&#x53D1;&#x751F;&#x4E86;&#x4E00;&#x4E9B;&#x53D8;&#x5316;&#xFF0C;&#x8C03;&#x89E3;&#x5668;&#x5C06;&#x68C0;&#x6D4B;&#x5230;&#x8FD9;&#x4E00;&#x53D8;&#x5316;&#x5E76;&#x5C1D;&#x8BD5;&#x7EA0;&#x6B63;&#x5B83;&#x3002;&#x5728;&#x5B8C;&#x6210;&#x8C03;&#x89E3;&#x540E;&#xFF0C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x72B6;&#x6001;&#x5C06;&#x4FDD;&#x8BC1;&#x51C6;&#x786E;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x9690;&#x542B;&#x5730;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x5BA1;&#x8BA1;&#x4E86;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;</p>
<h2 id="&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x4E2D;&#x7684;&#x5BA1;&#x8BA1;&#x548C;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;">&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x4E2D;&#x7684;&#x5BA1;&#x8BA1;&#x548C;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;</h2>
<p>&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5DE5;&#x7A0B;&#x5E08;&#x53EF;&#x80FD;&#x719F;&#x6089;&#x6765;&#x81EA;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#x7684;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#xFF0C;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x4F7F;&#x7528;&#x7C7B;&#x4F3C;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x6539;&#x53D8;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#x901A;&#x8FC7;&#x4E00;&#x7EC4;&#x8D44;&#x6E90;&#x6765;&#x7BA1;&#x7406;&#x5DE5;&#x7A0B;&#x5E08;&#x5B9A;&#x4E49;&#x7684;&#x4E00;&#x7EC4;&#x6E05;&#x5355;&#x6216;&#x914D;&#x65B9;&#x3002;</p>
<p>&#x8BE5;&#x5DE5;&#x5177;&#x5C06;&#x5BF9;&#x7CFB;&#x7EDF;&#x91C7;&#x53D6;&#x884C;&#x52A8;&#x4EE5;&#x786E;&#x4FDD;&#x5B9E;&#x9645;&#x72B6;&#x6001;&#x548C;&#x6240;&#x9700;&#x72B6;&#x6001;&#x5339;&#x914D;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x66F4;&#x6539;&#xFF0C;&#x5219;&#x6267;&#x884C;&#x7B80;&#x5355;&#x5BA1;&#x8BA1;&#x4EE5;&#x786E;&#x4FDD;&#x72B6;&#x6001;&#x5339;&#x914D;&#x3002;</p>
<p>&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x4E0E;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x540C;&#x7684;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x4F20;&#x7EDF;&#x4E0A;&#x662F;&#x62BD;&#x8C61;&#x7684;&#x5355;&#x8282;&#x70B9;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x4F1A;&#x521B;&#x5EFA;&#x6216;&#x7BA1;&#x7406;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x4E00;&#x4E9B;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#x6B63;&#x5728;&#x5C06;&#x5176;&#x5728;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#x7684;&#x4F7F;&#x7528;&#x6269;&#x5C55;&#x5230;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x7684;&#x6210;&#x529F;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4ECD;&#x7136;&#x5C5E;&#x4E8E;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7C7B;&#x7684;&#x4EE3;&#x7801;&#x8303;&#x7574;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8F6F;&#x4EF6;&#x63D0;&#x4F9B;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x53CC;&#x5411;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x8F7B;&#x91CF;&#x7EA7;&#x548C;&#x7A33;&#x5B9A;&#x7684;&#x8C03;&#x89E3;&#x5668;&#x5B9E;&#x65BD;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x5F3A;&#x5927;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5E76;&#x5FEB;&#x901F;&#x534F;&#x8C03;&#xFF0C;&#x4ECE;&#x800C;&#x4E3A;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x63D0;&#x4F9B;&#x51C6;&#x786E;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8868;&#x793A;&#x7684;&#x4FE1;&#x5FC3;&#x3002;</p>
<h3 id="&#x5728;&#x63A7;&#x5236;&#x5668;&#x4E2D;&#x4F7F;&#x7528;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;">&#x5728;&#x63A7;&#x5236;&#x5668;&#x4E2D;&#x4F7F;&#x7528;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;</h3>
<p>&#x7F16;&#x6392;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF08;&#x5982;Kubernetes&#xFF09;&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x5730;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5E73;&#x53F0;&#x3002;&#x63A7;&#x5236;&#x5668;&#x662F;&#x4E3A;&#x9884;&#x671F;&#x72B6;&#x6001;&#x63D0;&#x4F9B;&#x63A7;&#x5236;&#x56DE;&#x8DEF;&#x3002;Kubernetes&#x5EFA;&#x7ACB;&#x5728;&#x8FD9;&#x4E2A;&#x57FA;&#x7840;&#x4E4B;&#x4E0A;&#x3002;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x5BA1;&#x8BA1;&#x548C;&#x534F;&#x8C03;&#x7531;Kubernetes&#x63A7;&#x5236;&#x7684;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#x5728;&#x4EE5;&#x4E0B;&#x6B65;&#x9AA4;&#x4E2D;&#x5FAA;&#x73AF;&#x5C06;&#x65E0;&#x4F11;&#x6B62;&#x5730;&#x6D41;&#x7ECF;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#xFF1A;</p>
<ol>
<li>&#x8C03;&#x7528;<code>GetExpected()</code>&#x5E76;&#x4ECE;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x4E2D;&#x8BFB;&#x53D6;&#x57FA;&#x7840;&#x7ED3;&#x6784;&#x7684;&#x9884;&#x671F;&#x72B6;&#x6001;&#x3002;</li>
<li>&#x8C03;&#x7528;<code>GetActual()</code>&#x5E76;&#x4ECE;&#x73AF;&#x5883;&#x4E2D;&#x8BFB;&#x53D6;&#x4EE5;&#x83B7;&#x53D6;&#x57FA;&#x7840;&#x7ED3;&#x6784;&#x7684;&#x5B9E;&#x9645;&#x72B6;&#x6001;&#x3002;</li>
<li>&#x8C03;&#x7528;<code>Reconcile()</code>&#x5E76;&#x8C03;&#x548C;&#x72B6;&#x6001;&#x3002;</li>
</ol>
<p>&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5B9E;&#x65BD;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x7684;&#x7A0B;&#x5E8F;&#x5C06;&#x7528;&#x4F5C;&#x63A7;&#x5236;&#x5668;&#x3002;&#x7531;&#x4E8E;&#x5F88;&#x5BB9;&#x6613;&#x770B;&#x51FA;&#x63A7;&#x5236;&#x5668;&#x672C;&#x8EAB;&#x7684;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x6709;&#x591A;&#x5C0F;&#x5DE7;&#xFF0C;&#x56E0;&#x6B64;&#x8BE5;&#x65B9;&#x6848;&#x7684;&#x4F18;&#x96C5;&#x663E;&#x800C;&#x6613;&#x89C1;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x6539;&#x53D8;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5C31;&#x50CF;&#x6539;&#x53D8;&#x72B6;&#x6001;&#x5B58;&#x50A8;&#x4E00;&#x6837;&#x7B80;&#x5355;&#x3002;&#x63A7;&#x5236;&#x5668;&#x5C06;&#x5728;&#x4E0B;&#x6B21;&#x8C03;&#x7528;<code>GetExpected()</code>&#x65F6;&#x8BFB;&#x53D6;&#x66F4;&#x6539;&#x5E76;&#x89E6;&#x53D1;&#x534F;&#x8C03;&#x3002;&#x8D1F;&#x8D23;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x653E;&#x5FC3;&#xFF0C;&#x7A33;&#x5B9A;&#x53EF;&#x9760;&#x7684;&#x5FAA;&#x73AF;&#x5728;&#x540E;&#x53F0;&#x5B89;&#x9759;&#x5730;&#x8FD0;&#x884C;&#xFF0C;&#x5728;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x73AF;&#x5883;&#x4E2D;&#x6267;&#x884C;&#x5B83;&#x7684;&#x610F;&#x613F;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x901A;&#x8FC7;&#x7BA1;&#x7406;&#x5E94;&#x7528;&#x6765;&#x7BA1;&#x7406;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;</p>
<blockquote>
<p>&#x63A7;&#x5236;&#x56DE;&#x8DEF;&#x7684;&#x76EE;&#x6807;&#x641C;&#x5BFB;&#x884C;&#x4E3A;&#x975E;&#x5E38;&#x7A33;&#x5B9A;&#x3002;Kubernetes&#x5DF2;&#x7ECF;&#x8BC1;&#x660E;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x66FE;&#x7ECF;&#x53D1;&#x73B0;&#x8FC7;&#x4E00;&#x4E9B;&#x6CA1;&#x6709;&#x88AB;&#x6CE8;&#x610F;&#x5230;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x56E0;&#x4E3A;&#x63A7;&#x5236;&#x56DE;&#x8DEF;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x7A33;&#x5B9A;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x4F1A;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x800C;&#x81EA;&#x884C;&#x4FEE;&#x6B63;&#x3002;</p>
<p>&#x5982;&#x679C;&#x60A8;&#x88AB;&#x8FB9;&#x7F18;&#xFF08;edge&#xFF09;&#x89E6;&#x53D1;&#xFF0C;&#x5219;&#x4F1A;&#x5192;&#x7740;&#x635F;&#x5BB3;&#x60A8;&#x7684;&#x72B6;&#x6001;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x5E76;&#x4E14;&#x6C38;&#x8FDC;&#x65E0;&#x6CD5;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#x72B6;&#x6001;&#x3002;&#x5982;&#x679C;&#x4F60;&#x662F;&#x6C34;&#x5E73;&#xFF08;level&#xFF09;&#x89E6;&#x53D1;&#x7684;&#x6A21;&#x5F0F;&#x662F;&#x975E;&#x5E38;&#x5BBD;&#x5BB9;&#x7684;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x7EC4;&#x4EF6;&#x5728;&#x4E00;&#x5B9A;&#x7A7A;&#x95F4;&#x5185;&#x7EA0;&#x6B63;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;Kubernetes&#x5DE5;&#x4F5C;&#x5F97;&#x5F88;&#x597D;&#x3002;</p>
<p>&#x2014;&#x2014;Joe Beda&#xFF0C;Heptio&#x516C;&#x53F8;&#x9996;&#x5E2D;&#x6280;&#x672F;&#x5B98;</p>
</blockquote>
<p>&#x9500;&#x6BC1;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x73B0;&#x5728;&#x5C31;&#x50CF;&#x901A;&#x77E5;&#x63A7;&#x5236;&#x5668;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x9500;&#x6BC1;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E00;&#x6837;&#x7B80;&#x5355;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x591A;&#x79CD;&#x65B9;&#x5F0F;&#x5B8C;&#x6210;&#x3002;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x8BA9;&#x63A7;&#x5236;&#x5668;&#x5C0A;&#x91CD;&#x7981;&#x7528;&#x7684;&#x72B6;&#x6001;&#x6587;&#x4EF6;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4ECE;&#x5F00;&#x542F;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x4F4D;&#x53CD;&#x8F6C;&#x6765;&#x8868;&#x793A;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x53EF;&#x80FD;&#x662F;&#x5220;&#x9664;&#x72B6;&#x6001;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x65E0;&#x8BBA;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x53D1;&#x9001;<code>Destroy()</code>&#x4FE1;&#x53F7;&#xFF0C;&#x63A7;&#x5236;&#x5668;&#x90FD;&#x51C6;&#x5907;&#x597D;&#x8C03;&#x7528;<code>convenienceDestroy()</code>&#x65B9;&#x6CD5;&#x3002;</p>
<h2 id="&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;">&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;</h2>
<p>&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5DE5;&#x7A0B;&#x5E08;&#x4E5F;&#x662F;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x8D1F;&#x8D23;&#x6784;&#x5EFA;&#x5148;&#x8FDB;&#x7684;&#x9AD8;&#x5EA6;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#xFF0C;&#x5728;&#x540E;&#x53F0;&#x5F00;&#x53D1;&#x3002;&#x4ED6;&#x4EEC;&#x5FC5;&#x987B;&#x7F16;&#x5199;&#x7BA1;&#x7406;&#x4ED6;&#x4EEC;&#x8D1F;&#x8D23;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x8F6F;&#x4EF6;&#x3002;</p>
<p>&#x867D;&#x7136;&#x8FD9;&#x4E24;&#x4E2A;&#x5B66;&#x79D1;&#x4E4B;&#x95F4;&#x6709;&#x8BB8;&#x591A;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#xFF0C;&#x4F46;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7BA1;&#x7406;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5DE5;&#x7A0B;&#x9700;&#x8981;&#x7EC8;&#x8EAB;&#x5B66;&#x4E60;&#x3002;&#x8BF8;&#x5982;&#x5F15;&#x5BFC;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E4B;&#x7C7B;&#x7684;&#x96BE;&#x9898;&#x4E0D;&#x65AD;&#x53D1;&#x5C55;&#xFF0C;&#x9700;&#x8981;&#x5DE5;&#x7A0B;&#x5E08;&#x4E0D;&#x65AD;&#x5B66;&#x4E60;&#x65B0;&#x4E8B;&#x7269;&#x3002;&#x8FD8;&#x9700;&#x8981;&#x7EF4;&#x62A4;&#x548C;&#x4F18;&#x5316;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x8FD9;&#x4E00;&#x5B9A;&#x4F1A;&#x8BA9;&#x5DE5;&#x7A0B;&#x5E08;&#x957F;&#x671F;&#x53D7;&#x96C7;&#x3002;</p>
<p>&#x672C;&#x7AE0;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x4E86;&#x5F3A;&#x5927;&#x7684;&#x6A21;&#x5F0F;&#x548C;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#xFF0C;&#x5C06;&#x4E0D;&#x660E;&#x786E;&#x7684;API&#x7ED3;&#x6784;&#x6620;&#x5C04;&#x4E3A;&#x7C92;&#x5EA6;&#x8D44;&#x6E90;&#x3002;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x5230;&#x60A8;&#x7684;&#x672C;&#x5730;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x3001;&#x79C1;&#x6709;&#x4E91;&#x6216;&#x516C;&#x6709;&#x4E91;&#x4E2D;&#x3002;</p>
<p>&#x4E86;&#x89E3;&#x8FD9;&#x4E9B;&#x6A21;&#x5F0F;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x5BF9;&#x4E8E;&#x6784;&#x5EFA;&#x53EF;&#x9760;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7BA1;&#x7406;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;&#x672C;&#x7AE0;&#x9610;&#x8FF0;&#x7684;&#x6A21;&#x5F0F;&#x65E8;&#x5728;&#x4E3A;&#x5DE5;&#x7A0B;&#x5E08;&#x63D0;&#x4F9B;&#x6784;&#x5EFA;&#x58F0;&#x660E;&#x5F0F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7BA1;&#x7406;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x8D77;&#x70B9;&#x548C;&#x7075;&#x611F;&#x3002;</p>
<p>&#x5728;&#x6784;&#x5EFA;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7BA1;&#x7406;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x6CA1;&#x6709;&#x6B63;&#x786E;&#x6216;&#x9519;&#x8BEF;&#x7684;&#x7B54;&#x6848;&#xFF0C;&#x53EA;&#x8981;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9075;&#x5FAA;Unix&#x54F2;&#x5B66;&#xFF1A;&#x201C;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x5E76;&#x628A;&#x5B83;&#x505A;&#x5F97;&#x5F88;&#x597D;&#x3002;&#x201C;</p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; 2018 cloudnativego.com all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification"> Updated at 
2018-06-25 21:47:55
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch03-evolution-of-cloud-native-developments.html" class="navigation navigation-prev " aria-label="Previous page: 第3章 云原生部署的演变">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch05-developing-infrastructure-applications.html" class="navigation navigation-next " aria-label="Next page: 第5章 开发基础架构应用程序">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第4章 设计基础架构应用程序","level":"1.7","depth":1,"next":{"title":"第5章 开发基础架构应用程序","level":"1.8","depth":1,"path":"ch05-developing-infrastructure-applications.md","ref":"ch05-developing-infrastructure-applications.md","articles":[]},"previous":{"title":"第3章 云原生部署的演变","level":"1.6","depth":1,"path":"ch03-evolution-of-cloud-native-developments.md","ref":"ch03-evolution-of-cloud-native-developments.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","codesnippet","splitter","page-toc-button","editlink","back-to-top-button","-lunr","-search","search-plus","github-buttons@2.1.0","favicon@^0.0.2","tbfed-pagefooter@^0.0.1","3-ba","theme-default","-highlight","prism","prism-themes","sitemap-general"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © 2018 cloudnativego.com","modify_label":" Updated at ","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prism-themes/themes/prism-ghcolors.css"]},"github":{"url":"https://github.com/CloudNativeInfra/cni"},"editlink":{"label":"Edit this page","multilingual":false,"base":"https://github.com/CloudNativeInfra/cni/blob/master/cn"},"splitter":{},"codesnippet":{},"sitemap-general":{"prefix":"https://cloudnativego.com/cni/"},"fontsettings":{"theme":"white","family":"sans","size":2},"favicon":{"shortcut":"favicon.ico","bookmark":"favicon.ico"},"page-toc-button":{},"back-to-top-button":{},"prism-themes":{},"github-buttons":{"repo":"CloudNativeInfra/cni","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"c889b4cfd2df3f575151a52b18610b26"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"search-plus":{}},"theme":"default","author":"cloudnativego.com","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"云原生基础设施 - cloudnativego.com","language":"cn","links":{"sidebar":{"CloudNativeGo":"https://cloudnativego.com","Jimmy Song":"https://jimmysong.io"}},"gitbook":"*","description":"云原生基础设施|Cloud Native Infrastructure"},"file":{"path":"ch04-designing-infrastructure-applicaitons.md","mtime":"2018-06-25T13:47:55.500Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-10-25T02:04:10.352Z"},"basePath":".","book":{"language":"cn"}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

