
<!DOCTYPE HTML>
<html lang="cn" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第9章 实施云原生基础设施 · 云原生基础设施 - cloudnativego.com</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="cloudnativego.com">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-ghcolors.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="appendix-a-patterns-for-network-resiilency.html" />
    
    
    <link rel="prev" href="ch08-securing-applications.html" />
    

    
        <link rel="shortcut icon" href='favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"CloudNativeInfra/cni","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://cloudnativego.com" target="_blank" class="custom-link">CloudNativeGo</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io" target="_blank" class="custom-link">Jimmy Song</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    关于本书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="foreword.html">
            
                <a href="foreword.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="introduction.html">
            
                <a href="introduction.html">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch01-what-is-cloud-native-infrastructure.html">
            
                <a href="ch01-what-is-cloud-native-infrastructure.html">
            
                    
                    第1章 什么是云原生基础设施？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch02-when-to-adopt-cloud-native.html">
            
                <a href="ch02-when-to-adopt-cloud-native.html">
            
                    
                    第2章 何时采用云原生
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch03-evolution-of-cloud-native-developments.html">
            
                <a href="ch03-evolution-of-cloud-native-developments.html">
            
                    
                    第3章 云原生部署的演变
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch04-designing-infrastructure-applicaitons.html">
            
                <a href="ch04-designing-infrastructure-applicaitons.html">
            
                    
                    第4章 设计基础架构应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch05-developing-infrastructure-applications.html">
            
                <a href="ch05-developing-infrastructure-applications.html">
            
                    
                    第5章 开发基础架构应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch06-testing-cloud-native-infrastructure.html">
            
                <a href="ch06-testing-cloud-native-infrastructure.html">
            
                    
                    第6章 测试云原生基础设施
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch07-managing-cloud-native-applications.html">
            
                <a href="ch07-managing-cloud-native-applications.html">
            
                    
                    第7章 管理云原生应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch08-securing-applications.html">
            
                <a href="ch08-securing-applications.html">
            
                    
                    第8章 保护应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.12" data-path="ch09-implementing-cloud-native-infrasctructure.html">
            
                <a href="ch09-implementing-cloud-native-infrasctructure.html">
            
                    
                    第9章 实施云原生基础设施
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="appendix-a-patterns-for-network-resiilency.html">
            
                <a href="appendix-a-patterns-for-network-resiilency.html">
            
                    
                    附录A 网络弹性模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="appendix-b-lock-in.html">
            
                <a href="appendix-b-lock-in.html">
            
                    
                    附录B 锁定
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="appendix-c-box-case-study.html">
            
                <a href="appendix-c-box-case-study.html">
            
                    
                    附录C Box：案例研究
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第9章 实施云原生基础设施</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;9&#x7AE0;-&#x5B9E;&#x65BD;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;">&#x7B2C;9&#x7AE0; &#x5B9E;&#x65BD;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;</h1>
<p>&#x5982;&#x679C;&#x60A8;&#x8BA4;&#x4E3A;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x662F;&#x60A8;&#x53EF;&#x4EE5;&#x8D2D;&#x4E70;&#x7684;&#x4EA7;&#x54C1;&#x6216;&#x8005;&#x60A8;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x670D;&#x52A1;&#x5668;&#x7684;&#x4E91;&#x63D0;&#x4F9B;&#x5546;&#xFF0C;&#x6211;&#x4EEC;&#x5F88;&#x62B1;&#x6B49;&#x8BA9;&#x60A8;&#x5931;&#x671B;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x91C7;&#x7528;&#x8FD9;&#x4E9B;&#x505A;&#x6CD5;&#x5E76;&#x6539;&#x53D8;&#x60A8;&#x5EFA;&#x8BBE;&#x548C;&#x7EF4;&#x62A4;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x60A8;&#x5C31;&#x4E0D;&#x4F1A;&#x53D7;&#x76CA;&#x3002;</p>
<p>&#x5B83;&#x4E0D;&#x4EC5;&#x4EC5;&#x5F71;&#x54CD;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x7F51;&#x7EDC;&#x548C;&#x5B58;&#x50A8;&#x3002;&#x5B83;&#x5173;&#x4E4E;&#x7684;&#x662F;&#x5DE5;&#x7A0B;&#x5E08;&#x5982;&#x4F55;&#x7BA1;&#x7406;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5C31;&#x50CF;&#x63A5;&#x53D7;&#x6545;&#x969C;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x56F4;&#x7ED5;&#x4E91;&#x539F;&#x751F;&#x5B9E;&#x8DF5;&#x5EFA;&#x7ACB;&#x7684;&#x6587;&#x5316;&#x4E0E;&#x4F20;&#x7EDF;&#x6280;&#x672F;&#x548C;&#x5DE5;&#x7A0B;&#x7EC4;&#x7EC7;&#x6709;&#x5F88;&#x5927;&#x4E0D;&#x540C;&#x3002;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x662F;&#x89E3;&#x51B3;&#x7EC4;&#x7EC7;&#x6587;&#x5316;&#x6216;&#x7ED3;&#x6784;&#x95EE;&#x9898;&#x7684;&#x4E13;&#x5BB6;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x60A8;&#x5E0C;&#x671B;&#x6539;&#x53D8;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;&#xFF0C;&#x6211;&#x4EEC;&#x5EFA;&#x8BAE;&#x60A8;&#x4ECE;&#x9AD8;&#x7EE9;&#x6548;&#x7EC4;&#x7EC7;&#x4E2D;&#x5B9E;&#x65BD;DevOps&#x5B9E;&#x8DF5;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#x5F85;&#x4EF7;&#x503C;&#x89C2;&#x548C;&#x7ECF;&#x9A8C;&#x6559;&#x8BAD;&#x3002;</p>
<p>&#x4E00;&#x4E9B;&#x9700;&#x8981;&#x63A2;&#x7D22;&#x7684;&#x5730;&#x65B9;&#x662F;Netflix&#x7684;&#x6587;&#x5316;&#x5957;&#x9910;&#xFF0C;&#x5B83;&#x4FC3;&#x8FDB;&#x4E86;&#x81EA;&#x7531;&#x548C;&#x8D23;&#x4EFB;&#x611F;&#xFF0C;&#x8FD8;&#x6709;&#x4E9A;&#x9A6C;&#x900A;&#x7684;&#x53CC;&#x6BD4;&#x8428;&#x56E2;&#x961F;&#xFF0C;&#x8FD9;&#x4E9B;&#x56E2;&#x961F;&#x4EE5;&#x4F4E;&#x5F00;&#x9500;&#x63A8;&#x5E7F;&#x81EA;&#x6CBB;&#x56E2;&#x4F53;&#x3002;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x4E0E;&#x6784;&#x5EFA;&#x5B83;&#x4EEC;&#x7684;&#x56E2;&#x961F;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x89E3;&#x8026;&#x7279;&#x5F81;&#x3002;&#x5EB7;&#x5A01;&#x6CD5;&#x5F8B;&#x6700;&#x597D;&#x5730;&#x63CF;&#x8FF0;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#xFF1A;&#x201C;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x7684;&#x7EC4;&#x7EC7;&#x88AB;&#x9650;&#x5236;&#x4E3A;&#x4EA7;&#x751F;&#x8FD9;&#x4E9B;&#x7EC4;&#x7EC7;&#x7684;&#x901A;&#x4FE1;&#x7ED3;&#x6784;&#x526F;&#x672C;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x201D;</p>
<p>&#x5728;&#x6211;&#x4EEC;&#x7ED3;&#x675F;&#x672C;&#x4E66;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5173;&#x6CE8;&#x54EA;&#x4E9B;&#x9886;&#x57DF;&#x662F;&#x60A8;&#x91C7;&#x7528;&#x4E91;&#x539F;&#x751F;&#x5B9E;&#x8DF5;&#x65F6;&#x6700;&#x91CD;&#x8981;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x5C06;&#x8BA8;&#x8BBA;&#x4E00;&#x4E9B;&#x9884;&#x6D4B;&#x53D8;&#x5316;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x6A21;&#x5F0F;&#xFF0C;&#x4EE5;&#x4FBF;&#x60A8;&#x77E5;&#x9053;&#x5C06;&#x6765;&#x8981;&#x5BFB;&#x627E;&#x4EC0;&#x4E48;&#x3002;</p>
<h2 id="&#x5173;&#x6CE8;&#x6539;&#x53D8;&#x7684;&#x5730;&#x65B9;">&#x5173;&#x6CE8;&#x6539;&#x53D8;&#x7684;&#x5730;&#x65B9;</h2>
<p>&#x5982;&#x679C;&#x60A8;&#x62E5;&#x6709;&#x73B0;&#x6709;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x6216;&#x4F20;&#x7EDF;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF0C;&#x5219;&#x8FC7;&#x6E21;&#x5230;&#x4E91;&#x539F;&#x751F;&#x4E0D;&#x4F1A;&#x5728;&#x4E00;&#x591C;&#x4E4B;&#x95F4;&#x53D1;&#x751F;&#x3002;&#x5982;&#x679C;&#x60A8;&#x6709;&#x8DB3;&#x591F;&#x5927;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x8DB3;&#x8FF9;&#x6216;&#x4E24;&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;&#x4EBA;&#x5458;&#x7BA1;&#x7406;&#x57FA;&#x7840;&#x67B6;&#x6784;&#xFF0C;&#x8BD5;&#x56FE;&#x5F3A;&#x5236;&#x5B9E;&#x65BD;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7BA1;&#x7406;&#x7684;&#x65B0;&#x65B9;&#x6CD5;&#x53EF;&#x80FD;&#x4F1A;&#x5931;&#x8D25;&#x3002;</p>
<p>&#x91C7;&#x7528;&#x8FD9;&#x4E9B;&#x6A21;&#x5F0F;&#x7684;&#x4E3B;&#x8981;&#x573A;&#x6240;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x5730;&#x4E0E;&#x914D;&#x7F6E;&#x65B0;&#x670D;&#x52A1;&#x5668;&#x6216;&#x8D2D;&#x4E70;&#x65B0;&#x8F6F;&#x4EF6;&#x65E0;&#x5173;&#x3002;&#x8981;&#x5F00;&#x59CB;&#x91C7;&#x7528;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x9996;&#x5148;&#x5173;&#x6CE8;&#x8FD9;&#x4E9B;&#x9886;&#x57DF;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF1A;</p>
<ul>
<li>&#x4EBA;</li>
<li>&#x67B6;&#x6784;</li>
<li>&#x6DF7;&#x4E71;</li>
<li>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;</li>
</ul>
<p>&#x76F4;&#x5230;&#x60A8;&#x51C6;&#x5907;&#x597D;&#x8FD9;&#x4E9B;&#x533A;&#x57DF;&#x4EE5;&#x4F7F;&#x7528;&#x672C;&#x4E66;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x5B9E;&#x8DF5;&#xFF0C;&#x624D;&#x80FD;&#x5F00;&#x59CB;&#x66F4;&#x6539;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x3002;</p>
<h3 id="&#x4EBA;">&#x4EBA;</h3>
<blockquote>
<p>&#x6BD4;&#x7ADE;&#x4E89;&#x5BF9;&#x624B;&#x66F4;&#x5FEB;&#x5B66;&#x4E60;&#x7684;&#x80FD;&#x529B;&#x53EF;&#x80FD;&#x662F;&#x552F;&#x4E00;&#x7684;&#x53EF;&#x6301;&#x7EED;&#x7ADE;&#x4E89;&#x4F18;&#x52BF;&#x3002;</p>
<p>&#x2014;&#x2014;Arie de Geus</p>
</blockquote>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x7B2C;2&#x7AE0;&#x4E2D;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#xFF0C;&#x4EBA;&#x4EEC;&#x662F;&#x5B9E;&#x65BD;&#x4EFB;&#x4F55;&#x53D8;&#x9769;&#x4E2D;&#x6700;&#x96BE;&#x7684;&#x90E8;&#x5206;&#x3002;&#x4ED6;&#x4EEC;&#x7684;&#x62B5;&#x5236;&#x6709;&#x5F88;&#x591A;&#x539F;&#x56E0;&#xFF0C;&#x800C;&#x90A3;&#x4E9B;&#x8981;&#x6C42;&#x8FDB;&#x884C;&#x53D8;&#x66F4;&#x4EE5;&#x5E2E;&#x52A9;&#x5176;&#x5F71;&#x54CD;&#x7684;&#x4EBA;&#x6709;&#x8D23;&#x4EFB;&#x3002;</p>
<p>&#x5F53;&#x9700;&#x8981;&#x6539;&#x53D8;&#x7684;&#x9A71;&#x52A8;&#x6FC0;&#x52B1;&#x65F6;&#xFF0C;&#x53D8;&#x66F4;&#x66F4;&#x5BB9;&#x6613;&#x3002;&#x4E3B;&#x52A8;&#x63D0;&#x9AD8;&#x6F5C;&#x529B;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x6FC0;&#x52B1;&#x56E0;&#x7D20;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x7D27;&#x8FEB;&#x611F;&#xFF0C;&#x5C31;&#x5F88;&#x96BE;&#x6539;&#x53D8;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x4EBA;&#x4EEC;&#x6297;&#x62D2;&#x6539;&#x53D8;&#x7684;&#x8BB8;&#x591A;&#x539F;&#x56E0;&#x6765;&#x81EA;&#x6050;&#x60E7;&#x3002;&#x4EBA;&#x4EEC;&#x559C;&#x6B22;&#x4E60;&#x60EF;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x611F;&#x5230;&#x63A7;&#x5236;&#x5E76;&#x907F;&#x514D;&#x610F;&#x5916;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x4EFB;&#x4F55;&#x6280;&#x672F;&#x53D6;&#x5F97;&#x6210;&#x529F;&#x7684;&#x91CD;&#x5927;&#x8F6C;&#x53D8;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x4E0E;&#x4EBA;&#x4EEC;&#x5408;&#x4F5C;&#x4EE5;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x5730;&#x51CF;&#x5C11;&#x4ED6;&#x4EEC;&#x7684;&#x6050;&#x60E7;&#x3002;&#x7ED9;&#x4ED6;&#x4EEC;&#x4E00;&#x79CD;&#x4E3B;&#x4EBA;&#x7FC1;&#x611F;&#xFF0C;&#x5E76;&#x89E3;&#x91CA;&#x53D8;&#x5316;&#x7684;&#x660E;&#x786E;&#x76EE;&#x6807;&#x3002;&#x786E;&#x4FDD;&#x7A81;&#x51FA;&#x65B0;&#x65E7;&#x6280;&#x672F;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x6539;&#x53D8;&#x540E;&#x4ED6;&#x4EEC;&#x5C06;&#x626E;&#x6F14;&#x7684;&#x89D2;&#x8272;&#x3002;</p>
<p>&#x4EBA;&#x4EEC;&#x4E86;&#x89E3;&#x8FD9;&#x79CD;&#x53D8;&#x5316;&#x5E76;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x5728;&#x65E7;&#x7CFB;&#x7EDF;&#x6216;&#x73B0;&#x6709;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x5931;&#x8D25;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x4E5F;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x660E;&#x767D;&#xFF0C;&#x8981;&#x6C42;&#x5DF2;&#x7ECF;&#x6539;&#x53D8;&#xFF0C;&#x73AF;&#x5883;&#x4E0D;&#x540C;&#xFF0C;&#x5E76;&#x4E14;&#x5E0C;&#x671B;&#x4ED6;&#x4EEC;&#x6210;&#x4E3A;&#x53D8;&#x9769;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x5C0A;&#x91CD;&#x4ED6;&#x4EEC;&#x6240;&#x505A;&#x7684;&#x5E76;&#x4E14;&#x5BF9;&#x4ED6;&#x4EEC;&#x80FD;&#x505A;&#x7684;&#x4E8B;&#x6709;&#x4FE1;&#x5FC3;&#x3002;</p>
<p>&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x65B0;&#x4E8B;&#x7269;&#xFF0C;&#x4E3A;&#x6B64;&#xFF0C;&#x5931;&#x8D25;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x9884;&#x671F;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x8FDB;&#x6B65;&#x7684;&#x6807;&#x5FD7;&#x3002;</p>
<p>&#x9F13;&#x52B1;&#x5B66;&#x4E60;&#x548C;&#x5B9E;&#x9A8C;&#xFF0C;&#x5E76;&#x5956;&#x52B1;&#x9002;&#x5E94;&#x6570;&#x636E;&#x6D1E;&#x5BDF;&#x7684;&#x4EBA;&#x5458;&#x548C;&#x7CFB;&#x7EDF;&#x3002;&#x8BA9;&#x5DE5;&#x7A0B;&#x5E08;&#x901A;&#x8FC7;&#x8BF8;&#x5982;&#x201C;&#x767E;&#x5206;&#x4E4B;&#x4E8C;&#x5341;&#x7684;&#x65F6;&#x95F4;&#x201D;&#x4E4B;&#x7C7B;&#x7684;&#x81EA;&#x7531;&#x6765;&#x63A2;&#x7D22;&#x65B0;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x3002;</p>
<p>&#x5982;&#x679C;&#x654F;&#x6377;&#x7CFB;&#x7EDF;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#xFF0C;&#x5B83;&#x5C31;&#x6CA1;&#x6709;&#x597D;&#x5904;&#x3002;&#x4E00;&#x4E2A;&#x4E0D;&#x9002;&#x5E94;&#x548C;&#x6539;&#x8FDB;&#x7684;&#x7CFB;&#x7EDF;&#x5C06;&#x65E0;&#x6CD5;&#x6EE1;&#x8DB3;&#x6B63;&#x5728;&#x6539;&#x53D8;&#x548C;&#x5B66;&#x4E60;&#x7684;&#x4F01;&#x4E1A;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x4F60;&#x80FD;&#x591F;&#x6FC0;&#x53D1;&#x4EBA;&#x4EEC;&#x5BFB;&#x6C42;&#x6539;&#x53D8;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x7528;&#x4FE1;&#x4EFB;&#x548C;&#x81EA;&#x7531;&#x6765;&#x8D4B;&#x4E88;&#x4ED6;&#x4EEC;&#x529B;&#x91CF;&#x3002;&#x4E0D;&#x65AD;&#x5F15;&#x5BFC;&#x4ED6;&#x4EEC;&#x5C06;&#x81EA;&#x5DF1;&#x7684;&#x76EE;&#x6807;&#x4E0E;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x5E76;&#x8D4B;&#x4E88;&#x4ED6;&#x4EEC;&#x5E94;&#x8058;&#x7684;&#x7BA1;&#x7406;&#x804C;&#x8D23;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4EBA;&#x4EEC;&#x5DF2;&#x7ECF;&#x51C6;&#x5907;&#x597D;&#x91C7;&#x7528;&#x672C;&#x4E66;&#x4E2D;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x5B9E;&#x73B0;&#x5B83;&#x5C31;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x9650;&#x5236;&#x3002;&#x5173;&#x4E8E;&#x521B;&#x5EFA;&#x7EC4;&#x7EC7;&#x53D8;&#x9769;&#x7684;&#x66F4;&#x6DF1;&#x5165;&#x7684;&#x6307;&#x5BFC;&#xFF0C;&#x6211;&#x4EEC;&#x63A8;&#x8350;&#x9605;&#x8BFB;John P. Kotter&#xFF08;&#x54C8;&#x4F5B;&#x5546;&#x4E1A;&#x8BC4;&#x8BBA;&#x51FA;&#x7248;&#x793E;&#xFF09;&#x7684;&#x201C;&#x9886;&#x5BFC;&#x53D8;&#x9769;&#x201D;&#x3002;</p>
<p>&#x6539;&#x53D8;&#x73AF;&#x5883;&#x6587;&#x5316;&#x9700;&#x8981;&#x7EC4;&#x7EC7;&#x7684;&#x5927;&#x91CF;&#x52AA;&#x529B;&#x548C;&#x652F;&#x6301;&#xFF0C;&#x4EE5;&#x53CA;&#x66F4;&#x6539;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x3002;&#x60A8;&#x9009;&#x62E9;&#x7684;&#x67B6;&#x6784;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x91C7;&#x7528;&#x4E91;&#x539F;&#x751F;&#x6A21;&#x5F0F;&#x7684;&#x80FD;&#x529B;&#x4EA7;&#x751F;&#x91CD;&#x5927;&#x5F71;&#x54CD;&#x3002;</p>
<h3 id="&#x67B6;&#x6784;">&#x67B6;&#x6784;</h3>
<blockquote>
<p>&#x5F39;&#x6027;&#xFF0C;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#xFF0C;&#x53EF;&#x90E8;&#x7F72;&#x6027;&#xFF0C;&#x53EF;&#x6D4B;&#x8BD5;&#x6027;&#x662F;&#x67B6;&#x6784;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x2014;&#x2014;Jez Humble</p>
</blockquote>
<p>&#x5C06;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FC1;&#x79FB;&#x5230;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x65F6;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x8003;&#x8651;&#x5982;&#x4F55;&#x7BA1;&#x7406;&#x548C;&#x8BBE;&#x8BA1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x524D;&#x8EAB;&#x7684;12&#x56E0;&#x5B50;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53D7;&#x76CA;&#x4E8E;&#x5728;&#x5E73;&#x53F0;&#x4E0A;&#x8FD0;&#x884C;&#x3002;&#x5B83;&#x4EEC;&#x88AB;&#x8BBE;&#x8BA1;&#x4E3A;&#x6700;&#x5C0F;&#x5316;&#x624B;&#x52A8;&#x7BA1;&#x7406;&#xFF0C;&#x9891;&#x7E41;&#x66F4;&#x6539;&#x548C;&#x5F39;&#x6027;&#x3002;&#x8BB8;&#x591A;&#x4F20;&#x7EDF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x67B6;&#x6784;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x62B5;&#x5236;&#x81EA;&#x52A8;&#x5316;&#xFF0C;&#x4E0D;&#x7ECF;&#x5E38;&#x5347;&#x7EA7;&#x548C;&#x5931;&#x8D25;&#x3002;&#x5728;&#x79FB;&#x52A8;&#x5B83;&#x4E4B;&#x524D;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x4E2A;&#x4EBA;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x662F;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x60A8;&#x8FD8;&#x9700;&#x8981;&#x8003;&#x8651;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5982;&#x4F55;&#x4E0E;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x5185;&#x7684;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E94;&#x4E0E;&#x4E91;&#x73AF;&#x5883;&#x4E2D;&#x652F;&#x6301;&#x7684;&#x534F;&#x8BAE;&#x4EE5;&#x53CA;&#x901A;&#x8FC7;&#x660E;&#x786E;&#x754C;&#x5B9A;&#x7684;&#x63A5;&#x53E3;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x901A;&#x8FC7;&#x91C7;&#x7528;&#x5FAE;&#x670D;&#x52A1;&#x4FDD;&#x6301;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8303;&#x56F4;&#x5F88;&#x5C0F;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x5B9A;&#x4E49;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x95F4;&#x63A5;&#x53E3;&#x5E76;&#x63D0;&#x9AD8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90E8;&#x7F72;&#x901F;&#x5EA6;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x91C7;&#x7528;&#x5FAE;&#x670D;&#x52A1;&#x4F1A;&#x66B4;&#x9732;&#x51FA;&#x65B0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x901A;&#x4FE1;&#x901F;&#x5EA6;&#x8F83;&#x6162;&#x4EE5;&#x53CA;&#x5206;&#x5E03;&#x5F0F;&#x8DDF;&#x8E2A;&#x548C;&#x7B56;&#x7565;&#x63A7;&#x5236;&#x7F51;&#x7EDC;&#x7684;&#x9700;&#x6C42;&#x3002;&#x4E0D;&#x8981;&#x91C7;&#x7528;&#x5FAE;&#x670D;&#x52A1;&#x548C;&#x4ED6;&#x4EEC;&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898; - &#x800C;&#x4E0D;&#x80FD;&#x5728;&#x60A8;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x4E2D;&#x63D0;&#x4F9B;&#x597D;&#x5904;&#x3002;</p>
<p>&#x867D;&#x7136;&#x60A8;&#x51E0;&#x4E4E;&#x53EF;&#x4EE5;&#x9002;&#x5E94;&#x4EFB;&#x4F55;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x5BB9;&#x5668;&#x4E2D;&#x8FD0;&#x884C;&#x5E76;&#x4F7F;&#x7528;&#x5BB9;&#x5668;&#x7F16;&#x6392;&#x5668;&#x8FDB;&#x884C;&#x90E8;&#x7F72;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x9996;&#x9009;&#x8FC1;&#x79FB;&#x6240;&#x6709;&#x5173;&#x952E;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x60A8;&#x5C06;&#x5F88;&#x5FEB;&#x5F97;&#x5230;&#x52AA;&#x529B;&#x3002;</p>
<p>&#x9996;&#x5148;&#x786E;&#x5B9A;&#x63A5;&#x8FD1;&#x5177;&#x6709;&#x7B2C;1&#x7AE0;&#x6982;&#x8FF0;&#x7684;&#x7279;&#x6027;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E76;&#x83B7;&#x5F97;&#x5728;&#x4E91;&#x539F;&#x751F;&#x73AF;&#x5883;&#x4E2D;&#x8FD0;&#x884C;&#x5B83;&#x4EEC;&#x7684;&#x7ECF;&#x9A8C;&#x3002;&#x4E00;&#x65E6;&#x60A8;&#x56F4;&#x7ED5;&#x7B80;&#x5355;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x96C6;&#x4F53;&#x83B7;&#x5F97;&#x7ECF;&#x9A8C;&#x548C;&#x826F;&#x597D;&#x5B9E;&#x8DF5;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x5C31;&#x53EF;&#x4EE5;&#x51B3;&#x5B9A;&#x63A5;&#x4E0B;&#x6765;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#x3002;</p>
<p>&#x60A8;&#x7684;&#x670D;&#x52A1;&#x5668;&#x548C;&#x670D;&#x52A1;&#x4E5F;&#x4E0D;&#x4F8B;&#x5916;&#x3002;&#x5728;&#x5C06;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x5207;&#x6362;&#x4E3A;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#x4E4B;&#x524D;&#xFF0C;&#x60A8;&#x5E94;&#x786E;&#x4FDD;&#x5B83;&#x89E3;&#x51B3;&#x4E86;&#x5F53;&#x524D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x610F;&#x8BC6;&#x5230;&#x65B0;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x53EF;&#x9760;&#x7CFB;&#x7EDF;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x67B6;&#x6784;&#x8003;&#x8651;&#x662F;&#x4E89;&#x53D6;&#x7B80;&#x5355;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x8F6F;&#x4EF6;&#x548C;&#x7CFB;&#x7EDF;&#x81EA;&#x7136;&#x4F1A;&#x53D8;&#x5F97;&#x590D;&#x6742;&#xFF0C;&#x8FD9;&#x4F1A;&#x9020;&#x6210;&#x4E0D;&#x7A33;&#x5B9A;&#x3002;&#x5728;&#x4E91;&#x4E2D;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x91CA;&#x653E;&#x5BF9;&#x8BB8;&#x591A;&#x533A;&#x57DF;&#x7684;&#x63A7;&#x5236;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x7684;&#x533A;&#x57DF;&#x4FDD;&#x6301;&#x7B80;&#x5355;&#x6027;&#x5F88;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x65E0;&#x8BBA;&#x60A8;&#x5C06;&#x5185;&#x90E8;&#x90E8;&#x7F72;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x8FC1;&#x79FB;&#x5230;&#x4E91;&#x4E2D;&#x8FD8;&#x662F;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x90FD;&#x8981;&#x786E;&#x4FDD;&#x60A8;&#x5728;&#x7B2C;1&#x7AE0;&#x4E2D;&#x8FDB;&#x884C;&#x53EF;&#x7528;&#x6027;&#x6570;&#x5B66;&#x8BA1;&#x7B97;&#xFF0C;&#x5E76;&#x4E3A;&#x6DF7;&#x4E71;&#x60C5;&#x51B5;&#x505A;&#x597D;&#x51C6;&#x5907;&#x3002;</p>
<h3 id="&#x6DF7;&#x6C8C;&#x7BA1;&#x7406;">&#x6DF7;&#x6C8C;&#x7BA1;&#x7406;</h3>
<blockquote>
<p>&#x62E5;&#x62B1;&#x5931;&#x8D25;&#x5E76;&#x671F;&#x5F85;&#x6DF7;&#x4E71;&#x3002;</p>
<p>&#x2014;&#x2014;Netflix&#x7684;Andrew Spyker</p>
</blockquote>
<p>&#x5F53;&#x60A8;&#x6784;&#x5EFA;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x65F6;&#xFF0C;&#x5176;&#x76EE;&#x6807;&#x662F;&#x521B;&#x5EFA;&#x6700;&#x5C0F;&#x53EF;&#x884C;&#x4EA7;&#x54C1;&#xFF08;MVP&#xFF09;&#x548C;&#x8FED;&#x4EE3;.5&#x5C1D;&#x8BD5;&#x6307;&#x5B9A;&#x60A8;&#x7684;&#x5BA2;&#x6237;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x6216;&#x4ED6;&#x4EEC;&#x5C06;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x60A8;&#x7684;&#x4EA7;&#x54C1;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x7528;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x6210;&#x529F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x9002;&#x5E94;&#x800C;&#x4E0D;&#x662F;&#x9884;&#x6D4B;&#x3002;</p>
<p>&#x5BA2;&#x6237;&#x9700;&#x6C42;&#x6539;&#x53D8;;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x968F;&#x5B83;&#x4EEC;&#x6539;&#x53D8;&#x3002;&#x60A8;&#x65E0;&#x6CD5;&#x8BA1;&#x5212;&#x548C;&#x6784;&#x5EFA;&#x5B8C;&#x6574;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x4EA7;&#x54C1;&#x51C6;&#x5907;&#x5C31;&#x7EEA;&#x65F6;&#xFF0C;&#x9700;&#x6C42;&#x5DF2;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;</p>
<p>&#x4FDD;&#x6301;&#x654F;&#x6377;&#x5E76;&#x5728;&#x73B0;&#x6709;&#x6280;&#x672F;&#x57FA;&#x7840;&#x4E0A;&#x53D1;&#x5C55;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x5C31;&#x50CF;&#x60A8;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5BFC;&#x5165;&#x5E93;&#x4E00;&#x6837;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x4E3A;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x4F7F;&#x7528;IaaS&#x548C;SaaS&#x3002;&#x4F60;&#x8D8A;&#x52AA;&#x529B;&#x5EFA;&#x7ACB;&#x81EA;&#x5DF1;&#xFF0C;&#x4F60;&#x5C31;&#x8D8A;&#x80FD;&#x63D0;&#x4F9B;&#x4EF7;&#x503C;&#x3002;</p>
<p>&#x65E0;&#x8BBA;&#x4F55;&#x65F6;&#x91CA;&#x653E;&#x5BF9;&#x67D0;&#x7269;&#x7684;&#x63A7;&#x5236;&#xFF0C;&#x90FD;&#x4F1A;&#x5192;&#x7740;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x98CE;&#x9669;&#x3002;&#x5982;&#x679C;&#x56E0;&#x4E3A;&#x5BFC;&#x5165;&#x7684;&#x5E93;&#x5DF2;&#x66F4;&#x65B0;&#x800C;&#x5BFC;&#x81F4;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x65AD;&#xFF0C;&#x60A8;&#x5C06;&#x4F1A;&#x77E5;&#x9053;&#x8FD9;&#x662F;&#x4EC0;&#x4E48;&#x611F;&#x89C9;&#x3002;</p>
<p>&#x60A8;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F9D;&#x8D56;&#x4E8E;&#x5E93;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x8BE5;&#x529F;&#x80FD;&#x5DF2;&#x66F4;&#x6539;&#x3002;&#x4F60;&#x662F;&#x5426;&#x5E94;&#x8BE5;&#x5220;&#x9664;&#x5E93;&#x5E76;&#x7F16;&#x5199;&#x81EA;&#x5DF1;&#x7684;&#x529F;&#x80FD;&#x4EE5;&#x4FBF;&#x63A7;&#x5236;&#x5B83;&#xFF1F;&#x7B54;&#x6848;&#x51E0;&#x4E4E;&#x603B;&#x662F;&#x4E0D;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x60A8;&#x66F4;&#x65B0;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE5;&#x4F7F;&#x7528;&#x65B0;&#x5E93;&#xFF0C;&#x6216;&#x8005;&#x5C06;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x8F83;&#x65E7;&#x7248;&#x672C;&#x7684;&#x5E93;&#x4E0E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6346;&#x7ED1;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4EE5;&#x6682;&#x65F6;&#x907F;&#x514D;&#x635F;&#x574F;&#x3002;</p>
<p>&#x8FD0;&#x884C;&#x5728;&#x516C;&#x5171;&#x4E91;&#x4E0A;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;&#x60A8;&#x4E0D;&#x518D;&#x63A7;&#x5236;&#x786C;&#x8FDE;&#x7EBF;&#x7F51;&#x7EDC;&#xFF0C;&#x4F7F;&#x7528;&#x4EC0;&#x4E48;RAID&#x63A7;&#x5236;&#x5668;&#xFF0C;&#x6216;&#x8005;&#x865A;&#x62DF;&#x673A;&#x7684;&#x54EA;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x865A;&#x62DF;&#x673A;&#x7BA1;&#x7406;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x3002;&#x60A8;&#x6240;&#x62E5;&#x6709;&#x7684;&#x53EA;&#x662F;&#x53EF;&#x4EE5;&#x5728;&#x5E95;&#x5C42;&#x6280;&#x672F;&#x4E4B;&#x4E0A;&#x63D0;&#x4F9B;&#x62BD;&#x8C61;&#x7684;API&#x3002;</p>
<p>&#x60A8;&#x65E0;&#x6CD5;&#x63A7;&#x5236;&#x5E95;&#x5C42;&#x6280;&#x672F;&#x4F55;&#x65F6;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;&#x5982;&#x679C;&#x4E91;&#x63D0;&#x4F9B;&#x5546;&#x5F03;&#x7528;&#x6240;&#x6709;&#x5927;&#x578B;&#x5185;&#x5B58;&#x5B9E;&#x4F8B;&#x7C7B;&#x578B;&#xFF0C;&#x5219;&#x60A8;&#x522B;&#x65E0;&#x9009;&#x62E9;&#xFF0C;&#x53EA;&#x80FD;&#x9075;&#x5B88;&#x3002;&#x60A8;&#x8981;&#x4E48;&#x9002;&#x5E94;&#x65B0;&#x7684;&#x5C3A;&#x5BF8;&#xFF0C;&#x8981;&#x4E48;&#x652F;&#x4ED8;&#x66F4;&#x6362;&#x63D0;&#x4F9B;&#x5546;&#x7684;&#x6210;&#x672C;&#xFF08;&#x65F6;&#x95F4;&#x548C;&#x91D1;&#x94B1;&#xFF09;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x9644;&#x5F55;B&#x5173;&#x4E8E;&#x9501;&#x5B9A;&#xFF09;&#x3002;</p>
<p>&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x60A8;&#x6784;&#x5EFA;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x4E0D;&#x518D;&#x53EF;&#x4EE5;&#x4ECE;&#x5355;&#x4E2A;&#x5173;&#x952E;&#x670D;&#x52A1;&#x5668;&#x83B7;&#x5F97;&#x3002;&#x5982;&#x679C;&#x60A8;&#x91C7;&#x7528;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x65E0;&#x8BBA;&#x60A8;&#x662F;&#x5426;&#x559C;&#x6B22;&#xFF0C;&#x60A8;&#x6B63;&#x5728;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x5730;&#x907F;&#x514D;&#x5931;&#x8D25;&#x6765;&#x4FDD;&#x6301;&#x670D;&#x52A1;&#x53EF;&#x7528;&#x7684;&#x65E7;&#x505A;&#x6CD5;&#x4E0D;&#x8D77;&#x4F5C;&#x7528;&#x3002;&#x76EE;&#x6807;&#x4E0D;&#x518D;&#x662F;&#x60A8;&#x53EF;&#x4EE5;&#x8BBE;&#x8BA1;&#x7684;&#x6700;&#x5927;&#x6570;&#x76EE;&#x7684;&#x4E5D;&#x4E2A; - &#x5B83;&#x662F;&#x53EF;&#x4EE5;&#x9003;&#x8131;&#x7684;&#x6700;&#x5C0F;&#x6570;&#x91CF;&#x7684;&#x4E5D;&#x4E2A;&#x3002;</p>
<p>&#x73B0;&#x573A;&#x53EF;&#x9760;&#x6027;&#x5DE5;&#x7A0B;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x89E3;&#x91CA;&#x5B83;&#xFF1A;</p>
<p>&#x575A;&#x6301;SLO&#x5C06;&#x767E;&#x5206;&#x4E4B;&#x767E;&#x6EE1;&#x8DB3;&#x662F;&#x4E0D;&#x73B0;&#x5B9E;&#x7684;&#x548C;&#x4E0D;&#x53EF;&#x53D6;&#x7684;&#xFF1A;&#x8FD9;&#x6837;&#x505A;&#x53EF;&#x80FD;&#x4F1A;&#x964D;&#x4F4E;&#x521B;&#x65B0;&#x548C;&#x90E8;&#x7F72;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x9700;&#x8981;&#x6602;&#x8D35;&#x7684;&#xFF0C;&#x8FC7;&#x4E8E;&#x4FDD;&#x5B88;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x6216;&#x4E24;&#x8005;&#x517C;&#x800C;&#x6709;&#x4E4B;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x6700;&#x597D;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x9884;&#x7B97; - &#x4E00;&#x4E2A;&#x53EF;&#x80FD;&#x9519;&#x8FC7;SLO&#x7684;&#x901F;&#x7387; - &#x5E76;&#x4E14;&#x6BCF;&#x5929;&#x6216;&#x6BCF;&#x5468;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x8DDF;&#x8E2A;&#x3002;</p>
<p>&#x5DE5;&#x7A0B;&#x7684;&#x76EE;&#x6807;&#x4E0D;&#x53EF;&#x7528;;&#x5B83;&#x521B;&#x9020;&#x4E86;&#x5546;&#x4E1A;&#x4EF7;&#x503C;&#x3002;&#x4F60;&#x5E94;&#x8BE5;&#x5236;&#x9020;&#x5F39;&#x6027;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F46;&#x4E0D;&#x8981;&#x4EE5;&#x8FC7;&#x5EA6;&#x5DE5;&#x7A0B;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4E3A;&#x4EE3;&#x4EF7;&#x6765;&#x907F;&#x514D;&#x6DF7;&#x4E71;&#x3002;</p>
<p>&#x6D4B;&#x8BD5;&#x66F4;&#x6539;&#x4EE5;&#x9632;&#x6B62;&#x505C;&#x673A;&#x7684;&#x65E7;&#x65B9;&#x6CD5;&#x4E5F;&#x4E0D;&#x8D77;&#x4F5C;&#x7528;&#x3002;&#x4E3A;&#x5927;&#x578B;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x521B;&#x5EFA;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#x3002;&#x5F53;&#x670D;&#x52A1;&#x7ECF;&#x5E38;&#x66F4;&#x65B0;&#x5E76;&#x4E14;&#x90E8;&#x7F72;&#x662F;&#x81EA;&#x52A9;&#x670D;&#x52A1;&#x65F6;&#x5C24;&#x5176;&#x5982;&#x6B64;&#x3002;</p>
<p>&#x5F53;Netflix&#x6BCF;&#x5929;&#x6709;4,000&#x6B21;&#x90E8;&#x7F72;&#x6216;10,000&#x4E2A;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x7684;Facebook&#x7248;&#x672C;&#x65F6;&#xFF0C;&#x5BF9;&#x73AF;&#x5883;&#x8FDB;&#x884C;&#x5FEB;&#x7167;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#x9700;&#x8981;&#x52A8;&#x6001;&#x5206;&#x79BB;&#x751F;&#x4EA7;&#x90E8;&#x5206;&#x3002;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x9700;&#x8981;&#x652F;&#x6301;&#x8FD9;&#x79CD;&#x6D4B;&#x8BD5;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x652F;&#x6301;&#x7ECF;&#x5E38;&#x6D4B;&#x8BD5;&#x751F;&#x4EA7;&#x4E2D;&#x7684;&#x65B0;&#x4EE3;&#x7801;&#x6240;&#x5E26;&#x6765;&#x7684;&#x5931;&#x8D25;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x6D4B;&#x8BD5;&#x4E00;&#x4E9B;&#x6DF7;&#x4E71;&#xFF08;&#x53C2;&#x89C1;&#x7B2C;5&#x7AE0;&#xFF09;&#xFF0C;&#x4F46;&#x6DF7;&#x6C8C;&#x6839;&#x636E;&#x5B9A;&#x4E49;&#x662F;&#x4E0D;&#x53EF;&#x9884;&#x6D4B;&#x7684;&#x3002;&#x51C6;&#x5907;&#x60A8;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4EE5;&#x4FBF;&#x53EF;&#x9884;&#x6D4B;&#x5730;&#x5BF9;&#x6DF7;&#x4E71;&#x505A;&#x51FA;&#x53CD;&#x5E94;&#xFF0C;&#x800C;&#x4E0D;&#x8981;&#x8BD5;&#x56FE;&#x907F;&#x514D;&#x5B83;&#x3002;</p>
<h3 id="&#x5E94;&#x7528;&#x7A0B;&#x5E8F;">&#x5E94;&#x7528;&#x7A0B;&#x5E8F;</h3>
<p>&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x76EE;&#x7684;&#x662F;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x5982;&#x679C;&#x60A8;&#x7684;&#x4E1A;&#x52A1;&#x5B8C;&#x5168;&#x57FA;&#x4E8E;&#x5411;&#x5176;&#x4ED6;&#x516C;&#x53F8;&#x63D0;&#x4F9B;&#x57FA;&#x7840;&#x67B6;&#x6784;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x7684;&#x6210;&#x529F;&#x4ECD;&#x53D6;&#x51B3;&#x4E8E;&#x5176;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5EFA;&#x7ACB;&#x5B83;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x6765;&#x3002;&#x60A8;&#x521B;&#x5EFA;&#x7684;&#x4EFB;&#x4F55;&#x62BD;&#x8C61;&#x9700;&#x8981;&#x63D0;&#x9AD8;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<blockquote>
<p><strong>&#x907F;&#x514D;&#x201C;&#x6CC4;&#x6F0F;&#x62BD;&#x8C61;&#x201D;</strong></p>
<p>&#x62BD;&#x8C61;&#x5E76;&#x4E0D;&#x5B8C;&#x5168;&#x9690;&#x85CF;&#x4ED6;&#x4EEC;&#x62BD;&#x8C61;&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x3002;&#x6CC4;&#x6F0F;&#x62BD;&#x8C61;&#x5B9A;&#x5F8B;&#x6307;&#x51FA;&#xFF1A;&#x201C;&#x6240;&#x6709;&#x975E;&#x5E73;&#x51E1;&#x7684;&#x62BD;&#x8C61;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x90FD;&#x662F;&#x6CC4;&#x6F0F;&#x7684;&#x3002;&#x201D;</p>
<p>&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x8FDB;&#x4E00;&#x6B65;&#x62BD;&#x8C61;&#x67D0;&#x4E8B;&#xFF0C;&#x9690;&#x85CF;&#x4E8B;&#x7269;&#x7684;&#x7EC6;&#x8282;&#x5C31;&#x8D8A;&#x56F0;&#x96BE;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8D44;&#x6E90;&#x8BF7;&#x6C42;&#x901A;&#x5E38;&#x901A;&#x8FC7;&#x8BF7;&#x6C42;CPU&#x6838;&#x5FC3;&#x7684;&#x767E;&#x5206;&#x6BD4;&#xFF0C;&#x5185;&#x5B58;&#x91CF;&#x548C;&#x78C1;&#x76D8;&#x5B58;&#x50A8;&#x91CF;&#x6765;&#x62BD;&#x8C61;&#x5316;&#x3002;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x7684;&#x7269;&#x7406;&#x5206;&#x914D;&#x4E0D;&#x76F4;&#x63A5;&#x7531;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7BA1;&#x7406;&#xFF08;API&#x7531;&#x4ED6;&#x4EEC;&#x89C4;&#x5B9A;&#xFF09;&#xFF0C;&#x4F46;&#x5BF9;&#x8D44;&#x6E90;&#x7684;&#x8BF7;&#x6C42;&#x5F88;&#x660E;&#x663E;&#x5730;&#x8868;&#x660E;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7CFB;&#x7EDF;&#x5177;&#x6709;&#x53EF;&#x7528;&#x7684;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;&#x62BD;&#x8C61;&#x662F;&#x670D;&#x52A1;&#x5668;&#x6216;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;50&#x53F0;&#x670D;&#x52A1;&#x5668;&#xFF0C;0.2&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF09;&#x7684;&#x767E;&#x5206;&#x6BD4;&#xFF0C;&#x90A3;&#x4E48;&#x62BD;&#x8C61;&#x5E76;&#x4E0D;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x5B58;&#x5728;&#x5355;&#x4E00;&#x5927;&#x5C0F;&#x7684;&#x670D;&#x52A1;&#x5668;&#x6216;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5355;&#x5143;&#x3002;&#x786E;&#x4FDD;&#x521B;&#x5EFA;&#x7684;&#x62BD;&#x8C61;&#x5BF9;&#x4E8E;&#x5C06;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6709;&#x610F;&#x4E49;&#x3002;</p>
</blockquote>
<p>&#x4E91;&#x539F;&#x751F;&#x5B9E;&#x8DF5;&#x7684;&#x597D;&#x5904;&#x662F;&#xFF0C;&#x968F;&#x7740;&#x60A8;&#x63D0;&#x9AD8;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x60A8;&#x8FD8;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x8FD0;&#x884C;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7684;&#x80FD;&#x529B;&#x3002;&#x5982;&#x679C;&#x60A8;&#x9075;&#x5FAA;&#x7B2C;3-6&#x7AE0;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x60A8;&#x5C06;&#x5F88;&#x597D;&#x5730;&#x9002;&#x5E94;&#x4F7F;&#x7528;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x65AD;&#x6539;&#x8FDB;&#x548C;&#x8C03;&#x6574;&#x60A8;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4EE5;&#x6EE1;&#x8DB3;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<p>&#x91CD;&#x70B9;&#x5173;&#x6CE8;&#x6784;&#x5EFA;&#x8303;&#x56F4;&#x5C0F;&#xFF0C;&#x6613;&#x4E8E;&#x9002;&#x5E94;&#xFF0C;&#x6613;&#x4E8E;&#x64CD;&#x4F5C;&#x548C;&#x6545;&#x969C;&#x53D1;&#x751F;&#x65F6;&#x5177;&#x6709;&#x5F39;&#x6027;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x786E;&#x4FDD;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8D1F;&#x8D23;&#x6240;&#x6709;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7BA1;&#x7406;&#x548C;&#x66F4;&#x6539;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x4F60;&#x5C06;&#x521B;&#x5EFA;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;</p>
<h2 id="&#x9884;&#x6D4B;&#x672A;&#x6765;">&#x9884;&#x6D4B;&#x672A;&#x6765;</h2>
<p>&#x5982;&#x679C;&#x60A8;&#x5DF2;&#x7ECF;&#x91C7;&#x7528;&#x4E86;&#x672C;&#x4E66;&#x4E2D;&#x7684;&#x6A21;&#x5F0F;&#x548C;&#x5B9E;&#x8DF5;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x73B0;&#x5728;&#x5904;&#x4E8E;&#x672A;&#x77E5;&#x9886;&#x57DF;&#x3002;&#x8FD0;&#x884C;&#x5168;&#x7403;&#x6700;&#x5927;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x516C;&#x53F8;&#x5DF2;&#x91C7;&#x7528;&#x8FD9;&#x4E9B;&#x505A;&#x6CD5;&#x3002;&#x65E0;&#x8BBA;&#x4ED6;&#x4EEC;&#x8FD0;&#x884C;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7684;&#x65B0;&#x6A21;&#x5F0F;&#x5C1A;&#x672A;&#x516C;&#x5F00;&#x62AB;&#x9732;&#x6216;&#x4ECD;&#x5728;&#x53D1;&#x73B0;&#x4E4B;&#x4E2D;&#x3002;</p>
<p>&#x597D;&#x6D88;&#x606F;&#x662F;&#x60A8;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x73B0;&#x5728;&#x88AB;&#x8BBE;&#x8BA1;&#x4E3A;&#x654F;&#x6377;&#x548C;&#x53D8;&#x5316;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x66F4;&#x8F7B;&#x677E;&#x5730;&#x9002;&#x5E94;&#x60A8;&#x9047;&#x5230;&#x7684;&#x4EFB;&#x4F55;&#x65B0;&#x6311;&#x6218;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5C55;&#x671B;&#x672A;&#x6765;&#x7684;&#x9053;&#x8DEF;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E0D;&#x8003;&#x8651;&#x73B0;&#x6709;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x6A21;&#x5F0F;&#xFF0C;&#x800C;&#x662F;&#x8003;&#x8651;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x5728;&#x54EA;&#x91CC;&#x83B7;&#x5F97;&#x7075;&#x611F; - &#x8F6F;&#x4EF6;&#x3002;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x91C7;&#x7528;&#x7684;&#x6A21;&#x5F0F;&#x90FD;&#x6765;&#x81EA;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x67E5;&#x770B;&#x5206;&#x5E03;&#x5F0F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x5F88;&#x591A;&#x5E74;&#x524D;&#xFF0C;&#x5F53;&#x8F6F;&#x4EF6;&#x66B4;&#x9732;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x65F6;&#xFF0C;&#x5728;&#x5355;&#x4E00;&#x4EE3;&#x7801;&#x5E93;&#x4E0B;&#x7684;&#x5355;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x4F1A;&#x6269;&#x5C55;&#x3002;&#x8FD9;&#x5305;&#x62EC;&#x7BA1;&#x7406;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6027;&#x80FD;&#x548C;&#x6D41;&#x7A0B;&#x9650;&#x5236;&#x3002;</p>
<p>&#x8BE5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x590D;&#x5236;&#x5230;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x4EE5;&#x6EE1;&#x8DB3;&#x9700;&#x6C42;&#x3002;&#x5F53;&#x8FBE;&#x5230;&#x9650;&#x5236;&#x65F6;&#xFF0C;&#x5B83;&#x88AB;&#x5206;&#x89E3;&#x6210;&#x66F4;&#x5C0F;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x521B;&#x5EFA;API&#x4EE5;&#x901A;&#x8FC7;HTTP&#x8FDC;&#x7A0B;&#x8C03;&#x7528;&#x529F;&#x80FD;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x901A;&#x8FC7;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E93;&#x3002;</p>
<p>&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x91C7;&#x53D6;&#x4E86;&#x7C7B;&#x4F3C;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x6269;&#x5927;&#x89C4;&#x6A21;;&#x5B83;&#x5728;&#x5927;&#x591A;&#x6570;&#x9886;&#x57DF;&#x53EA;&#x9002;&#x5E94;&#x6BD4;&#x8F6F;&#x4EF6;&#x66F4;&#x6162;&#x7684;&#x901F;&#x5EA6;&#x3002;&#x50CF;Kubernetes&#x8FD9;&#x6837;&#x7684;&#x73B0;&#x4EE3;&#x5316;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5E73;&#x53F0;&#x5C06;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7BA1;&#x7406;&#x5206;&#x89E3;&#x6210;&#x66F4;&#x5C0F;&#x7684;&#x7EC4;&#x4EF6;&#x3002;&#x8FD9;&#x4E9B;&#x7EC4;&#x4EF6;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5176;&#x6027;&#x80FD;&#x74F6;&#x9888;&#xFF08;CPU&#xFF0C;&#x5185;&#x5B58;&#x548C;I / O&#xFF09;&#x72EC;&#x7ACB;&#x6269;&#x5C55;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x8FED;&#x4EE3;&#x3002;</p>
<p>&#x6709;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6CA1;&#x6709;&#x76F8;&#x540C;&#x7684;&#x6269;&#x5C55;&#x9700;&#x6C42;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x9002;&#x5E94;&#x65B0;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x3002;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x89D2;&#x8272;&#x4E4B;&#x4E00;&#x662F;&#x77E5;&#x9053;&#x4F55;&#x65F6;&#x4F55;&#x65F6;&#x91C7;&#x7528;&#x65B0;&#x6280;&#x672F;&#x3002;&#x53EA;&#x6709;&#x90A3;&#x4E9B;&#x4E86;&#x89E3;&#x5176;&#x5806;&#x6808;&#x7684;&#x5C40;&#x9650;&#x6027;&#x548C;&#x74F6;&#x9888;&#x7684;&#x4EBA;&#x624D;&#x80FD;&#x51B3;&#x5B9A;&#x4EC0;&#x4E48;&#x662F;&#x6B63;&#x786E;&#x7684;&#x65B9;&#x5411;&#x3002;</p>
<p>&#x5BC6;&#x5207;&#x5173;&#x6CE8;&#x65B0;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x53D1;&#x73B0;&#x65B0;&#x7684;&#x5C40;&#x9650;&#x65F6;&#x6240;&#x5F00;&#x53D1;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x5982;&#x679C;&#x60A8;&#x80FD;&#x591F;&#x7406;&#x89E3;&#x9650;&#x5236;&#x6761;&#x4EF6;&#x548C;&#x53D8;&#x66F4;&#x539F;&#x56E0;&#xFF0C;&#x60A8;&#x5C06;&#x59CB;&#x7EC8;&#x8D70;&#x5728;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x524D;&#x6CBF;&#x3002;</p>
<h2 id="&#x7ED3;&#x8BBA;">&#x7ED3;&#x8BBA;</h2>
<p>&#x672C;&#x4E66;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5E2E;&#x52A9;&#x60A8;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x662F;&#x4EC0;&#x4E48;&#x4EE5;&#x53CA;&#x60A8;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x91C7;&#x7528;&#x5B83;&#x3002;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x76F8;&#x4FE1;&#x5B83;&#x6BD4;&#x4F20;&#x7EDF;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x6709;&#x5F88;&#x591A;&#x4F18;&#x52BF;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x4E0D;&#x5E0C;&#x671B;&#x60A8;&#x5728;&#x4E0D;&#x7406;&#x89E3;&#x5B83;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x76F2;&#x76EE;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x6280;&#x672F;&#x3002;</p>
<p>&#x4E0D;&#x8981;&#x671F;&#x671B;&#x5728;&#x4E0D;&#x91C7;&#x7528;&#x5176;&#x4F34;&#x968F;&#x7684;&#x6587;&#x5316;&#x548C;&#x6D41;&#x7A0B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x83B7;&#x5F97;&#x6240;&#x6709;&#x597D;&#x5904;&#x3002;&#x53EA;&#x662F;&#x5728;&#x516C;&#x5171;&#x4E91;&#x4E2D;&#x8FD0;&#x884C;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x6216;&#x8FD0;&#x884C;&#x5BB9;&#x5668;&#x7F16;&#x6392;&#x5668;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x8BE5;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x5982;&#x4F55;&#x9002;&#x5E94;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x5728;&#x4E9A;&#x9A6C;&#x900A;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x4E2D;&#x624B;&#x52A8;&#x521B;&#x5EFA;&#x5C11;&#x91CF;&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x901A;&#x8FC7;SSH&#x8FDE;&#x63A5;&#x5230;&#x6BCF;&#x53F0;&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x521B;&#x5EFA;Kubernetes&#x7FA4;&#x96C6;&#x6BD4;&#x6539;&#x53D8;&#x4EBA;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x66F4;&#x5BB9;&#x6613;&#x3002;&#x524D;&#x8005;&#x4E0D;&#x662F;&#x4E91;&#x539F;&#x751F;&#x7684;&#x3002;</p>
<p>&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x914D;&#x7F6E;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x662F;&#x53CA;&#x65F6;&#x7684;&#x9759;&#x6001;&#x5FEB;&#x7167;;&#x4ED6;&#x4EEC;&#x5E94;&#x8BE5;&#x4E0D;&#x65AD;&#x8FD0;&#x884C;&#x5E76;&#x5C06;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x63A8;&#x5411;&#x671F;&#x671B;&#x7684;&#x72B6;&#x6001;&#x3002;&#x7BA1;&#x7406;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E0D;&#x662F;&#x5173;&#x4E8E;&#x7EF4;&#x62A4;&#x4E3B;&#x673A;&#x3002;&#x60A8;&#x9700;&#x8981;&#x4E3A;&#x8D44;&#x6E90;&#x521B;&#x5EFA;&#x62BD;&#x8C61;&#xFF0C;&#x7528;API&#x6765;&#x8868;&#x793A;&#x8FD9;&#x4E9B;&#x62BD;&#x8C61;&#xFF0C;&#x4EE5;&#x53CA;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x76EE;&#x6807;&#x662F;&#x6EE1;&#x8DB3;&#x60A8;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x5E76;&#x7F16;&#x5199;&#x4E0E;&#x60A8;&#x7684;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x548C;&#x5DE5;&#x4F5C;&#x804C;&#x80FD;&#x76F8;&#x5F53;&#x7684;&#x8F6F;&#x4EF6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x968F;&#x7740;&#x6D41;&#x7A0B;&#x548C;&#x529F;&#x80FD;&#x7684;&#x9891;&#x7E41;&#x53D8;&#x5316;&#xFF0C;&#x8F6F;&#x4EF6;&#x9700;&#x8981;&#x8F7B;&#x677E;&#x9002;&#x5E94;&#x3002;</p>
<p>&#x638C;&#x63E1;&#x5B83;&#x65F6;&#xFF0C;&#x60A8;&#x5C06;&#x4E0D;&#x65AD;&#x53D1;&#x73B0;&#x5728;&#x521B;&#x5EFA;&#x65B0;&#x62BD;&#x8C61;&#xFF0C;&#x4FDD;&#x6301;&#x670D;&#x52A1;&#x5F39;&#x6027;&#x4EE5;&#x53CA;&#x63A8;&#x52A8;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x6781;&#x9650;&#x65B9;&#x9762;&#x7684;&#x6311;&#x6218;&#x3002;&#x5982;&#x679C;&#x60A8;&#x80FD;&#x591F;&#x627E;&#x5230;&#x65B0;&#x7684;&#x9650;&#x5236;&#x548C;&#x6709;&#x7528;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x8BF7;&#x56DE;&#x9988;&#x7ED9;&#x60A8;&#x6240;&#x5C5E;&#x7684;&#x793E;&#x533A;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x7814;&#x7A76;&#x548C;&#x793E;&#x533A;&#x5F00;&#x653E;&#x6E90;&#x4EE3;&#x7801;&#x548C;&#x56DE;&#x9988;&#x662F;&#x8FD9;&#x4E9B;&#x6A21;&#x5F0F;&#x5982;&#x4F55;&#x4ECE;&#x5F00;&#x521B;&#x5B83;&#x4EEC;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x6D8C;&#x73B0;&#x51FA;&#x6765;&#x3002;&#x5171;&#x4EAB;&#x5141;&#x8BB8;&#x66F4;&#x591A;&#x7684;&#x521B;&#x65B0;&#x548C;&#x89C1;&#x89E3;&#x4F20;&#x64AD;&#xFF0C;&#x5E76;&#x4F7F;&#x8FD9;&#x4E9B;&#x5B9E;&#x8DF5;&#x7684;&#x5BFF;&#x547D;&#x548C;&#x9002;&#x5E94;&#x6027;&#x66F4;&#x5BB9;&#x6613;&#x4E3A;&#x6BCF;&#x4E2A;&#x4EBA;&#x3002;</p>
<p>&#x521B;&#x65B0;&#x4E0D;&#x4EC5;&#x4EC5;&#x6765;&#x81EA;&#x5BFB;&#x627E;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x6216;&#x6784;&#x5EFA;&#x4E0B;&#x4E00;&#x4E2A;&#x4F1F;&#x5927;&#x7684;&#x4EA7;&#x54C1;&#x3002;&#x5B83;&#x91C7;&#x53D6;&#x770B;&#x4F3C;&#x4E0D;&#x91CD;&#x8981;&#x7684;&#x5F62;&#x5F0F;&#x63D0;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x53D1;&#x8A00;&#x5E76;&#x5931;&#x8D25;&#x3002;</p>
<p>&#x8BF7;&#x7EE7;&#x7EED;&#x505A;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5931;&#x8D25;&#x548C;&#x5206;&#x4EAB;&#x3002;</p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; 2018 cloudnativego.com all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification"> Updated at 
2018-04-04 21:48:37
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch08-securing-applications.html" class="navigation navigation-prev " aria-label="Previous page: 第8章 保护应用程序">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="appendix-a-patterns-for-network-resiilency.html" class="navigation navigation-next " aria-label="Next page: 附录A 网络弹性模式">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第9章 实施云原生基础设施","level":"1.12","depth":1,"next":{"title":"附录A 网络弹性模式","level":"1.13","depth":1,"path":"appendix-a-patterns-for-network-resiilency.md","ref":"appendix-a-patterns-for-network-resiilency.md","articles":[]},"previous":{"title":"第8章 保护应用程序","level":"1.11","depth":1,"path":"ch08-securing-applications.md","ref":"ch08-securing-applications.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","codesnippet","splitter","page-toc-button","editlink","back-to-top-button","-lunr","-search","search-plus","github-buttons@2.1.0","favicon@^0.0.2","tbfed-pagefooter@^0.0.1","3-ba","theme-default","-highlight","prism","prism-themes","sitemap-general"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © 2018 cloudnativego.com","modify_label":" Updated at ","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prism-themes/themes/prism-ghcolors.css"]},"github":{"url":"https://github.com/CloudNativeInfra/cni"},"editlink":{"label":"Edit this page","multilingual":false,"base":"https://github.com/CloudNativeInfra/cni/blob/master/cn"},"splitter":{},"codesnippet":{},"sitemap-general":{"prefix":"https://cloudnativego.com/cni/"},"fontsettings":{"theme":"white","family":"sans","size":2},"favicon":{"shortcut":"favicon.ico","bookmark":"favicon.ico"},"page-toc-button":{},"back-to-top-button":{},"prism-themes":{},"github-buttons":{"repo":"CloudNativeInfra/cni","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"c889b4cfd2df3f575151a52b18610b26"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"search-plus":{}},"theme":"default","author":"cloudnativego.com","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"云原生基础设施 - cloudnativego.com","language":"cn","links":{"sidebar":{"CloudNativeGo":"https://cloudnativego.com","Jimmy Song":"https://jimmysong.io"}},"gitbook":"*","description":"云原生基础设施|Cloud Native Infrastructure"},"file":{"path":"ch09-implementing-cloud-native-infrasctructure.md","mtime":"2018-04-04T13:48:37.631Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-10-23T14:35:21.214Z"},"basePath":".","book":{"language":"cn"}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

