
<!DOCTYPE HTML>
<html lang="cn" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第2章 何时采用云原生 · 云原生基础设施 - cloudnativego.com</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="cloudnativego.com">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-ghcolors.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch03-evolution-of-cloud-native-developments.html" />
    
    
    <link rel="prev" href="ch01-what-is-cloud-native-infrastructure.html" />
    

    
        <link rel="shortcut icon" href='favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"CloudNativeInfra/cni","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://cloudnativego.com" target="_blank" class="custom-link">CloudNativeGo</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    关于本书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="foreword.html">
            
                <a href="foreword.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="introduction.html">
            
                <a href="introduction.html">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch01-what-is-cloud-native-infrastructure.html">
            
                <a href="ch01-what-is-cloud-native-infrastructure.html">
            
                    
                    第1章 什么是云原生基础设施？
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="ch02-when-to-adopt-cloud-native.html">
            
                <a href="ch02-when-to-adopt-cloud-native.html">
            
                    
                    第2章 何时采用云原生
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch03-evolution-of-cloud-native-developments.html">
            
                <a href="ch03-evolution-of-cloud-native-developments.html">
            
                    
                    第3章 云原生部署的演变
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch04-designing-infrastructure-applicaitons.html">
            
                <a href="ch04-designing-infrastructure-applicaitons.html">
            
                    
                    第4章 设计基础架构应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch05-developing-infrastructure-applications.html">
            
                <a href="ch05-developing-infrastructure-applications.html">
            
                    
                    第5章 开发基础架构应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch06-testing-cloud-native-infrastructure.html">
            
                <a href="ch06-testing-cloud-native-infrastructure.html">
            
                    
                    第6章 测试云原生基础设施
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch07-managing-cloud-native-applications.html">
            
                <a href="ch07-managing-cloud-native-applications.html">
            
                    
                    第7章 管理云原生应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch08-securing-applications.html">
            
                <a href="ch08-securing-applications.html">
            
                    
                    第8章 保护应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch09-implementing-cloud-native-infrasctructure.html">
            
                <a href="ch09-implementing-cloud-native-infrasctructure.html">
            
                    
                    第9章 实现云原生基础设施
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="appendix-a-patterns-for-network-resiilency.html">
            
                <a href="appendix-a-patterns-for-network-resiilency.html">
            
                    
                    附录A 网络弹性模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="appendix-b-lock-in.html">
            
                <a href="appendix-b-lock-in.html">
            
                    
                    附录B 锁定
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="appendix-c-box-case-study.html">
            
                <a href="appendix-c-box-case-study.html">
            
                    
                    附录C Box：案例研究
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第2章 何时采用云原生</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;2&#x7AE0;-&#x4F55;&#x65F6;&#x91C7;&#x7528;&#x4E91;&#x539F;&#x751F;">&#x7B2C;2&#x7AE0; &#x4F55;&#x65F6;&#x91C7;&#x7528;&#x4E91;&#x539F;&#x751F;</h1>
<p>&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5E76;&#x4E0D;&#x9002;&#x5408;&#x6240;&#x6709;&#x4EBA;&#x3002;&#x4EFB;&#x4F55;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x90FD;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x6743;&#x8861;&#x3002;&#x53EA;&#x6709;&#x719F;&#x6089;&#x81EA;&#x5DF1;&#x9700;&#x6C42;&#x7684;&#x4EBA;&#x624D;&#x80FD;&#x51B3;&#x5B9A;&#x54EA;&#x4E9B;&#x6743;&#x8861;&#x662F;&#x6709;&#x76CA;&#x7684;&#xFF0C;&#x54EA;&#x4E9B;&#x662F;&#x6709;&#x5BB3;&#x7684;&#x3002;</p>
<p>&#x4E0D;&#x8981;&#x5728;&#x4E0D;&#x4E86;&#x89E3;&#x5176;&#x5F71;&#x54CD;&#x548C;&#x9650;&#x5236;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x91C7;&#x7528;&#x5DE5;&#x5177;&#x6216;&#x8BBE;&#x8BA1;&#x3002;&#x6211;&#x4EEC;&#x76F8;&#x4FE1;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x6709;&#x5F88;&#x591A;&#x597D;&#x5904;&#xFF0C;&#x4F46;&#x9700;&#x8981;&#x610F;&#x8BC6;&#x5230;&#x5B83;&#x4E0D;&#x5E94;&#x8BE5;&#x88AB;&#x76F2;&#x76EE;&#x7684;&#x91C7;&#x7528;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x613F;&#x610F;&#x5F15;&#x5BFC;&#x522B;&#x4EBA;&#x901A;&#x8FC7;&#x9519;&#x8BEF;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x6EE1;&#x8DB3;&#x4ED6;&#x4EEC;&#x9700;&#x6C42;&#x3002;</p>
<p>&#x4F60;&#x600E;&#x4E48;&#x77E5;&#x9053;&#x662F;&#x5426;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8FDB;&#x884C;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#xFF1F;&#x4EE5;&#x4E0B;&#x662F;&#x4E00;&#x4E9B;&#x4F60;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x786E;&#x5B9A;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x662F;&#x5426;&#x9002;&#x5408;&#x4F60;&#xFF1A;</p>
<ul>
<li>&#x4F60;&#x6709;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5417;&#xFF1F;(&#x6709;&#x5173;&#x53EF;&#x4ECE;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E2D;&#x53D7;&#x76CA;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x529F;&#x80FD;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;1&#x7AE0;)</li>
<li>&#x4F60;&#x7684;&#x5DE5;&#x7A0B;&#x56E2;&#x961F;&#x662F;&#x5426;&#x613F;&#x610F;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x7F16;&#x5199;&#x4F53;&#x73B0;&#x5176;&#x4F5C;&#x4E1A;&#x529F;&#x80FD;&#x7684;&#x751F;&#x4EA7;&#x8D28;&#x91CF;&#x4EE3;&#x7801;&#x4F5C;&#x4E3A;&#x8F6F;&#x4EF6;&#xFF1F;</li>
<li>&#x4F60;&#x5728;&#x672C;&#x5730;&#x6216;&#x516C;&#x6709;&#x4E91;&#x662F;&#x5426;&#x62E5;&#x6709;&#x57FA;&#x4E8E;API&#x9A71;&#x52A8;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;(IaaS)&#xFF1F;</li>
<li>&#x4F60;&#x7684;&#x4E1A;&#x52A1;&#x662F;&#x5426;&#x9700;&#x8981;&#x66F4;&#x5FEB;&#x7684;&#x5F00;&#x53D1;&#x5468;&#x671F;&#x6216;&#x975E;&#x7EBF;&#x6027;&#x4EBA;&#x5458;/&#x7CFB;&#x7EDF;&#x7F29;&#x653E;&#x6BD4;&#x4F8B;&#xFF1F;</li>
</ul>
<p>&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x90FD;&#x56DE;&#x7B54;&#x201C;yes&#x201D;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x4ECE;&#x672C;&#x4E66;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x4ECB;&#x7ECD;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E2D;&#x53D7;&#x76CA;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x95EE;&#x9898;&#x56DE;&#x7B54;&#x662F;&#x201C;no&#x201D;&#xFF0C;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x4F60;&#x65E0;&#x6CD5;&#x4ECE;&#x67D0;&#x4E9B;&#x4E91;&#x539F;&#x751F;&#x5B9E;&#x8DF5;&#x4E2D;&#x53D7;&#x76CA;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x505A;&#x66F4;&#x591A;&#x5DE5;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x80FD;&#x4ECE;&#x6B64;&#x7C7B;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E2D;&#x5145;&#x5206;&#x53D7;&#x76CA;&#x3002;</p>
<p>&#x5728;&#x4F60;&#x7684;&#x4E1A;&#x52A1;&#x51C6;&#x5907;&#x597D;&#x4E4B;&#x524D;&#x5C1D;&#x8BD5;&#x91C7;&#x7528;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x540C;&#x6837;&#x7CDF;&#x7CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5C06;&#x5F3A;&#x5236;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x8BD5;&#x56FE;&#x5728;&#x8C03;&#x67E5;&#x4E0D;&#x5145;&#x5206;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x83B7;&#x5F97;&#x6536;&#x76CA;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x5931;&#x8D25;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x67B6;&#x6784;&#x89C6;&#x4E3A;&#x6709;&#x7F3A;&#x9677;&#x6216;&#x65E0;&#x76CA;&#x5904;&#x3002;&#x7531;&#x4E8E;&#x8FC7;&#x53BB;&#x7684;&#x504F;&#x89C1;&#xFF0C;&#x4E00;&#x4E2A;&#x7ECF;&#x8FC7;&#x5C1D;&#x8BD5;&#x7684;&#x5931;&#x8D25;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4EE5;&#x540E;&#x53EF;&#x80FD;&#x5F88;&#x96BE;&#x91C7;&#x7528;&#xFF0C;&#x65E0;&#x8BBA;&#x5B83;&#x662F;&#x5426;&#x662F;&#x6B63;&#x786E;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x5728;&#x4F60;&#x51C6;&#x5907;&#x5C06;&#x7EC4;&#x7EC7;&#x548C;&#x6280;&#x672F;&#x6210;&#x4E3A;&#x4E91;&#x539F;&#x751F;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BA8;&#x8BBA;&#x4E00;&#x4E9B;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x7684;&#x9886;&#x57DF;&#x3002;&#x6709;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x9700;&#x8981;&#x8003;&#x8651;&#xFF0C;&#x4F46;&#x4E00;&#x4E9B;&#x5173;&#x952E;&#x9886;&#x57DF;&#x662F;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x7EC4;&#x7EC7;&#x4E2D;&#x7684;&#x4EBA;&#x5458;&#xFF0C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7CFB;&#x7EDF;&#x548C;&#x4F60;&#x7684;&#x4E1A;&#x52A1;&#x3002;</p>
<h2 id="&#x5E94;&#x7528;&#x7A0B;&#x5E8F;">&#x5E94;&#x7528;&#x7A0B;&#x5E8F;</h2>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x90E8;&#x5206;&#x3002;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5DF2;&#x7ECF;&#x5F88;&#x5B8C;&#x5584;&#xFF0C;&#x81EA;&#x516C;&#x5171;&#x4E91;&#x51FA;&#x73B0;&#x4EE5;&#x6765;&#xFF0C;&#x5DE5;&#x5177;&#x6027;&#x80FD;&#x5F97;&#x5230;&#x4E86;&#x663E;&#x7740;&#x63D0;&#x5347;&#x3002;&#x5982;&#x679C;&#x4F60;&#x65E0;&#x6CD5;&#x6784;&#x5EFA;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E76;&#x901A;&#x8FC7;&#x7ECF;&#x8FC7;&#x9A8C;&#x8BC1;&#x548C;&#x6D4B;&#x8BD5;&#x7684;&#x7BA1;&#x9053;&#x81EA;&#x52A8;&#x90E8;&#x7F72;&#x5B83;&#x4EEC;&#xFF0C;&#x5219;&#x4E0D;&#x5E94;&#x7EE7;&#x7EED;&#x91C7;&#x7528;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x6765;&#x652F;&#x6301;&#x5B83;&#x4EEC;&#x3002;</p>
<p>&#x6784;&#x5EFA;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x4F60;&#x5FC5;&#x987B;&#x5148;&#x62E5;&#x6709;&#x5FAE;&#x670D;&#x52A1;&#x3002;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x4F60;&#x5FC5;&#x987B;&#x7528;&#x6700;&#x65B0;&#x7684;&#x8D8B;&#x52BF;&#x8BED;&#x8A00;&#x5F00;&#x53D1;&#x4F60;&#x7684;&#x6240;&#x6709;&#x8F6F;&#x4EF6;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x5FC5;&#x987B;&#x7F16;&#x5199;&#x53EF;&#x4EE5;&#x7531;&#x8F6F;&#x4EF6;&#x7BA1;&#x7406;&#x7684;&#x8F6F;&#x4EF6;&#x3002;</p>
<p>&#x5728;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4EBA;&#x7C7B;&#x5E94;&#x8BE5;&#x4E0E;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x3002;&#x5176;&#x4ED6;&#x4E00;&#x5207;&#x90FD;&#x5E94;&#x8BE5;&#x7531;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x6216;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6765;&#x7BA1;&#x7406;&#x3002;</p>
<p>&#x4E86;&#x89E3;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x5728;&#x5B83;&#x4EEC;&#x9700;&#x8981;&#x52A8;&#x6001;&#x5730;&#x6269;&#x5C55;&#x591A;&#x4E2A;&#x5B9E;&#x4F8B;&#x65F6;&#x3002;&#x6269;&#x5C55;&#x901A;&#x5E38;&#x610F;&#x5473;&#x7740;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x540E;&#x9762;&#x7684;&#x540C;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6709;&#x591A;&#x4E2A;&#x526F;&#x672C;&#x3002;&#x5B83;&#x5047;&#x5B9A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x72B6;&#x6001;&#x5B58;&#x50A8;&#x5728;&#x5B58;&#x50A8;&#x670D;&#x52A1;&#xFF08;&#x5373;&#x6570;&#x636E;&#x5E93;&#xFF09;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x9700;&#x8981;&#x8FD0;&#x884C;&#x5B9E;&#x4F8B;&#x4E4B;&#x95F4;&#x7684;&#x590D;&#x6742;&#x534F;&#x8C03;&#x3002;</p>
<p>&#x52A8;&#x6001;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7BA1;&#x7406;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x9700;&#x8981;&#x4EBA;&#x53C2;&#x4E0E;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5EA6;&#x91CF;&#x89E6;&#x53D1;&#x4E86;&#x6269;&#x5C55;&#xFF0C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x505A;&#x4E86;&#x6B63;&#x786E;&#x7684;&#x64CD;&#x4F5C;&#x6765;&#x6269;&#x5C55;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x8FD9;&#x662F;&#x5927;&#x591A;&#x6570;&#x4E91;&#x73AF;&#x5883;&#x7684;&#x57FA;&#x672C;&#x7279;&#x5F81;&#x3002;&#x8FD0;&#x884C;&#x52A8;&#x6001;&#x4F38;&#x7F29;&#x7684;&#x8D44;&#x6E90;&#x7EC4;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x4F60;&#x62E5;&#x6709;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;;&#x4F46;&#x5982;&#x679C;&#x9700;&#x8981;auto-scaling&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x8868;&#x660E;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5DF2;&#x51C6;&#x5907;&#x5C31;&#x7EEA;&#x4E86;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53D7;&#x76CA;&#xFF0C;&#x7F16;&#x5199;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x914D;&#x7F6E;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x4EBA;&#x5458;&#x9700;&#x8981;&#x652F;&#x6301;&#x8FD9;&#x79CD;&#x5DE5;&#x4F5C;&#x65B9;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4EBA;&#x613F;&#x610F;&#x653E;&#x5F03;&#x5BF9;&#x8F6F;&#x4EF6;&#x7684;&#x63A7;&#x5236;&#xFF0C;&#x4F60;&#x5C06;&#x6C38;&#x8FDC;&#x65E0;&#x6CD5;&#x5B9E;&#x73B0;&#x5B83;&#x7684;&#x597D;&#x5904;&#x3002;</p>
<h2 id="&#x4EBA;">&#x4EBA;</h2>
<p>&#x4EBA;&#x662F;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E2D;&#x6700;&#x96BE;&#x7684;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x60F3;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x80FD;&#x591F;&#x7528;&#x8F6F;&#x4EF6;&#x53D6;&#x4EE3;&#x4EBA;&#x4EEC;&#x804C;&#x80FD;&#x548C;&#x51B3;&#x7B56;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x786E;&#x4FDD;&#x4ED6;&#x4EEC;&#x77E5;&#x9053;&#x4F60;&#x6709;&#x6700;&#x5927;&#x7684;&#x5229;&#x76CA;&#x3002;&#x4ED6;&#x4EEC;&#x4E0D;&#x4EC5;&#x9700;&#x8981;&#x63A5;&#x53D7;&#x53D8;&#x5316;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x53BB;&#x5BFB;&#x6C42;&#x5E76;&#x6539;&#x53D8;&#x3002;</p>
<p>&#x5F00;&#x53D1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F88;&#x56F0;&#x96BE;;&#x8FD0;&#x8425;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5F88;&#x96BE;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7ECF;&#x5E38;&#x76F8;&#x4FE1;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x5DE5;&#x5177;&#x548C;&#x81EA;&#x52A8;&#x5316;&#x53D6;&#x4EE3;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x64CD;&#x4F5C;&#x5458;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x64CD;&#x4F5C;&#x5458;&#x5E0C;&#x671B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x80FD;&#x591F;&#x7F16;&#x5199;&#x66F4;&#x53EF;&#x9760;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x81EA;&#x52A8;&#x8C03;&#x8BD5;&#x548C;&#x6062;&#x590D;&#x3002;&#x8FD9;&#x4E9B;&#x7D27;&#x5F20;&#x5173;&#x7CFB;&#x662F;DevOps&#x7684;&#x57FA;&#x7840;&#xFF0C;DevOps&#x6709;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x4E66;&#x7C4D;&#xFF0C;&#x5305;&#x62EC;&#x7531;Jennifer Davis&#x548C;Katherine Daniels&#x64B0;&#x5199;&#x7684;EffectiveDevOps(O&apos;Reilly&#xFF0C;2016)&#x3002;</p>
<p>&#x4EBA;&#x4EEC;&#x4E0D;&#x4F1A;&#x6269;&#x5927;&#x89C4;&#x6A21;&#xFF0C;&#x4E5F;&#x4E0D;&#x64C5;&#x957F;&#x91CD;&#x590D;&#xFF0C;&#x5E73;&#x51E1;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x7CFB;&#x7EDF;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x76EE;&#x6807;&#x5E94;&#x8BE5;&#x662F;&#x6D88;&#x9664;&#x4E16;&#x4FD7;&#x548C;&#x91CD;&#x590D;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4EE5;&#x4FBF;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x4E13;&#x6CE8;&#x4E8E;&#x66F4;&#x6709;&#x8DA3;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x5177;&#x5907;&#x5F00;&#x53D1;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x548C;&#x51B3;&#x7B56;&#x7684;&#x8F6F;&#x4EF6;&#x7684;&#x6280;&#x80FD;&#x3002;&#x9700;&#x8981;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x6765;&#x7F16;&#x5199;&#x6240;&#x9700;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x7EF4;&#x62A4;&#x5B83;&#x3002;</p>
<p>&#x6700;&#x5173;&#x952E;&#x7684;&#x65B9;&#x9762;&#x662F;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x5DE5;&#x7A0B;&#x7684;&#x4E00;&#x65B9;&#x65E0;&#x6CD5;&#x8FC1;&#x79FB;&#x5230;&#x8FD0;&#x884C;&#x548C;&#x7BA1;&#x7406;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x65B0;&#x65B9;&#x5F0F;&#x3002;&#x56E2;&#x961F;&#x7EC4;&#x7EC7;&#x548C;&#x6C9F;&#x901A;&#x7ED3;&#x6784;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5C06;&#x5C3D;&#x5FEB;&#x89E3;&#x51B3;&#x56E2;&#x961F;&#x51C6;&#x5907;&#x60C5;&#x51B5;&#xFF0C;&#x4F46;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x786E;&#x5B9A;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7CFB;&#x7EDF;&#x4F55;&#x65F6;&#x51C6;&#x5907;&#x597D;&#x7528;&#x4E8E;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;</p>
<h2 id="&#x7CFB;&#x7EDF;">&#x7CFB;&#x7EDF;</h2>
<p>&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x7CFB;&#x7EDF;&#x62BD;&#x8C61;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x5E94;&#x8BE5;&#x5173;&#x6CE8;&#x5355;&#x4E2A;&#x786C;&#x7F16;&#x7801;&#x4E3B;&#x673A;&#x540D;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65E0;&#x6CD5;&#x5728;&#x4E2A;&#x522B;&#x4E3B;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x5C1A;&#x672A;&#x51C6;&#x5907;&#x597D;&#x4F7F;&#x7528;&#x4E8E;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x5355;&#x4E2A;&#x670D;&#x52A1;&#x5668;(&#x865A;&#x62DF;&#x6216;&#x7269;&#x7406;)&#x8FD0;&#x884C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x4E3A;&#x8BBF;&#x95EE;&#x8D44;&#x6E90;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x8BF4;&#x7684;&#x201C;&#x62BD;&#x8C61;&#x201D;&#x3002;&#x5355;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E0D;&#x5E94;&#x8BE5;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90E8;&#x7F72;&#x7684;&#x76EE;&#x6807;&#x3002;&#x8D44;&#x6E90;(CPU&#x3001;RAM&#x548C;&#x78C1;&#x76D8;)&#x5E94;&#x8BE5;&#x96C6;&#x4E2D;&#x5728;&#x6240;&#x6709;&#x53EF;&#x7528;&#x7684;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x7136;&#x540E;&#x7531;&#x5E73;&#x53F0;&#x6839;&#x636E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x8BF7;&#x6C42;&#x8FDB;&#x884C;&#x5206;&#x914D;&#x3002;</p>
<p>&#x5728;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E2D;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x9690;&#x85CF;&#x5E95;&#x5C42;&#x7CFB;&#x7EDF;&#x4EE5;&#x63D0;&#x9AD8;&#x53EF;&#x9760;&#x6027;&#x3002;&#x4E91;&#x8BA1;&#x7B97;&#x57FA;&#x7840;&#x8BBE;&#x65BD;(&#x5982;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;)&#x4F1A;&#x9884;&#x671F;&#x7684;&#x53D1;&#x751F;&#x57FA;&#x7840;&#x7EC4;&#x4EF6;&#x6545;&#x969C;&#xFF0C;&#x5E76;&#x4E14;&#x65E8;&#x5728;&#x4F18;&#x96C5;&#x5730;&#x5904;&#x7406;&#x6B64;&#x7C7B;&#x6545;&#x969C;&#x3002;&#x8FD9;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5DE5;&#x7A0B;&#x5E08;&#x4E0D;&#x518D;&#x63A7;&#x5236;&#x5806;&#x6808;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x3002;</p>
<blockquote>
<p><strong>Kubernetes&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;</strong></p>
<p>Kubernetes&#x662F;&#x4E00;&#x4E2A;&#x6846;&#x67B6;&#xFF0C;&#x5B83;&#x4F7F;&#x7BA1;&#x7406;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53D8;&#x5F97;&#x66F4;&#x5BB9;&#x6613;&#xFF0C;&#x5E76;&#x4E14;&#x4EE5;&#x4E00;&#x79CD;&#x4E91;&#x7684;&#x65B9;&#x5F0F;&#x4FC3;&#x8FDB;&#x4E86;&#x8FD9;&#x6837;&#x505A;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x79CD;&#x975E;&#x4E91;&#x539F;&#x751F;&#x7684;&#x65B9;&#x5F0F;&#x4F7F;&#x7528;Kubernetes&#x3002;</p>
<p>Kubernetes&#x516C;&#x5F00;&#x4E86;&#x57FA;&#x4E8E;&#x5176;&#x6838;&#x5FC3;&#x529F;&#x80FD;&#x7684;&#x6269;&#x5C55;&#xFF0C;&#x4F46;&#x8FD9;&#x4E0D;&#x662F;&#x4F60;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x6700;&#x7EC8;&#x76EE;&#x6807;&#x3002;&#x5176;&#x4ED6;&#x9879;&#x76EE;(&#x4F8B;&#x5982;&#xFF0C;OpenShift)&#x5EFA;&#x7ACB;&#x5728;&#x5B83;&#x4E4B;&#x4E0A;&#xFF0C;&#x5C06;Kubernetes&#x4ECE;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x62BD;&#x8C61;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x5E73;&#x53F0;&#x662F;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E94;&#x8BE5;&#x8FD0;&#x884C;&#x7684;&#x5730;&#x65B9;&#x3002;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x652F;&#x6301;&#x5B83;&#x4EEC;&#xFF0C;&#x4F46;&#x4E5F;&#x9F13;&#x52B1;&#x4E86;&#x8FD0;&#x884C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F;&#x52A8;&#x6001;&#x7684;&#xFF0C;&#x4F46;&#x4F60;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x662F;&#x9759;&#x6001;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5F88;&#x5FEB;&#x5C31;&#x4F1A;&#x9677;&#x5165;&#x5355;&#x9760;Kubernetes&#x65E0;&#x6CD5;&#x89E3;&#x51B3;&#x7684;&#x50F5;&#x5C40;&#x3002;</p>
</blockquote>
<p>&#x5F53;&#x5B83;&#x4E0D;&#x518D;&#x662F;&#x4E00;&#x4E2A;&#x6311;&#x6218;&#x65F6;&#xFF0C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5DF2;&#x7ECF;&#x51C6;&#x5907;&#x597D;&#x6210;&#x4E3A;&#x4E91;&#x539F;&#x751F;&#x7684;&#x4E86;&#x3002;&#x4E00;&#x65E6;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x53D8;&#x5F97;&#x7B80;&#x5355;&#xFF0C;&#x81EA;&#x52A8;&#x5316;&#x3001;&#x81EA;&#x52A9;&#x670D;&#x52A1;&#x548C;&#x52A8;&#x6001;&#xFF0C;&#x5B83;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x88AB;&#x5FFD;&#x7565;&#x3002;&#x5F53;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x88AB;&#x5FFD;&#x7565;&#xFF0C;&#x5E76;&#x4E14;&#x6280;&#x672F;&#x53D8;&#x5F97;&#x5355;&#x8C03;&#x65F6;&#xFF0C;&#x662F;&#x65F6;&#x5019;&#x5411;&#x4E0A;&#x79FB;&#x52A8;&#x5806;&#x6808;&#x4E86;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x4F9D;&#x8D56;&#x4E8E;&#x786C;&#x4EF6;&#x5B9A;&#x5236;&#x6216;&#x5728;&#x201C;&#x6DF7;&#x5408;&#x4E91;&#x201D;&#x4E2D;&#x8FD0;&#x884C;&#xFF0C;&#x5219;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x53EF;&#x80FD;&#x8FD8;&#x6CA1;&#x6709;&#x51C6;&#x5907;&#x597D;&#x3002;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x7BA1;&#x7406;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF0C;&#x5E76;&#x4E14;&#x79C1;&#x6709;&#x5316;&#x3002;&#x4F60;&#x9700;&#x8981;&#x4FDD;&#x6301;&#x8B66;&#x60D5;&#xFF0C;&#x5C06;&#x5EFA;&#x7ACB;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x8D23;&#x4EFB;&#x4E0E;&#x7BA1;&#x7406;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x8D23;&#x4EFB;&#x5206;&#x5F00;&#x3002;</p>
<p>&#x8C37;&#x6B4C;&#x3001;Facebook&#x3001;&#x4E9A;&#x9A6C;&#x900A;&#x548C;&#x5FAE;&#x8F6F;&#x90FD;&#x53D1;&#x73B0;&#x901A;&#x8FC7;&#x5F00;&#x653E;&#x7684;&#x8BA1;&#x7B97;&#x9879;&#x76EE;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x521B;&#x5EFA;&#x786C;&#x4EF6;&#x662F;&#x6709;&#x597D;&#x5904;&#x7684;&#x3002;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x786C;&#x4EF6;&#x6709;&#x6027;&#x80FD;&#x548C;&#x6210;&#x672C;&#x7684;&#x9650;&#x5236;&#x3002;&#x56E0;&#x4E3A;&#x786C;&#x4EF6;&#x8BBE;&#x8BA1;&#x548C;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x6784;&#x5EFA;&#x8005;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x660E;&#x786E;&#x7684;&#x8D23;&#x4EFB;&#x5206;&#x79BB;&#xFF0C;&#x8FD9;&#x4E9B;&#x516C;&#x53F8;&#x80FD;&#x591F;&#x5728;&#x521B;&#x5EFA;&#x5B9A;&#x5236;&#x786C;&#x4EF6;&#x7684;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;&#x5B83;&#x4EEC;&#x4E0D;&#x4F1A;&#x53D7;&#x5230;&#x201C;&#x5185;&#x90E8;&#x90E8;&#x7F72;&#x201D;&#x7684;&#x963B;&#x788D;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x5171;&#x540C;&#x4F18;&#x5316;&#x5176;&#x786C;&#x4EF6;&#x548C;&#x8F6F;&#x4EF6;&#xFF0C;&#x4EE5;&#x83B7;&#x5F97;&#x66F4;&#x9AD8;&#x7684;&#x6548;&#x7387;&#x548C;&#x6027;&#x80FD;&#x3002;</p>
<p>&#x7BA1;&#x7406;&#x81EA;&#x5DF1;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x9700;&#x8981;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x548C;&#x91D1;&#x94B1;&#x7684;&#x6295;&#x5165;&#x3002;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x79C1;&#x6709;&#x4E91;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;&#x4E24;&#x8005;&#x90FD;&#x9700;&#x8981;&#x5EFA;&#x7ACB;&#x548C;&#x7BA1;&#x7406;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x56E2;&#x961F;&#x3001;&#x521B;&#x5EFA;&#x548C;&#x7EF4;&#x62A4;API&#x7684;&#x56E2;&#x961F;&#x4EE5;&#x53CA;&#x5728;IaaS API&#x4E4B;&#x4E0A;&#x521B;&#x5EFA;&#x62BD;&#x8C61;&#x7684;&#x56E2;&#x961F;&#x3002;</p>
<p>&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x90FD;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#xFF0C;&#x5E76;&#x4E14;&#x51B3;&#x5B9A;&#x7BA1;&#x7406;&#x6574;&#x4E2A;&#x5806;&#x6808;&#x662F;&#x5426;&#x6709;&#x4EF7;&#x503C;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x7684;&#x4E1A;&#x52A1;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x770B;&#x5176;&#x4ED6;&#x4E1A;&#x52A1;&#x9886;&#x57DF;&#x9700;&#x8981;&#x51C6;&#x5907;&#x4EC0;&#x4E48;&#x6765;&#x8F6C;&#x79FB;&#x5230;&#x4E91;&#x539F;&#x751F;&#x5B9E;&#x8DF5;&#x3002;</p>
<h2 id="&#x5546;&#x4E1A;">&#x5546;&#x4E1A;</h2>
<blockquote>
<p>&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x548C;&#x7EC4;&#x7EC7;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x5219;&#x7EC4;&#x7EC7;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x4F1A;&#x80DC;&#x51FA;&#x3002;</p>
<p>&#x2014;&#x2014;&#x9C81;&#x65AF;&#x9A6C;&#x5170;&#xFF0C;&#x201C;&#x5EB7;&#x5A01;&#x5B9A;&#x5F8B;&#x201D;</p>
</blockquote>
<p>&#x4F01;&#x4E1A;&#x53D8;&#x9769;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x7F13;&#x6162;&#x3002;&#x5F53;&#x901A;&#x8FC7;&#x6269;&#x5C55;&#x4EBA;&#x5458;&#x6765;&#x7BA1;&#x7406;&#x6269;&#x5C55;&#x7CFB;&#x7EDF;&#x4E0D;&#x518D;&#x6709;&#x6548;&#x65F6;&#xFF0C;&#x4EE5;&#x53CA;&#x4EA7;&#x54C1;&#x5F00;&#x53D1;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7075;&#x6D3B;&#x6027;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x51C6;&#x5907;&#x597D;&#x91C7;&#x7528;&#x4E91;&#x539F;&#x751F;&#x5B9E;&#x8DF5;&#x4E86;&#x3002;</p>
<p>&#x4EBA;&#x65E0;&#x6CD5;&#x65E0;&#x9650;&#x6269;&#x5C55;&#x3002;&#x5BF9;&#x4E8E;&#x589E;&#x52A0;&#x7BA1;&#x7406;&#x66F4;&#x591A;&#x670D;&#x52A1;&#x5668;&#x6216;&#x5F00;&#x53D1;&#x66F4;&#x591A;&#x4EE3;&#x7801;&#x7684;&#x6BCF;&#x4E2A;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x652F;&#x6301;&#x4ED6;&#x4EEC;&#x7684;&#x4EBA;&#x529B;&#x57FA;&#x7840;&#x8BBE;&#x65BD;(&#x4F8B;&#x5982;&#x529E;&#x516C;&#x5BA4;&#x7A7A;&#x95F4;)&#x90FD;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x538B;&#x529B;&#x3002;&#x56E0;&#x4E3A;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x6C9F;&#x901A;&#x548C;&#x534F;&#x8C03;&#xFF0C;&#x5176;&#x4ED6;&#x4EBA;&#x4E5F;&#x4F1A;&#x6709;&#x989D;&#x5916;&#x7684;&#x5F00;&#x9500;&#x3002;</p>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x7B2C;1&#x7AE0;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x516C;&#x6709;&#x4E91;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x79DF;&#x7528;&#x670D;&#x52A1;&#x5668;&#x6765;&#x51CF;&#x5C11;&#x4E00;&#x4E9B;&#x6D41;&#x7A0B;&#x548C;&#x4EBA;&#x5458;&#x5F00;&#x9500;&#x3002;&#x5373;&#x4F7F;&#x4F7F;&#x7528;&#x516C;&#x6709;&#x4E91;&#xFF0C;&#x4F60;&#x4ECD;&#x7136;&#x4F1A;&#x9700;&#x8981;&#x7BA1;&#x7406;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x7684;&#x4EBA;&#x5458;(&#x4F8B;&#x5982;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x670D;&#x52A1;&#x548C;&#x7528;&#x6237;&#x5E10;&#x6237;)&#x3002;</p>
<p>&#x5F53;&#x901A;&#x4FE1;&#x7ED3;&#x6784;&#x53CD;&#x6620;&#x4E1A;&#x52A1;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x4E1A;&#x52A1;&#x5DF2;&#x51C6;&#x5907;&#x597D;&#x91C7;&#x7528;&#x4E91;&#x539F;&#x751F;&#x5B9E;&#x8DF5;&#x3002;&#x8FD9;&#x5305;&#x62EC;&#x53CD;&#x6620;&#x50CF;&#x5FAE;&#x670D;&#x52A1;&#x8FD9;&#x6837;&#x7684;&#x4F53;&#x7CFB;&#x67B6;&#x6784;&#x7684;&#x901A;&#x4FE1;&#x7ED3;&#x6784;&#x3002;&#x4ED6;&#x4EEC;&#x53EF;&#x80FD;&#x662F;&#x5C0F;&#x578B;&#x7684;&#x72EC;&#x7ACB;&#x56E2;&#x961F;&#xFF0C;&#x65E0;&#x9700;&#x901A;&#x8FC7;&#x5C42;&#x5C42;&#x7BA1;&#x7406;&#x4E0E;&#x5176;&#x4ED6;&#x56E2;&#x961F;&#x4EA4;&#x6D41;&#x6216;&#x5408;&#x4F5C;&#x3002;</p>
<blockquote>
<p><strong>DevOps&#x548C;Cloud Native</strong></p>
<p>DevOps&#x53EF;&#x4EE5;&#x8865;&#x5145;&#x56E2;&#x961F;&#x5408;&#x4F5C;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5E76;&#x5F71;&#x54CD;&#x4F7F;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x7C7B;&#x578B;&#x3002;&#x5B83;&#x5BF9;&#x91C7;&#x7528;&#x5B83;&#x7684;&#x516C;&#x53F8;&#x6709;&#x5F88;&#x591A;&#x597D;&#x5904;&#xFF0C;&#x5305;&#x62EC;&#x5FEB;&#x901F;&#x539F;&#x578B;&#x5316;&#x548C;&#x63D0;&#x9AD8;&#x90E8;&#x7F72;&#x901F;&#x5EA6;&#x3002;&#x5B83;&#x4E5F;&#x975E;&#x5E38;&#x6CE8;&#x91CD;&#x7EC4;&#x7EC7;&#x7684;&#x6587;&#x5316;&#x3002;</p>
<p>&#x4E91;&#x539F;&#x751F;&#x9700;&#x8981;&#x9AD8;&#x6027;&#x80FD;&#x7EC4;&#x7EC7;&#xFF0C;&#x4F46;&#x66F4;&#x6CE8;&#x91CD;&#x4E8E;&#x8BBE;&#x8BA1;&#xFF0C;&#x67B6;&#x6784;&#x548C;&#x5065;&#x5EB7;&#x5EA6;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x56E2;&#x961F;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x548C;&#x6587;&#x5316;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8BA4;&#x4E3A;&#x53EF;&#x4EE5;&#x6210;&#x529F;&#x7684;&#x5B9E;&#x73B0;&#x4E91;&#x539F;&#x751F;&#x6A21;&#x5F0F;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x89E3;&#x51B3;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x3001;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8FD0;&#x8425;&#x5546;&#x4EE5;&#x53CA;&#x6280;&#x672F;&#x90E8;&#x95E8;&#x4E2D;&#x4EFB;&#x4F55;&#x4EBA;&#x5458;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x611F;&#x5230;&#x610F;&#x5916;&#x3002;</p>
</blockquote>
<p>&#x8FEB;&#x4F7F;&#x4E1A;&#x52A1;&#x53D8;&#x5316;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x9650;&#x5236;&#x56E0;&#x7D20;&#x662F;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x654F;&#x6377;&#x6027;&#x3002;&#x4F01;&#x4E1A;&#x4E0D;&#x4EC5;&#x9700;&#x8981;&#x5FEB;&#x901F;&#x90E8;&#x7F72;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x5F7B;&#x5E95;&#x6539;&#x53D8;&#x90E8;&#x7F72;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x90E8;&#x7F72;&#x7684;&#x539F;&#x59CB;&#x6570;&#x91CF;&#x65E0;&#x5173;&#x7D27;&#x8981;&#x3002;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x5FEB;&#x5730;&#x63D0;&#x4F9B;&#x5BA2;&#x6237;&#x4EF7;&#x503C;&#x3002;&#x76F8;&#x4FE1;&#x90E8;&#x7F72;&#x7684;&#x8F6F;&#x4EF6;&#x5C06;&#x7B2C;&#x4E00;&#x6B21;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x7B2C;100&#x6B21;&#xFF0C;&#x6EE1;&#x8DB3;&#x6240;&#x6709;&#x5BA2;&#x6237;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x8C2C;&#x8BBA;&#x3002;</p>
<p>&#x5F53;&#x4E1A;&#x52A1;&#x610F;&#x8BC6;&#x5230;&#x9700;&#x8981;&#x9891;&#x7E41;&#x8FED;&#x4EE3;&#x548C;&#x66F4;&#x6539;&#x65F6;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x51C6;&#x5907;&#x597D;&#x91C7;&#x7528;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E86;&#x3002;&#x53EA;&#x8981;&#x5B83;&#x5728;&#x4EBA;&#x5458;&#x6548;&#x7387;&#x548C;&#x65E7;&#x6D41;&#x7A0B;&#x9650;&#x5236;&#x65B9;&#x9762;&#x9047;&#x5230;&#x9650;&#x5236;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x66F4;&#x6539;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4E3A;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x505A;&#x597D;&#x51C6;&#x5907;&#x3002;</p>
<p>&#x6240;&#x6709;&#x90A3;&#x4E9B;&#x8868;&#x660E;&#x4F55;&#x65F6;&#x91C7;&#x7528;&#x4E91;&#x539F;&#x751F;&#x7684;&#x56E0;&#x7D20;&#x90FD;&#x4E0D;&#x80FD;&#x8BF4;&#x660E;&#x5168;&#x90E8;&#x60C5;&#x51B5;&#x3002;&#x4EFB;&#x4F55;&#x8BBE;&#x8BA1;&#x90FD;&#x9700;&#x8981;&#x6743;&#x8861;&#x6298;&#x8877;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E0D;&#x662F;&#x6B63;&#x786E;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<h2 id="&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x4E0D;&#x9700;&#x8981;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;">&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x4E0D;&#x9700;&#x8981;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;</h2>
<p>&#x53EA;&#x6709;&#x77E5;&#x9053;&#x9650;&#x5236;&#x65F6;&#xFF0C;&#x7406;&#x89E3;&#x7CFB;&#x7EDF;&#x7684;&#x597D;&#x5904;&#x624D;&#x662F;&#x91CD;&#x8981;&#x7684;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x77E5;&#x9053;&#x54EA;&#x4E9B;&#x9650;&#x5236;&#x53EF;&#x4EE5;&#x6EE1;&#x8DB3;&#x60A8;&#x7684;&#x9700;&#x6C42;&#x901A;&#x5E38;&#x53EF;&#x80FD;&#x66F4;&#x591A;&#x662F;&#x51B3;&#x5B9A;&#x6027;&#x56E0;&#x7D20;&#x800C;&#x975E;&#x5229;&#x76CA;&#x3002;</p>
<p>&#x8BB0;&#x4F4F;&#x9700;&#x6C42;&#x968F;&#x65F6;&#x95F4;&#x53D8;&#x5316;&#x4E5F;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x73B0;&#x5728;&#x5173;&#x952E;&#x7684;&#x529F;&#x80FD;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x5728;&#x672A;&#x6765;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x4EE5;&#x4E0B;&#x60C5;&#x51B5;&#x73B0;&#x5728;&#x4E0D;&#x4F1A;&#x4F7F;&#x8FD9;&#x79CD;&#x8BBE;&#x65BD;&#x53D8;&#x5F97;&#x7406;&#x60F3;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x8BB8;&#x591A;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x91C7;&#x7528;&#x5B83;&#x4EEC;&#x3002;</p>
<h3 id="&#x6280;&#x672F;&#x9650;&#x5236;">&#x6280;&#x672F;&#x9650;&#x5236;</h3>
<p>&#x5C31;&#x50CF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E00;&#x6837;&#xFF0C;&#x5728;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x4E2D;&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x9879;&#x76EE;&#x662F;&#x6280;&#x672F;&#x6027;&#x7684;&#x3002;&#x5982;&#x679C;&#x60A8;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x91C7;&#x7528;&#x57FA;&#x4E8E;&#x6280;&#x672F;&#x4F18;&#x52BF;&#x7684;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#xFF0C;&#x4EE5;&#x627E;&#x51FA;&#x4F55;&#x65F6;&#x4E0D;&#x5E94;&#x8BE5;&#x91C7;&#x7528;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x4E2A;&#x9650;&#x5236;&#x662F;&#x6CA1;&#x6709;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x6B63;&#x5982;&#x5728;&#x8BA8;&#x8BBA;&#x4E2D;</p>
<p>&#x7B2C;1&#x7AE0;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x4EBA;&#x5DE5;&#x4EA4;&#x4E92;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x8C03;&#x5EA6;&#xFF0C;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x8FD8;&#x662F;&#x641C;&#x7D22;&#x65E5;&#x5FD7;&#xFF0C;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x90FD;&#x6CA1;&#x6709;&#x591A;&#x5927;&#x597D;&#x5904;&#x3002;</p>
<p>&#x5373;&#x4F7F;&#x6709;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x52A8;&#x6001;&#x8C03;&#x5EA6;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x4F7F;&#x5176;&#x6210;&#x4E3A;&#x672C;&#x5730;&#x4E91;&#x3002;&#x5982;&#x679C;&#x60A8;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;Kubernetes&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x4F46;&#x4ECD;&#x9700;&#x8981;&#x4EBA;&#x5458;&#x8BBE;&#x7F6E;&#x76D1;&#x63A7;&#xFF0C;&#x65E5;&#x5FD7;&#x6536;&#x96C6;&#x6216;&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x5668;&#xFF0C;&#x5219;&#x5B83;&#x4E0D;&#x662F;&#x4E91;&#x539F;&#x751F;&#x3002;&#x53EA;&#x56E0;&#x4E3A;&#x4F60;&#x6709;Kubernetes&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x4F60;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x7BA1;&#x5F26;&#x4E50;&#x961F;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x770B;&#x770B;&#x5B83;&#x662F;&#x5982;&#x4F55;&#x8FD0;&#x884C;&#x7684;&#x3002;&#x60A8;&#x662F;&#x5426;&#x9700;&#x8981;&#x4E0B;&#x8BA2;&#x5355;&#xFF0C;&#x521B;&#x5EFA;&#x7968;&#x636E;&#x6216;&#x53D1;&#x9001;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x4EE5;&#x83B7;&#x53D6;&#x670D;&#x52A1;&#x5668;&#xFF1F;</p>
<p>&#x8FD9;&#x4E9B;&#x662F;&#x60A8;&#x6CA1;&#x6709;&#x81EA;&#x52A9;&#x670D;&#x52A1;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7684;&#x6307;&#x6807;&#xFF0C;&#x8FD9;&#x662F;&#x4E91;&#x8BA1;&#x7B97;&#x7684;&#x4E00;&#x9879;&#x8981;&#x6C42;&#x3002;</p>
<p>&#x5728;&#x4E91;&#x4E2D;&#xFF0C;&#x60A8;&#x53EA;&#x9700;&#x63D0;&#x4F9B;&#x5E10;&#x5355;&#x4FE1;&#x606F;&#x5E76;&#x8C03;&#x7528;API&#x3002;&#x5373;&#x4F7F;&#x60A8;&#x5728;&#x5185;&#x90E8;&#x8FD0;&#x884C;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x60A8;&#x4E5F;&#x5E94;&#x8BE5;&#x6709;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x6784;&#x5EFA;IaaS&#x7684;&#x56E2;&#x961F;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5206;&#x5C42;&#x5E03;&#x5C40;&#x3002;</p>
<p>&#x5982;&#x679C;&#x60A8;&#x8981;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x4E2D;&#x6784;&#x5EFA;&#x4E91;&#x73AF;&#x5883;&#xFF0C;&#x56FE;2-1&#x663E;&#x793A;&#x4E86;&#x60A8;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7EC4;&#x4EF6;&#x9002;&#x5408;&#x7684;&#x793A;&#x4F8B;&#x3002;&#x6240;&#x6709;&#x539F;&#x59CB;&#x7EC4;&#x4EF6;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x5B58;&#x50A8;&#xFF0C;&#x7F51;&#x7EDC;&#xFF09;&#x90FD;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x4ECE;&#x81EA;&#x52A9;&#x5F0F;IaaS API&#x4E2D;&#x83B7;&#x5F97;&#x3002;</p>
<p><img src="../images/f-2-1.jpg" alt="F-2-1"></p>
<p>&#x56FE;2-1. &#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x793A;&#x4F8B;&#x56FE;&#x5C42;</p>
<p>&#x5728;&#x516C;&#x5171;&#x4E91;&#x4E2D;&#xFF0C;&#x60A8;&#x62E5;&#x6709;IaaS&#x548C;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x60A8;&#x7684;&#x4E1A;&#x52A1;&#x5DF2;&#x51C6;&#x5907;&#x597D;&#x8FCE;&#x63A5;&#x516C;&#x6709;&#x4E91;&#x7684;&#x542F;&#x7528;&#x3002;</p>
<p>&#x5F53;&#x60A8;&#x6784;&#x5EFA;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5E73;&#x53F0;&#x65F6;&#xFF0C;&#x4E86;&#x89E3;&#x60A8;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x6700;&#x521D;&#x7684;&#x5F00;&#x53D1;&#x53EA;&#x662F;&#x6784;&#x5EFA;&#x548C;&#x7EF4;&#x62A4;&#x5E73;&#x53F0;&#x6240;&#x9700;&#x82B1;&#x8D39;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5BF9;&#x4E1A;&#x52A1;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x5E73;&#x53F0;&#x3002;</p>
<p>&#x7EF4;&#x62A4;&#x901A;&#x5E38;&#x4F1A;&#x6D88;&#x8017;&#x5927;&#x7EA6;40&#xFF05;&#x5230;80&#xFF05;&#xFF08;&#x5E73;&#x5747;60&#xFF05;&#xFF09;&#x7684;&#x8F6F;&#x4EF6;&#x6210;&#x672C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x9636;&#x6BB5;</p>
<p>&#x53D1;&#x73B0;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x548C;&#x5EFA;&#x7ACB;&#x5F00;&#x53D1;&#x6240;&#x9700;&#x7684;&#x6280;&#x80FD;&#x53EF;&#x80FD;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x5C0F;&#x56E2;&#x961F;&#x6765;&#x8BF4;&#x592A;&#x8FC7;&#x5206;&#x4E86;&#x3002;&#x4E00;&#x65E6;&#x4F60;&#x638C;&#x63E1;&#x4E86;&#x5F00;&#x53D1;&#x6240;&#x9700;&#x5E73;&#x53F0;&#x7684;&#x6280;&#x80FD;&#xFF0C;&#x4F60;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x6295;&#x5165;&#x65F6;&#x95F4;&#x6765;&#x6539;&#x8FDB;&#x548C;&#x7EF4;&#x62A4;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x9700;&#x8981;&#x6BD4;&#x521D;&#x59CB;&#x5F00;&#x53D1;&#x66F4;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x4E3A;&#x4F01;&#x4E1A;&#x63D0;&#x4F9B;&#x7EDD;&#x5BF9;&#x6700;&#x4F73;&#x7684;&#x73AF;&#x5883;&#x662F;&#x516C;&#x5171;&#x4E91;&#x63D0;&#x4F9B;&#x5546;&#x7684;&#x4EA7;&#x54C1;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x80FD;&#x6216;&#x8005;&#x4E0D;&#x613F;&#x610F;&#x8BA9;&#x4F60;&#x7684;&#x5E73;&#x53F0;&#x6210;&#x4E3A;&#x4F60;&#x7684;&#x4E1A;&#x52A1;&#x7684;&#x4E00;&#x4E2A;&#x533A;&#x522B;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x4E0D;&#x5E94;&#x8BE5;&#x81EA;&#x5DF1;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5E73;&#x53F0;&#x3002;</p>
<p>&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x4F60;&#x4E0D;&#x5FC5;&#x81EA;&#x5DF1;&#x6784;&#x5EFA;&#x4E00;&#x5207;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x53EF;&#x4EE5;&#x7EC4;&#x88C5;&#x5230;&#x6240;&#x9700;&#x5E73;&#x53F0;&#x7684;&#x670D;&#x52A1;&#x6216;&#x4EA7;&#x54C1;&#x3002;</p>
<p>&#x53EF;&#x9760;&#x6027;&#x4ECD;&#x7136;&#x662F;&#x60A8;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7684;&#x5173;&#x952E;&#x7279;&#x6027;&#x3002;&#x5982;&#x679C;&#x60A8;&#x8FD8;&#x6CA1;&#x6709;&#x51C6;&#x5907;&#x597D;&#x653E;&#x5F03;&#x5BF9;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5806;&#x6808;&#x7684;&#x66F4;&#x4F4E;&#x7EA7;&#x522B;&#x7684;&#x63A7;&#x5236;&#xFF0C;&#x5E76;&#x4E14;&#x4ECD;&#x7136;&#x901A;&#x8FC7;&#x63A5;&#x53D7;&#x6545;&#x969C;&#x6765;&#x5236;&#x9020;&#x53EF;&#x9760;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x90A3;&#x4E48;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5E76;&#x4E0D;&#x662F;&#x6B63;&#x786E;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x8D85;&#x51FA;&#x4F60;&#x7684;&#x63A7;&#x5236;&#x7684;&#x9650;&#x5236;&#x3002;&#x975E;&#x6280;&#x672F;&#x9650;&#x5236;&#x540C;&#x6837;&#x91CD;&#x8981;&#xFF0C;&#x96BE;&#x4EE5;&#x89E3;&#x51B3;&#x3002;</p>
<h3 id="&#x4E1A;&#x52A1;&#x9650;&#x5236;">&#x4E1A;&#x52A1;&#x9650;&#x5236;</h3>
<p>&#x5982;&#x679C;&#x73B0;&#x6709;&#x6D41;&#x7A0B;&#x4E0D;&#x652F;&#x6301;&#x66F4;&#x6539;&#x57FA;&#x7840;&#x67B6;&#x6784;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x9996;&#x5148;&#x514B;&#x670D;&#x8BE5;&#x969C;&#x788D;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x4F60;&#x4E0D;&#x5FC5;&#x4E00;&#x4E2A;&#x4EBA;&#x505A;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x5E0C;&#x671B;&#x6709;&#x52A9;&#x4E8E;&#x5411;&#x9700;&#x8981;&#x8BF4;&#x670D;&#x529B;&#x7684;&#x4EBA;&#x6E05;&#x695A;&#x5730;&#x89E3;&#x91CA;&#x597D;&#x5904;&#x548C;&#x6D41;&#x7A0B;&#x3002;&#x8FD8;&#x6709;&#x8BB8;&#x591A;&#x6848;&#x4F8B;&#x7814;&#x7A76;&#x548C;&#x516C;&#x53F8;&#x5206;&#x4EAB;&#x4ED6;&#x4EEC;&#x91C7;&#x7528;&#x8FD9;&#x4E9B;&#x505A;&#x6CD5;&#x7684;&#x7ECF;&#x9A8C;&#x3002;&#x672C;&#x4E66;&#x9644;&#x5F55;C&#x4E2D;&#x5C06;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x6848;&#x4F8B;&#x7814;&#x7A76;&#xFF0C;&#x4F46;&#x662F;&#x60A8;&#x53EF;&#x4EE5;&#x4E3A;&#x60A8;&#x7684;&#x4F01;&#x4E1A;&#x627E;&#x5230;&#x76F8;&#x5173;&#x793A;&#x4F8B;&#x5E76;&#x4E0E;&#x540C;&#x884C;&#x548C;&#x7BA1;&#x7406;&#x5C42;&#x5206;&#x4EAB;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F01;&#x4E1A;&#x8FD8;&#x6CA1;&#x6709;&#x5B9E;&#x9A8C;&#x7684;&#x9014;&#x5F84;&#x548C;&#x652F;&#x6301;&#x5C1D;&#x8BD5;&#x65B0;&#x4E8B;&#x7269;&#x7684;&#x6587;&#x5316;&#xFF08;&#x4EE5;&#x53CA;&#x4F34;&#x968F;&#x5931;&#x8D25;&#x800C;&#x6765;&#x7684;&#x540E;&#x679C;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x6539;&#x53D8;&#x6D41;&#x7A0B;&#x53EF;&#x80FD;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x7684;&#x9009;&#x62E9;&#x662F;&#x8FBE;&#x5230;&#x5FC5;&#x987B;&#x6539;&#x53D8;&#x4E8B;&#x7269;&#x7684;&#x4E34;&#x754C;&#x70B9;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x670D;&#x7BA1;&#x7406;&#x5C42;&#x8BA4;&#x4E3A;&#x6539;&#x53D8;&#x662F;&#x5FC5;&#x8981;&#x7684;&#x3002;</p>
<p>&#x4ECE;&#x5916;&#x90E8;&#x770B;&#xFF0C;&#x4F01;&#x4E1A;&#x662F;&#x5426;&#x51C6;&#x5907;&#x91C7;&#x7528;&#x4E91;&#x539F;&#x751F;&#x8BBE;&#x65BD;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x4E00;&#x4E9B;&#x660E;&#x786E;&#x6307;&#x51FA;&#x516C;&#x53F8;&#x672A;&#x51C6;&#x5907;&#x597D;&#x5305;&#x62EC;&#x7684;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<ul>
<li>&#x9700;&#x8981;&#x4EBA;&#x5DE5;&#x5E72;&#x9884;&#x7684;&#x8D44;&#x6E90;&#x8BF7;&#x6C42;</li>
<li>&#x5B9A;&#x671F;&#x5B89;&#x6392;&#x9700;&#x8981;&#x4EBA;&#x5DE5;&#x64CD;&#x4F5C;&#x7684;&#x7EF4;&#x62A4;&#x7A97;&#x53E3;</li>
<li>&#x624B;&#x52A8;&#x5E93;&#x5B58;&#x8DDF;&#x8E2A;&#x548C;&#x8D44;&#x6E90;&#x5206;&#x914D;</li>
<li>&#x7535;&#x5B50;&#x8868;&#x683C;&#x6E05;&#x5355;</li>
</ul>
<p>&#x5982;&#x679C;&#x9664;&#x4E86;&#x8D1F;&#x8D23;&#x670D;&#x52A1;&#x7684;&#x56E2;&#x961F;&#x4EE5;&#x5916;&#x7684;&#x5176;&#x4ED6;&#x4EBA;&#x5458;&#x53C2;&#x4E0E;&#x8FDB;&#x7A0B;&#x4EE5;&#x8C03;&#x5EA6;&#xFF0C;&#x90E8;&#x7F72;&#xFF0C;&#x5347;&#x7EA7;&#x6216;&#x76D1;&#x89C6;&#x670D;&#x52A1;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5728;&#x8FC1;&#x79FB;&#x5230;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E4B;&#x524D;&#x6216;&#x8FC1;&#x79FB;&#x671F;&#x95F4;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x6D41;&#x7A0B;&#x3002;</p>
<p>&#x6709;&#x65F6;&#x4E5F;&#x6709;&#x4E1A;&#x52A1;&#x65E0;&#x6CD5;&#x63A7;&#x5236;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F8B;&#x5982;&#x884C;&#x4E1A;&#x6CD5;&#x89C4;&#x3002;&#x53EF;&#x60B2;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x53D8;&#x5316;&#x751A;&#x81F3;&#x6BD4;&#x5185;&#x90E8;&#x6D41;&#x7A0B;&#x66F4;&#x96BE;&#x548C;&#x66F4;&#x6162;&#x3002;</p>
<p>&#x5982;&#x679C;&#x884C;&#x4E1A;&#x6CD5;&#x89C4;&#x9650;&#x5236;&#x4E86;&#x53D1;&#x5C55;&#x7684;&#x901F;&#x5EA6;&#x6216;&#x654F;&#x6377;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5EFA;&#x8BAE;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x80FD;&#x505A;&#x5230;&#x3002;&#x5982;&#x679C;&#x6CD5;&#x89C4;&#x4E0D;&#x5141;&#x8BB8;&#x5728;&#x516C;&#x5171;&#x4E91;&#x4E2D;&#x8FD0;&#x884C;&#xFF0C;&#x8BF7;&#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x6280;&#x672F;&#x6765;&#x8FD0;&#x884C;&#x5185;&#x90E8;&#x90E8;&#x7F72;&#x3002;&#x7BA1;&#x7406;&#x5C42;&#x5C06;&#x9700;&#x8981;&#x4E3A;&#x4EFB;&#x4F55;&#x7BA1;&#x7406;&#x673A;&#x6784;&#x5236;&#x5B9A;&#x7684;&#x6CD5;&#x89C4;&#x5236;&#x5B9A;&#x4E00;&#x4E2A;&#x6848;&#x4F8B;&#x3002;</p>
<p>&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x975E;&#x6280;&#x672F;&#x969C;&#x788D;&#x3002;&#x5728;&#x4E00;&#x4E9B;&#x516C;&#x53F8;&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x79CD;&#x4E0D;&#x4F7F;&#x7528;&#x7B2C;&#x4E09;&#x65B9;&#x670D;&#x52A1;&#x7684;&#x6587;&#x5316;</p>
<p>&#x5982;&#x679C;&#x60A8;&#x7684;&#x516C;&#x53F8;&#x4E0D;&#x613F;&#x610F;&#x6216;&#x901A;&#x8FC7;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x7684;&#x6D41;&#x7A0B;&#x6765;&#x4F7F;&#x7528;&#x7B2C;&#x4E09;&#x65B9;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x4E0D;&#x9002;&#x5408;&#x91C7;&#x7528;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x9644;&#x5F55;B&#x4E2D;&#x66F4;&#x8BE6;&#x7EC6;&#x5730;&#x8BA8;&#x8BBA;&#x4F55;&#x65F6;&#x4F7F;&#x7528;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#x3002;</p>
<h2 id="&#x7ED3;&#x8BBA;">&#x7ED3;&#x8BBA;</h2>
<blockquote>
<p>&#x8981;&#x6210;&#x529F;&#xFF0C;&#x5355;&#x9760;&#x8BA1;&#x5212;&#x662F;&#x4E0D;&#x591F;&#x7684;&#x3002;&#x4E00;&#x4E2A;&#x4EBA;&#x4E5F;&#x5FC5;&#x987B;&#x5373;&#x5174;&#x521B;&#x4F5C; </p>
<p>&#x2014;&#x2014;&#x827E;&#x8428;&#x514B;&#xB7;&#x963F;&#x897F;&#x83AB;&#x592B;</p>
</blockquote>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x4F55;&#x65F6;&#x91C7;&#x7528;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x3002;&#x6709;&#x8BB8;&#x591A;&#x9886;&#x57DF;&#x8981;&#x8BB0;&#x4F4F;&#xFF0C;&#x6BCF;&#x79CD;&#x60C5;&#x51B5;&#x90FD;&#x662F;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x7684;&#x3002;&#x5E0C;&#x671B;&#x8FD9;&#x4E9B;&#x6307;&#x5BFC;&#x539F;&#x5219;&#x4E2D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x60A8;&#x53D1;&#x73B0;&#x8FDB;&#x884C;&#x53D8;&#x66F4;&#x7684;&#x9002;&#x5F53;&#x65F6;&#x673A;&#x3002;</p>
<p>&#x5982;&#x679C;&#x60A8;&#x7684;&#x516C;&#x53F8;&#x5DF2;&#x7ECF;&#x91C7;&#x7528;&#x4E86;&#x4E00;&#x4E9B;&#x4E91;&#x539F;&#x751F;&#x5B9E;&#x8DF5;&#xFF0C;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x786E;&#x5B9A;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x67B6;&#x6784;&#x7684;&#x5176;&#x4ED6;&#x9886;&#x57DF;&#x3002;&#x5F53;&#x4F60;&#x5E94;&#x8BE5;&#x91C7;&#x7528;&#x8FD9;&#x4E9B;&#x6743;&#x8861;&#x548C;&#x5229;&#x76CA;&#x662F;&#x6B63;&#x786E;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5F00;&#x59CB;&#x65F6;&#xFF0C;&#x4E86;&#x89E3;&#x8FD9;&#x4E00;&#x70B9;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x5982;&#x679C;&#x60A8;&#x5C1A;&#x672A;&#x5C06;&#x4E91;&#x539F;&#x751F;&#x5B9E;&#x8DF5;&#x5E94;&#x7528;&#x4E8E;&#x60A8;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5219;&#x6CA1;&#x6709;&#x6377;&#x5F84;&#x3002;&#x4F01;&#x4E1A;&#x548C;&#x5458;&#x5DE5;&#x5C06;&#x9700;&#x8981;&#x5171;&#x540C;&#x51B3;&#x5B9A;&#x8FD9;&#x662F;&#x6B63;&#x786E;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5E76;&#x5171;&#x540C;&#x53D6;&#x5F97;&#x8FDB;&#x5C55;&#x3002;&#x6CA1;&#x6709;&#x4EBA;&#x72EC;&#x81EA;&#x6210;&#x529F;&#x3002;</p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; 2018 cloudnativego.com all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification"> Updated at 
2018-04-06 11:09:36
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch01-what-is-cloud-native-infrastructure.html" class="navigation navigation-prev " aria-label="Previous page: 第1章 什么是云原生基础设施？">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch03-evolution-of-cloud-native-developments.html" class="navigation navigation-next " aria-label="Next page: 第3章 云原生部署的演变">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第2章 何时采用云原生","level":"1.5","depth":1,"next":{"title":"第3章 云原生部署的演变","level":"1.6","depth":1,"path":"ch03-evolution-of-cloud-native-developments.md","ref":"ch03-evolution-of-cloud-native-developments.md","articles":[]},"previous":{"title":"第1章 什么是云原生基础设施？","level":"1.4","depth":1,"path":"ch01-what-is-cloud-native-infrastructure.md","ref":"ch01-what-is-cloud-native-infrastructure.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","codesnippet","splitter","page-toc-button","editlink","back-to-top-button","-lunr","-search","search-plus","github-buttons@2.1.0","favicon@^0.0.2","tbfed-pagefooter@^0.0.1","3-ba","theme-default","-highlight","prism","prism-themes"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © 2018 cloudnativego.com","modify_label":" Updated at ","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prism-themes/themes/prism-ghcolors.css"]},"github":{"url":"https://github.com/CloudNativeInfra/cni"},"editlink":{"label":"Edit this page","multilingual":false,"base":"https://github.com/CloudNativeInfra/cni/blob/master/cn"},"splitter":{},"codesnippet":{},"fontsettings":{"theme":"white","family":"sans","size":2},"favicon":{"shortcut":"favicon.ico","bookmark":"favicon.ico"},"page-toc-button":{},"back-to-top-button":{},"prism-themes":{},"github-buttons":{"repo":"CloudNativeInfra/cni","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"c889b4cfd2df3f575151a52b18610b26"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"search-plus":{}},"theme":"default","author":"cloudnativego.com","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"云原生基础设施 - cloudnativego.com","language":"cn","links":{"sidebar":{"CloudNativeGo":"https://cloudnativego.com"}},"gitbook":"*","description":"云原生基础设施|Cloud Native Infrastructure|cloudnativego.com"},"file":{"path":"ch02-when-to-adopt-cloud-native.md","mtime":"2018-04-06T03:09:36.026Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-04-06T03:09:55.017Z"},"basePath":".","book":{"language":"cn"}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

