
<!DOCTYPE HTML>
<html lang="cn" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第7章 管理云原生应用程序 · 云原生基础架构 - cloudnativego.com</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        <meta name="author" content="cloudnativego.com">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-ghcolors.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch08-securing-applications.html" />
    
    
    <link rel="prev" href="ch06-testing-cloud-native-infrastructure.html" />
    

    
        <link rel="shortcut icon" href='favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"CloudNativeInfra/CNI","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://cloudnativego.com" target="_blank" class="custom-link">CloudNativeGo</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    关于本书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="foreword.html">
            
                <a href="foreword.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="introduction.html">
            
                <a href="introduction.html">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch01-what-is-cloud-native-infrastructure.html">
            
                <a href="ch01-what-is-cloud-native-infrastructure.html">
            
                    
                    第1章 什么是云原生基础架构？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch02-when-to-adopt-cloud-native.html">
            
                <a href="ch02-when-to-adopt-cloud-native.html">
            
                    
                    第2章 何时采用云原生
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch03-evolution-of-cloud-native-developments.html">
            
                <a href="ch03-evolution-of-cloud-native-developments.html">
            
                    
                    第3章 云原生部署的演变
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch04-designing-infrastructure-applicaitons.html">
            
                <a href="ch04-designing-infrastructure-applicaitons.html">
            
                    
                    第4章 设计基础架构应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch05-developing-infrastructure-applications.html">
            
                <a href="ch05-developing-infrastructure-applications.html">
            
                    
                    第5章 开发基础架构应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch06-testing-cloud-native-infrastructure.html">
            
                <a href="ch06-testing-cloud-native-infrastructure.html">
            
                    
                    第6章 测试云原生基础架构
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.10" data-path="ch07-managing-cloud-native-applications.html">
            
                <a href="ch07-managing-cloud-native-applications.html">
            
                    
                    第7章 管理云原生应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch08-securing-applications.html">
            
                <a href="ch08-securing-applications.html">
            
                    
                    第8章 保护应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch09-implementing-cloud-native-infrasctructure.html">
            
                <a href="ch09-implementing-cloud-native-infrasctructure.html">
            
                    
                    第9章 实现云原生基础架构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="appendix-a-patterns-for-network-resiilency.html">
            
                <a href="appendix-a-patterns-for-network-resiilency.html">
            
                    
                    附录A 网络弹性模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="appendix-b-lock-in.html">
            
                <a href="appendix-b-lock-in.html">
            
                    
                    附录B 锁定
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="appendix-c-box-case-study.html">
            
                <a href="appendix-c-box-case-study.html">
            
                    
                    附录C Box：案例研究
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第7章 管理云原生应用程序</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;7&#x7AE0;-&#x7BA1;&#x7406;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;">&#x7B2C;7&#x7AE0; &#x7BA1;&#x7406;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;</h1>
<p>&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65E8;&#x5728;&#x901A;&#x8FC7;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x8FDB;&#x884C;&#x7EF4;&#x62A4;&#x3002;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x524D;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#x6240;&#x5C55;&#x793A;&#x7684;&#xFF0C;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x65E8;&#x5728;&#x7531;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EF4;&#x62A4;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x4F20;&#x7EDF;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x5DE5;&#x4F5C;&#x65F6;&#x95F4;&#x8868;&#xFF0C;&#x7EF4;&#x62A4;&#x548C;&#x5347;&#x7EA7;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90FD;&#x7531;&#x4EBA;&#x7C7B;&#x5B8C;&#x6210;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x5305;&#x62EC;&#x5728;&#x5355;&#x4E2A;&#x4E3B;&#x673A;&#x4E0A;&#x624B;&#x52A8;&#x8FD0;&#x884C;&#x670D;&#x52A1;&#x6216;&#x5B9A;&#x4E49;&#x81EA;&#x52A8;&#x5316;&#x5DE5;&#x5177;&#x4E2D;&#x57FA;&#x7840;&#x7ED3;&#x6784;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5FEB;&#x7167;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x53EF;&#x4EE5;&#x7531;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7BA1;&#x7406;&#x5E76;&#x540C;&#x65F6;&#x7BA1;&#x7406;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x90A3;&#x4E48;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x5DE5;&#x5177;&#x5C31;&#x4F1A;&#x6210;&#x4E3A;&#x53E6;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x5DE5;&#x7A0B;&#x5E08;&#x5BF9;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7684;&#x8D23;&#x4EFB;&#x53EF;&#x4EE5;&#x7528;&#x8C03;&#x89E3;&#x5668;&#x6A21;&#x5F0F;&#x8868;&#x793A;&#xFF0C;&#x5E76;&#x5185;&#x7F6E;&#x5230;&#x5728;&#x8BE5;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x521A;&#x521A;&#x82B1;&#x4E86;&#x524D;&#x4E09;&#x7AE0;&#x6765;&#x89E3;&#x91CA;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x53EF;&#x4EE5;&#x7BA1;&#x7406;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x672C;&#x7AE0;&#x5C06;&#x4ECB;&#x7ECD;&#x5982;&#x4F55;&#x5728;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E0A;&#x8FD0;&#x884C;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6216;&#x4EFB;&#x4F55;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x4FDD;&#x6301;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7B80;&#x5355;&#x6027;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;&#x7BA1;&#x7406;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x590D;&#x6742;&#x6027;&#x7684;&#x5E38;&#x7528;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x5B83;&#x4EEC;&#x5206;&#x89E3;&#x6210;&#x5C0F;&#x7684;&#xFF0C;&#x6613;&#x4E8E;&#x7406;&#x89E3;&#x7684;&#x7EC4;&#x4EF6;&#x3002;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x901A;&#x8FC7;&#x521B;&#x5EFA;&#x5355;&#x4E00;&#x7528;&#x9014;&#x7684;&#x670D;&#x52A1;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x6216;&#x8005;&#x5C06;&#x4EE3;&#x7801;&#x5206;&#x89E3;&#x4E3A;&#x4E00;&#x7CFB;&#x5217;&#x4E8B;&#x4EF6;&#x89E6;&#x53D1;&#x7684;&#x51FD;&#x6570;</p>
<p>&#x5373;&#x4F7F;&#x662F;&#x6700;&#x81EA;&#x52A8;&#x5316;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x5C0F;&#x578B;&#xFF0C;&#x53EF;&#x90E8;&#x7F72;&#x5355;&#x5143;&#x7684;&#x6269;&#x6563;&#x4E5F;&#x53EF;&#x80FD;&#x4EE4;&#x4EBA;&#x6CAE;&#x4E27;&#x3002;&#x7BA1;&#x7406;&#x5927;&#x91CF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x662F;&#x8BA9;&#x4ED6;&#x4EEC;&#x627F;&#x62C5;&#x7B2C;1&#x7AE0;&#x4E2D;&#x6240;&#x8FF0;&#x7684;&#x529F;&#x80FD;&#x6027;&#x64CD;&#x4F5C;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x5728;&#x53EF;&#x4EE5;&#x6309;&#x6BD4;&#x4F8B;&#x7BA1;&#x7406;&#x4E4B;&#x524D;&#x53D8;&#x6210;&#x539F;&#x751F;&#x4E91;&#x3002;</p>
<p>&#x672C;&#x7AE0;&#x4E0D;&#x4F1A;&#x5E2E;&#x52A9;&#x60A8;&#x6784;&#x5EFA;&#x4E0B;&#x4E00;&#x4E2A;&#x4F1F;&#x5927;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F46;&#x5B83;&#x5E94;&#x8BE5;&#x4E3A;&#x60A8;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x8D77;&#x70B9;&#xFF0C;&#x8BA9;&#x60A8;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x4E0A;&#x8FD0;&#x884C;&#x65F6;&#x8FD0;&#x884C;&#x826F;&#x597D;&#x3002;</p>
<h2 id="&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;">&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;</h2>
<p>&#x6709;&#x5F88;&#x591A;&#x4E66;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x672C;&#x4E66;&#x4E0D;&#x6253;&#x7B97;&#x6210;&#x4E3A;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4E86;&#x89E3;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x5982;&#x4F55;&#x5F71;&#x54CD;&#x6709;&#x6548;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8BBE;&#x8BA1;&#x4ECD;&#x7136;&#x5F88;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x7B2C;1&#x7AE0;&#x4E2D;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5047;&#x8BBE;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x88AB;&#x8BBE;&#x8BA1;&#x4E3A;&#x4E91;&#x539F;&#x751F;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4ECE;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x4E2D;&#x83B7;&#x5F97;&#x6700;&#x5927;&#x6536;&#x76CA;&#x3002;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x8BF4;&#xFF0C;&#x4E91;&#x539F;&#x751F;&#x610F;&#x5473;&#x7740;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65E8;&#x5728;&#x7531;&#x8F6F;&#x4EF6;&#x800C;&#x4E0D;&#x662F;&#x4EBA;&#x7C7B;&#x6765;&#x7BA1;&#x7406;&#x3002;</p>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x8BBE;&#x8BA1;&#x4E0E;&#x6253;&#x5305;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x8BBE;&#x8BA1;&#x662F;&#x5206;&#x5F00;&#x8003;&#x8651;&#x7684;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x662F;&#x4E91;&#x539F;&#x751F;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x6253;&#x5305;&#x4E3A;RPM&#x6216;DEB&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x90E8;&#x7F72;&#x5230;&#x865A;&#x62DF;&#x673A;&#x800C;&#x4E0D;&#x662F;&#x5BB9;&#x5668;&#x3002;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x662F;&#x5355;&#x4F53;&#x6216;&#x5FAE;&#x578B;&#x670D;&#x52A1;&#xFF0C;&#x7528;Java&#x6216;Go&#x7F16;&#x5199;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x4E0D;&#x4F1A;&#x4F7F;&#x8BBE;&#x8BA1;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x4E91;&#x4E2D;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5047;&#x88C5;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x7528;Go&#x7F16;&#x5199;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x6253;&#x5305;&#x5728;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#x4E2D;&#x3002;&#x6211;&#x4EEC;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x8BF4;&#x5BB9;&#x5668;&#x8FD0;&#x884C;&#x5728;Kubernetes&#x4E0A;&#xFF0C;&#x5E76;&#x4E14;&#x65E0;&#x8BBA;&#x60A8;&#x9009;&#x62E9;&#x4EC0;&#x4E48;&#x5B9A;&#x4E49;&#xFF0C;&#x90FD;&#x5C06;&#x88AB;&#x89C6;&#x4E3A;&#x5FAE;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x5047;&#x88C5;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x201C;&#x4E91;&#x539F;&#x751F;&#x201D;&#xFF1F;</p>
<p>&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x6240;&#x6709;&#x6D3B;&#x52A8;&#x8BB0;&#x5F55;&#x5230;&#x6587;&#x4EF6;&#x5E76;&#x786C;&#x7F16;&#x7801;&#x6570;&#x636E;&#x5E93;IP&#x5730;&#x5740;&#xFF0C;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x4E5F;&#x8BB8;&#x5B83;&#x4E0D;&#x63A5;&#x53D7;&#x8FD0;&#x884C;&#x65F6;&#x914D;&#x7F6E;&#x5E76;&#x5C06;&#x72B6;&#x6001;&#x5B58;&#x50A8;&#x5728;&#x672C;&#x5730;&#x78C1;&#x76D8;&#x4E0A;&#x3002;&#x5982;&#x679C;&#x5B83;&#x4E0D;&#x4EE5;&#x53EF;&#x9884;&#x89C1;&#x7684;&#x65B9;&#x5F0F;&#x5B58;&#x5728;&#xFF0C;&#x6216;&#x8005;&#x6302;&#x8D77;&#x5E76;&#x7B49;&#x5F85;&#x4EBA;&#x5DE5;&#x8FDB;&#x884C;&#x8C03;&#x8BD5;&#x5462;&#xFF1F;</p>
<p>&#x8FD9;&#x4E2A;&#x5047;&#x88C5;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x4F1A;&#x4ECE;&#x6240;&#x9009;&#x62E9;&#x7684;&#x8BED;&#x8A00;&#x548C;&#x5305;&#x88C5;&#x4E2D;&#x51FA;&#x73B0;&#x539F;&#x751F;&#x4E91;&#xFF0C;&#x4F46;&#x5B83;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x3002;&#x50CF;Kubernetes&#x8FD9;&#x6837;&#x7684;&#x6846;&#x67B6;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5404;&#x79CD;&#x529F;&#x80FD;&#x6765;&#x5E2E;&#x52A9;&#x7BA1;&#x7406;&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F46;&#x5373;&#x4F7F;&#x60A8;&#x80FD;&#x591F;&#x4F7F;&#x5176;&#x8FD0;&#x884C;&#xFF0C;&#x8BE5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E5F;&#x88AB;&#x660E;&#x786E;&#x8BBE;&#x8BA1;&#x4E3A;&#x7531;&#x4EBA;&#x7C7B;&#x7EF4;&#x62A4;&#x548C;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x7B2C;1&#x7AE0;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x4E86;&#x4F7F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x4E0A;&#x8FD0;&#x884C;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x4E00;&#x4E9B;&#x529F;&#x80FD;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5177;&#x6709;&#x7B2C;1&#x7AE0;&#x4E2D;&#x89C4;&#x5B9A;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x8003;&#x8651;&#x56E0;&#x7D20;&#xFF1A;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x6709;&#x6548;&#x7BA1;&#x7406;&#x5B83;&#x4EEC;&#xFF1F;</p>
<h2 id="&#x5B9E;&#x65BD;&#x4E91;&#x539F;&#x751F;&#x6A21;&#x5F0F;">&#x5B9E;&#x65BD;&#x4E91;&#x539F;&#x751F;&#x6A21;&#x5F0F;</h2>
<p>&#x8BF8;&#x5982;&#x5F39;&#x6027;&#xFF0C;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#xFF0C;&#x914D;&#x7F6E;&#xFF0C;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#xFF0C;&#x8FD0;&#x884C;&#x72B6;&#x51B5;&#x68C0;&#x67E5;&#x548C;&#x6307;&#x6807;&#x7B49;&#x6A21;&#x5F0F;&#x90FD;&#x53EF;&#x4EE5;&#x4EE5;&#x4E0D;&#x540C;&#x65B9;&#x5F0F;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x5B9E;&#x65BD;&#x3002;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x6A21;&#x5F0F;&#x7684;&#x5E38;&#x89C1;&#x505A;&#x6CD5;&#x662F;&#x901A;&#x8FC7;&#x5BFC;&#x5165;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6807;&#x51C6;&#x8BED;&#x8A00;&#x5E93;&#x3002; Netflix OSS&#x548C;Twitter&#x7684;Finagle&#x662F;&#x5728;Java&#x8BED;&#x8A00;&#x5E93;&#x4E2D;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x7684;&#x5F88;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<p>&#x5F53;&#x60A8;&#x4F7F;&#x7528;&#x5E93;&#x65F6;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5BFC;&#x5165;&#x5E93;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4F1A;&#x81EA;&#x52A8;&#x83B7;&#x5F97;&#x8BB8;&#x591A;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x989D;&#x5916;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x7EC4;&#x7EC7;&#x5185;&#x5F88;&#x5C11;&#x652F;&#x6301;&#x8BED;&#x8A00;&#x65F6;&#xFF0C;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x5F88;&#x6709;&#x610F;&#x4E49;&#x3002;&#x5B83;&#x5141;&#x8BB8;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x662F;&#x4E00;&#x4EF6;&#x5BB9;&#x6613;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x5F53;&#x7EC4;&#x7EC7;&#x5F00;&#x59CB;&#x5B9E;&#x65BD;&#x5FAE;&#x670D;&#x52A1;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x5F80;&#x5F80;&#x503E;&#x5411;&#x4E8E;&#x4F7F;&#x7528;&#x591A;&#x670D;&#x52A1;&#xFF08;polyglot&#xFF09;&#x670D;&#x52A1;.3&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x5730;&#x4E3A;&#x670D;&#x52A1;&#x9009;&#x62E9;&#x6B63;&#x786E;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x96BE;&#x4E3A;&#x6240;&#x6709;&#x8BED;&#x8A00;&#x7EF4;&#x62A4;&#x5E93;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x79CD;&#x83B7;&#x5F97;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x901A;&#x8FC7;&#x6240;&#x8C13;&#x7684;&#x201C;&#x8FB9;&#x8F66;&#x201D;&#x6A21;&#x5F0F;&#x3002;&#x6B64;&#x6A21;&#x5F0F;&#x5C06;&#x5B9E;&#x65BD;&#x5404;&#x79CD;&#x7BA1;&#x7406;&#x529F;&#x80FD;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6346;&#x7ED1;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x5B83;&#x901A;&#x5E38;&#x4F5C;&#x4E3A;&#x5355;&#x72EC;&#x7684;&#x5BB9;&#x5668;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x60A8;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728;VM&#x4E0A;&#x8FD0;&#x884C;&#x53E6;&#x4E00;&#x4E2A;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x6765;&#x5B9E;&#x73B0;&#x5B83;&#x3002;</p>
<p>sidecars&#x7684;&#x4F8B;&#x5B50;&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#xFF1A;</p>
<p><strong>&#x7279;&#x4F7F;&#x4EE3;&#x7406;</strong></p>
<p>&#x4E3A;&#x670D;&#x52A1;&#x589E;&#x52A0;&#x5F39;&#x6027;&#x548C;&#x6307;&#x6807;</p>
<p><strong>&#x6CE8;&#x518C;</strong></p>
<p>&#x901A;&#x8FC7;&#x5916;&#x90E8;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x6CE8;&#x518C;&#x670D;&#x52A1;</p>
<p><strong>&#x7EC4;&#x6001;</strong></p>
<p>&#x76D1;&#x89C6;&#x914D;&#x7F6E;&#x66F4;&#x6539;&#x5E76;&#x901A;&#x77E5;&#x670D;&#x52A1;&#x8FDB;&#x7A0B;&#x91CD;&#x65B0;&#x52A0;&#x8F7D;</p>
<p><strong>&#x5065;&#x5EB7;&#x7EC8;&#x70B9;</strong></p>
<p>&#x63D0;&#x4F9B;&#x7528;&#x4E8E;&#x68C0;&#x67E5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x72B6;&#x51B5;&#x7684;HTTP&#x7AEF;&#x70B9;</p>
<p>Sidecar&#x5BB9;&#x5668;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x9002;&#x5E94;polyglot&#x5BB9;&#x5668;&#xFF0C;&#x4EE5;&#x66B4;&#x9732;&#x7279;&#x5B9A;&#x4E8E;&#x8BED;&#x8A00;&#x7684;&#x7AEF;&#x70B9;&#x4E0E;&#x4F7F;&#x7528;&#x5E93;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x3002;&#x6765;&#x81EA;Netflix&#x7684;Prana&#x6B63;&#x662F;&#x4E3A;&#x90A3;&#x4E9B;&#x4E0D;&#x4F7F;&#x7528;&#x6807;&#x51C6;Java&#x5E93;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x505A;&#x7684;&#x3002;</p>
<p>&#x5F53;&#x96C6;&#x4E2D;&#x7684;&#x56E2;&#x961F;&#x7BA1;&#x7406;&#x7279;&#x5B9A;&#x7684;&#x8FB9;&#x8F66;&#x8FC7;&#x7A0B;&#x65F6;&#xFF0C;&#x8FB9;&#x8F66;&#x6A21;&#x5F0F;&#x5F88;&#x6709;&#x610F;&#x4E49;&#x3002;&#x5982;&#x679C;&#x5DE5;&#x7A0B;&#x5E08;&#x60F3;&#x8981;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x4E2D;&#x516C;&#x5F00;&#x5EA6;&#x91CF;&#x6807;&#x51C6;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x6784;&#x5EFA;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D; - &#x6216;&#x8005;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x56E2;&#x961F;&#x4E5F;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x5904;&#x7406;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x8F93;&#x51FA;&#x5E76;&#x516C;&#x5F00;&#x8BA1;&#x7B97;&#x51FA;&#x7684;&#x5EA6;&#x91CF;&#x503C;&#x7684;&#x8FB9;&#x8F66;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x670D;&#x52A1;&#x90FD;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x529F;&#x80FD;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x91CD;&#x5199;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x4E00;&#x65E6;&#x80FD;&#x591F;&#x4F7F;&#x7528;&#x8F6F;&#x4EF6;&#x7BA1;&#x7406;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x7BA1;&#x7406;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;</p>
<h2 id="&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x751F;&#x547D;&#x5468;&#x671F;">&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x751F;&#x547D;&#x5468;&#x671F;</h2>
<p>&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E0E;&#x4F20;&#x7EDF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#xFF0C;&#x9664;&#x4E86;&#x5B83;&#x4EEC;&#x7684;&#x9636;&#x6BB5;&#x5E94;&#x8BE5;&#x7531;&#x8F6F;&#x4EF6;&#x6765;&#x7BA1;&#x7406;&#x3002;</p>
<p>&#x672C;&#x7AE0;&#x4E0D;&#x6253;&#x7B97;&#x89E3;&#x91CA;&#x7BA1;&#x7406;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65F6;&#x6D89;&#x53CA;&#x7684;&#x6240;&#x6709;&#x6A21;&#x5F0F;&#x548C;&#x9009;&#x9879;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x7B80;&#x8981;&#x8BA8;&#x8BBA;&#x51E0;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x8FD9;&#x4E9B;&#x9636;&#x6BB5;&#x7279;&#x522B;&#x53D7;&#x76CA;&#x4E8E;&#x5728;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x4E4B;&#x4E0A;&#x8FD0;&#x884C;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF1A;&#x90E8;&#x7F72;&#xFF0C;&#x8FD0;&#x884C;&#x548C;&#x9000;&#x5F79;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x4E3B;&#x9898;&#x5E76;&#x4E0D;&#x90FD;&#x5305;&#x542B;&#x6240;&#x6709;&#x9009;&#x9879;&#xFF0C;&#x4F46;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x5176;&#x4ED6;&#x4E66;&#x7C4D;&#x548C;&#x6587;&#x7AE0;&#x53EF;&#x4F9B;&#x9009;&#x62E9;&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF0C;&#x8BED;&#x8A00;&#x548C;&#x6240;&#x9009;&#x5E93;&#x3002;</p>
<h3 id="&#x90E8;&#x7F72;">&#x90E8;&#x7F72;</h3>
<p>&#x90E8;&#x7F72;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6700;&#x4F9D;&#x8D56;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7684;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x3002;&#x867D;&#x7136;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x80FD;&#x591F;&#x963B;&#x6B62;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x81EA;&#x884C;&#x90E8;&#x7F72;&#xFF0C;&#x4F46;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7BA1;&#x7406;&#x7684;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#x4ECD;&#x7136;&#x5F88;&#x591A;&#x3002;</p>
<p>&#x4F60;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x6574;&#x5408;&#x548C;&#x4EA4;&#x4ED8;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x4E0D;&#x4F1A;&#x6D89;&#x53CA;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#x7684;&#x4E00;&#x4E9B;&#x505A;&#x6CD5;&#x5F88;&#x660E;&#x786E;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90E8;&#x7F72;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x83B7;&#x53D6;&#x4EE3;&#x7801;&#x5E76;&#x8FD0;&#x884C;&#x5B83;&#x3002;</p>
<p>&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65E8;&#x5728;&#x7531;&#x8F6F;&#x4EF6;&#x5728;&#x5404;&#x4E2A;&#x9636;&#x6BB5;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#x3002;&#x8FD9;&#x5305;&#x62EC;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x7684;&#x5065;&#x5EB7;&#x68C0;&#x67E5;&#x4EE5;&#x53CA;&#x521D;&#x59CB;&#x90E8;&#x7F72;&#x3002;&#x5E94;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x6D88;&#x9664;&#x6280;&#x672F;&#xFF0C;&#x6D41;&#x7A0B;&#x548C;&#x7B56;&#x7565;&#x4E2D;&#x7684;&#x4EBA;&#x4E3A;&#x74F6;&#x9888;&#x3002;</p>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x90E8;&#x7F72;&#x5E94;&#x8BE5;&#x662F;&#x81EA;&#x52A8;&#x7684;&#xFF0C;&#x81EA;&#x52A9;&#x5F0F;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x5982;&#x679C;&#x5904;&#x4E8E;&#x79EF;&#x6781;&#x7684;&#x5F00;&#x53D1;&#x4E2D;&#xFF0C;&#x5219;&#x662F;&#x9891;&#x7E41;&#x7684;&#x3002;&#x4ED6;&#x4EEC;&#x4E5F;&#x5E94;&#x8BE5;&#x88AB;&#x6D4B;&#x8BD5;&#xFF0C;&#x9A8C;&#x8BC1;&#x548C;&#x5E73;&#x9759;&#x3002;</p>
<p>&#x4E00;&#x6B21;&#x66FF;&#x6362;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x5F88;&#x5C11;&#x662F;&#x65B0;&#x7248;&#x672C;&#x548C;&#x529F;&#x80FD;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x65B0;&#x529F;&#x80FD;&#x5728;&#x914D;&#x7F6E;&#x6807;&#x5FD7;&#x540E;&#x9762;&#x201C;&#x9009;&#x901A;&#x201D;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x9009;&#x62E9;&#x6027;&#x5730;&#x52A8;&#x6001;&#x542F;&#x7528;&#x3002;&#x7248;&#x672C;&#x5347;&#x7EA7;&#x90E8;&#x5206;&#x5C55;&#x5F00;&#xFF0C;&#x901A;&#x8FC7;&#x6D4B;&#x8BD5;&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;&#xFF0C;&#x5E76;&#x5728;&#x6240;&#x6709;&#x6D4B;&#x8BD5;&#x901A;&#x8FC7;&#x65F6;&#x4EE5;&#x53D7;&#x63A7;&#x65B9;&#x5F0F;&#x5C55;&#x5F00;&#x3002;</p>
<p>&#x5F53;&#x542F;&#x7528;&#x65B0;&#x529F;&#x80FD;&#x6216;&#x90E8;&#x7F72;&#x65B0;&#x7248;&#x672C;&#x65F6;&#xFF0C;&#x5E94;&#x8BE5;&#x5B58;&#x5728;&#x63A7;&#x5236;&#x6D41;&#x5411;&#x6216;&#x79BB;&#x5F00;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6D41;&#x91CF;&#x7684;&#x673A;&#x5236;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x9644;&#x5F55;A&#xFF09;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x9650;&#x5236;&#x4E2D;&#x65AD;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x7F13;&#x6162;&#x7684;&#x90E8;&#x7F72;&#x548C;&#x66F4;&#x5FEB;&#x7684;&#x53CD;&#x9988;&#x5FAA;&#x73AF;&#x6765;&#x5B9E;&#x73B0;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6027;&#x80FD;&#x548C;&#x529F;&#x80FD;&#x7684;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x57FA;&#x7840;&#x67B6;&#x6784;&#x5E94;&#x8D1F;&#x8D23;&#x90E8;&#x7F72;&#x8F6F;&#x4EF6;&#x7684;&#x6240;&#x6709;&#x7EC6;&#x8282;&#x3002;&#x5DE5;&#x7A0B;&#x5E08;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7248;&#x672C;&#xFF0C;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x8981;&#x6C42;&#x548C;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x5E76;&#x4E14;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x5C06;&#x671D;&#x7740;&#x8BE5;&#x72B6;&#x6001;&#x53D1;&#x5C55;&#xFF0C;&#x76F4;&#x81F3;&#x6EE1;&#x8DB3;&#x6240;&#x6709;&#x8981;&#x6C42;&#x6216;&#x9700;&#x6C42;&#x66F4;&#x6539;&#x3002;</p>
<h3 id="&#x8FD0;&#x884C;">&#x8FD0;&#x884C;</h3>
<p>&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E94;&#x8BE5;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#x6700;&#x5E73;&#x7A33;&#x6700;&#x7A33;&#x5B9A;&#x7684;&#x9636;&#x6BB5;&#x3002;&#x8FD0;&#x884C;&#x8F6F;&#x4EF6;&#x7684;&#x4E24;&#x4E2A;&#x6700;&#x91CD;&#x8981;&#x7684;&#x65B9;&#x9762;&#x5728;&#x7B2C;1&#x7AE0;&#x4E2D;&#x8BA8;&#x8BBA;&#xFF1A;&#x4E86;&#x89E3;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x505A;&#x4EC0;&#x4E48;&#x4EE5;&#x53CA;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9700;&#x8981;&#x66F4;&#x6539;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x53EF;&#x64CD;&#x4F5C;&#x6027;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5728;&#x7B2C;1&#x7AE0;&#x4E2D;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x4E86;&#x62A5;&#x544A;&#x5065;&#x5EB7;&#x548C;&#x9065;&#x6D4B;&#x6570;&#x636E;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x89C2;&#x5BDF;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x4E8B;&#x60C5;&#x4E0D;&#x6309;&#x9884;&#x671F;&#x5DE5;&#x4F5C;&#x65F6;&#xFF0C;&#x60A8;&#x4F1A;&#x505A;&#x4EC0;&#x4E48;&#xFF1F;&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x9065;&#x6D4B;&#x6570;&#x636E;&#x663E;&#x793A;&#x5B83;&#x4E0D;&#x7B26;&#x5408;SLO&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x548C;&#x8C03;&#x8BD5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF1F;</p>
<p>&#x5BF9;&#x4E8E;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x60A8;&#x4E0D;&#x5E94;&#x8BE5;&#x901A;&#x8FC7;SSH&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x5E76;&#x67E5;&#x770B;&#x65E5;&#x5FD7;&#x3002;&#x5982;&#x679C;&#x60A8;&#x9700;&#x8981;SSH&#xFF0C;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x6216;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x503C;&#x5F97;&#x8003;&#x8651;&#x3002;</p>
<p>&#x60A8;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8BBF;&#x95EE;&#xFF08;API&#xFF09;&#xFF0C;&#x65E5;&#x5FD7;&#x6570;&#x636E;&#xFF08;&#x4E91;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#xFF09;&#x4EE5;&#x53CA;&#x5806;&#x6808;&#x4E2D;&#x67D0;&#x4E2A;&#x4F4D;&#x7F6E;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4F46;&#x503C;&#x5F97;&#x901A;&#x8FC7;&#x7EC3;&#x4E60;&#x6765;&#x67E5;&#x770B;&#x662F;&#x5426;&#x9700;&#x8981;&#x4F20;&#x7EDF;&#x5DE5;&#x5177;&#x3002;&#x5F53;&#x4E8B;&#x60C5;&#x4E2D;&#x65AD;&#x65F6;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x8C03;&#x8BD5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7EC4;&#x4EF6;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x5728;&#x8C03;&#x8BD5;&#x4E00;&#x4E2A;&#x7834;&#x635F;&#x7684;&#x7CFB;&#x7EDF;&#x65F6;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x9996;&#x5148;&#x67E5;&#x770B;&#x60A8;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x6D4B;&#x8BD5;&#xFF0C;&#x5982;&#x7B2C;5&#x7AE0;&#x6240;&#x8FF0;&#x3002;&#x6D4B;&#x8BD5;&#x5E94;&#x516C;&#x5F00;&#x6240;&#x6709;&#x672A;&#x6B63;&#x786E;&#x914D;&#x7F6E;&#x6216;&#x672A;&#x63D0;&#x4F9B;&#x9884;&#x671F;&#x6027;&#x80FD;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7EC4;&#x4EF6;&#x3002;</p>
<p>&#x4EC5;&#x4EC5;&#x56E0;&#x4E3A;&#x4F60;&#x4E0D;&#x7BA1;&#x7406;&#x5E95;&#x5C42;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E0D;&#x80FD;&#x6210;&#x4E3A;&#x4F60;&#x95EE;&#x9898;&#x7684;&#x539F;&#x56E0;&#x3002;&#x901A;&#x8FC7;&#x6D4B;&#x8BD5;&#x6765;&#x9A8C;&#x8BC1;&#x671F;&#x671B;&#x503C;&#x5C06;&#x786E;&#x4FDD;&#x60A8;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x80FD;&#x591F;&#x4EE5;&#x60A8;&#x671F;&#x671B;&#x7684;&#x65B9;&#x5F0F;&#x6267;&#x884C;&#x3002;</p>
<p>&#x5728;&#x6392;&#x9664;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x540E;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x67E5;&#x770B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE5;&#x83B7;&#x53D6;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x3002;&#x8F6C;&#x5411;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8C03;&#x8BD5;&#x7684;&#x6700;&#x4F73;&#x4F4D;&#x7F6E;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6027;&#x80FD;&#x7BA1;&#x7406;&#xFF08;APM&#xFF09;&#x4EE5;&#x53CA;&#x53EF;&#x80FD;&#x901A;&#x8FC7;OpenTracing&#x7B49;&#x6807;&#x51C6;&#x8FDB;&#x884C;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8DDF;&#x8E2A;&#x3002;</p>
<p>OpenTracing&#x793A;&#x4F8B;&#xFF0C;&#x5B9E;&#x73B0;&#x548C;APM&#x4E0D;&#x5728;&#x672C;&#x4E66;&#x7684;&#x8303;&#x56F4;&#x4E4B;&#x5185;&#x3002;&#x4F5C;&#x4E3A;&#x975E;&#x5E38;&#x7B80;&#x77ED;&#x7684;&#x6982;&#x8FF0;&#xFF0C;OpenTracing&#x5141;&#x8BB8;&#x60A8;&#x5728;&#x6574;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x8DDF;&#x8E2A;&#x8C03;&#x7528;&#xFF0C;&#x4EE5;&#x66F4;&#x8F7B;&#x677E;&#x5730;&#x8BC6;&#x522B;&#x7F51;&#x7EDC;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x901A;&#x4FE1;&#x95EE;&#x9898;&#x3002; OpenTracing&#x7684;&#x793A;&#x4F8B;&#x53EF;&#x89C6;&#x5316;&#x53EF;&#x4EE5;&#x5728;&#x56FE;7-1&#x4E2D;&#x770B;&#x5230;&#x3002; APM&#x4E3A;&#x60A8;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6DFB;&#x52A0;&#x4E86;&#x7528;&#x4E8E;&#x5411;&#x6536;&#x96C6;&#x670D;&#x52A1;&#x62A5;&#x544A;&#x6307;&#x6807;&#x548C;&#x6545;&#x969C;&#x7684;&#x5DE5;&#x5177;&#x3002;</p>
<p><img src="../images/f-7-1.jpg" alt="f-7-1"></p>
<p>&#x56FE;7-1. OpenTracing&#x53EF;&#x89C6;&#x5316;</p>
<p>&#x5F53;&#x6D4B;&#x8BD5;&#x548C;&#x8DDF;&#x8E2A;&#x4ECD;&#x7136;&#x6CA1;&#x6709;&#x516C;&#x5F00;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x6709;&#x65F6;&#x60A8;&#x53EA;&#x9700;&#x8981;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0A;&#x542F;&#x7528;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x4F55;&#x5728;&#x4E0D;&#x7834;&#x574F;&#x95EE;&#x9898;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x542F;&#x7528;&#x8C03;&#x8BD5;&#xFF1F;</p>
<p>&#x8FD0;&#x884C;&#x65F6;&#x914D;&#x7F6E;&#x5BF9;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x5728;&#x4E91;&#x539F;&#x751F;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x914D;&#x7F6E;&#x5E94;&#x8BE5;&#x662F;&#x52A8;&#x6001;&#x7684;&#xFF0C;&#x65E0;&#x9700;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x914D;&#x7F6E;&#x9009;&#x9879;&#x4ECD;&#x7136;&#x901A;&#x8FC7;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x5E93;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x6807;&#x5FD7;&#x503C;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x96C6;&#x4E2D;&#x534F;&#x8C03;&#x5668;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;API&#x8C03;&#x7528;&#xFF0C;HTTP&#x6807;&#x5934;&#x6216;&#x591A;&#x79CD;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x52A8;&#x6001;&#x66F4;&#x6539;&#x3002;</p>
<p>Netflix&#x7684;Archaius&#x548C;Facebook&#x7684;Gate-Keeper&#x662F;&#x52A8;&#x6001;&#x914D;&#x7F6E;&#x7684;&#x4E24;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x524D;Facebook&#x5DE5;&#x7A0B;&#x7ECF;&#x7406;&#x8D3E;&#x65AF;&#x6C40;&#x7C73;&#x5207;&#x5C14;&#x5728;Quora&#x7684;&#x5E16;&#x5B50;&#x4E2D;&#x5206;&#x4EAB;&#x5230;&#xFF1A;</p>
<blockquote>
<p>[Gatekeeper]&#x4ECE;&#x4EE3;&#x7801;&#x90E8;&#x7F72;&#x4E2D;&#x89E3;&#x8026;&#x529F;&#x80FD;&#x91CA;&#x653E;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x51E0;&#x5929;&#x6216;&#x51E0;&#x5468;&#x5185;&#x53D1;&#x5E03;&#x529F;&#x80FD;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x89C2;&#x770B;&#x4E86;&#x7528;&#x6237;&#x6307;&#x6807;&#xFF0C;&#x6027;&#x80FD;&#x5E76;&#x786E;&#x4FDD;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x6269;&#x5C55;&#x3002;</p>
</blockquote>
<p>&#x5141;&#x8BB8;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x914D;&#x7F6E;&#x8FDB;&#x884C;&#x52A8;&#x6001;&#x63A7;&#x5236;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x66F4;&#x591A;&#x63A7;&#x5236;&#x66DD;&#x5149;&#x8FC7;&#x5EA6;&#x7684;&#x529F;&#x80FD;&#x5E76;&#x66F4;&#x597D;&#x5730;&#x6D4B;&#x8BD5;&#x5DF2;&#x90E8;&#x7F72;&#x4EE3;&#x7801;&#x7684;&#x8986;&#x76D6;&#x8303;&#x56F4;&#x4EC5;&#x4EC5;&#x56E0;&#x4E3A;&#x63A8;&#x65B0;&#x4EE3;&#x7801;&#x5F88;&#x5BB9;&#x6613;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x5B83;&#x662F;&#x9002;&#x5408;&#x6240;&#x6709;&#x60C5;&#x51B5;&#x7684;&#x6B63;&#x786E;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x57FA;&#x7840;&#x67B6;&#x6784;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x89E3;&#x51B3;&#x6B64;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x534F;&#x8C03;&#x4F55;&#x65F6;&#x542F;&#x7528;&#x529F;&#x80FD;&#x548C;&#x57FA;&#x4E8E;&#x9AD8;&#x7EA7;&#x7F51;&#x7EDC;&#x7B56;&#x7565;&#x8DEF;&#x7531;&#x6D41;&#x91CF;&#x6765;&#x542F;&#x7528;&#x66F4;&#x7075;&#x6D3B;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x8FD8;&#x5141;&#x8BB8;&#x66F4;&#x7EC6;&#x7C92;&#x5EA6;&#x7684;&#x63A7;&#x5236;&#x548C;&#x66F4;&#x597D;&#x7684;&#x534F;&#x8C03;&#x63A8;&#x51FA;&#x6216;&#x56DE;&#x6EDA;&#x573A;&#x666F;&#x3002;</p>
<p>&#x5728;&#x52A8;&#x6001;&#x7684;&#x81EA;&#x52A9;&#x670D;&#x52A1;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x5C06;&#x90E8;&#x7F72;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6570;&#x91CF;&#x5C06;&#x5FEB;&#x901F;&#x589E;&#x957F;&#x3002;&#x60A8;&#x9700;&#x8981;&#x786E;&#x4FDD;&#x60A8;&#x6709;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x52A8;&#x6001;&#x8C03;&#x8BD5;&#x7C7B;&#x4F3C;&#x81EA;&#x52A9;&#x670D;&#x52A1;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE5;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x4E0E;&#x5DE5;&#x7A0B;&#x5E08;&#x559C;&#x6B22;&#x63A8;&#x65B0;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E00;&#x6837;&#xFF0C;&#x53CD;&#x8FC7;&#x6765;&#x5F88;&#x96BE;&#x8BA9;&#x4ED6;&#x4EEC;&#x9000;&#x4F11;&#x65E7;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x5373;&#x4F7F;&#x5982;&#x6B64;&#xFF0C;&#x5B83;&#x4ECD;&#x7136;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#x7684;&#x5173;&#x952E;&#x9636;&#x6BB5;&#x3002;</p>
<h3 id="&#x9000;&#x4F11;">&#x9000;&#x4F11;</h3>
<p>&#x90E8;&#x7F72;&#x65B0;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x670D;&#x52A1;&#x5728;&#x5FEB;&#x901F;&#x79FB;&#x52A8;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x5F88;&#x5E38;&#x89C1;&#x3002;&#x5373;&#x65F6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E94;&#x8BE5;&#x50CF;&#x521B;&#x5EFA;&#x5B83;&#x4EEC;&#x4E00;&#x6837;&#x81EA;&#x52A9;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x5982;&#x679C;&#x81EA;&#x52A8;&#x90E8;&#x7F72;&#x548C;&#x76D1;&#x63A7;&#x65B0;&#x670D;&#x52A1;&#x548C;&#x8D44;&#x6E90;&#xFF0C;&#x5219;&#x5E94;&#x8BE5;&#x6309;&#x7167;&#x76F8;&#x540C;&#x6807;&#x51C6;&#x9000;&#x5F79;&#x3002;&#x5C3D;&#x5FEB;&#x90E8;&#x7F72;&#x65B0;&#x670D;&#x52A1;&#x800C;&#x4E0D;&#x5220;&#x9664;&#x672A;&#x4F7F;&#x7528;&#x7684;&#x670D;&#x52A1;&#x662F;&#x5E94;&#x5BF9;&#x6280;&#x672F;&#x503A;&#x52A1;&#x7684;&#x6700;&#x7B80;&#x5355;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x8BC6;&#x522B;&#x5E94;&#x8BE5;&#x9000;&#x5F79;&#x7684;&#x670D;&#x52A1;&#x548C;&#x8D44;&#x6E90;&#x662F;&#x7279;&#x5B9A;&#x4E1A;&#x52A1;&#x7684;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9065;&#x6D4B;&#x6D4B;&#x91CF;&#x7684;&#x7ECF;&#x9A8C;&#x6570;&#x636E;&#x6765;&#x4E86;&#x89E3;&#x662F;&#x5426;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x67D0;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F46;&#x662F;&#x5E94;&#x9000;&#x51FA;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x51B3;&#x5B9A;&#x5E94;&#x7531;&#x8BE5;&#x4E1A;&#x52A1;&#x5236;&#x5B9A;&#x3002;</p>
<p>&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7EC4;&#x4EF6;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;VM&#x5B9E;&#x4F8B;&#x548C;&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x5668;&#x7AEF;&#x70B9;&#xFF09;&#x5E94;&#x5728;&#x4E0D;&#x9700;&#x8981;&#x65F6;&#x81EA;&#x52A8;&#x6E05;&#x7406;&#x3002;&#x81EA;&#x52A8;&#x5316;&#x7EC4;&#x4EF6;&#x6E05;&#x7406;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x662F;Netflix&#x7684;Janitor Monkey&#x3002;&#x8BE5;&#x516C;&#x53F8;&#x5728;&#x4E00;&#x7BC7;&#x535A;&#x6587;&#x4E2D;&#x89E3;&#x91CA;&#x9053;&#xFF1A;</p>
<blockquote>
<p>&#x770B;&#x95E8;&#x4EBA;&#x7334;&#x5B50;&#x901A;&#x8FC7;&#x5728;&#x5176;&#x4E0A;&#x5E94;&#x7528;&#x4E00;&#x7EC4;&#x89C4;&#x5219;&#x6765;&#x786E;&#x5B9A;&#x8D44;&#x6E90;&#x662F;&#x5426;&#x5E94;&#x8BE5;&#x6210;&#x4E3A;&#x6E05;&#x7406;&#x5019;&#x9009;&#x4EBA;&#x3002;&#x5982;&#x679C;&#x4EFB;&#x4F55;&#x89C4;&#x5219;&#x786E;&#x5B9A;&#x8BE5;&#x8D44;&#x6E90;&#x662F;&#x6E05;&#x7406;&#x5019;&#x9009;&#x4EBA;&#xFF0C;&#x5219;Janitor Monkey&#x6807;&#x8BB0;&#x8BE5;&#x8D44;&#x6E90;&#x5E76;&#x5B89;&#x6392;&#x6E05;&#x7406;&#x65F6;&#x95F4;&#x3002;</p>
</blockquote>
<p>&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x9636;&#x6BB5;&#x7684;&#x76EE;&#x6807;&#x662F;&#x8BA9;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x548C;&#x8F6F;&#x4EF6;&#x7BA1;&#x7406;&#x4F20;&#x7EDF;&#x4E0A;&#x7531;&#x4EBA;&#x7C7B;&#x7BA1;&#x7406;&#x7684;&#x65B9;&#x9762;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x662F;&#x7F16;&#x5199;&#x81EA;&#x52A8;&#x5316;&#x811A;&#x672C;&#xFF0C;&#x800C;&#x662F;&#x7F16;&#x5199;&#x4E00;&#x6B21;&#x7531;&#x4EBA;&#x7C7B;&#x8FD0;&#x884C;&#x7684;&#x811A;&#x672C;&#xFF0C;&#x6211;&#x4EEC;&#x91C7;&#x7528;&#x534F;&#x8C03;&#x6A21;&#x5F0F;&#x4E0E;&#x7EC4;&#x4EF6;&#x5143;&#x6570;&#x636E;&#x76F8;&#x7ED3;&#x5408;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4E0D;&#x65AD;&#x8FD0;&#x884C;&#x5E76;&#x6839;&#x636E;&#x5F53;&#x524D;&#x4E0A;&#x4E0B;&#x6587;&#x5BF9;&#x9700;&#x8981;&#x91C7;&#x53D6;&#x7684;&#x9AD8;&#x5C42;&#x6B21;&#x64CD;&#x4F5C;&#x505A;&#x51FA;&#x51B3;&#x7B56;&#x3002;</p>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x751F;&#x547D;&#x5468;&#x671F;&#x9636;&#x6BB5;&#x4E0D;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F9D;&#x8D56;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x9762;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x57FA;&#x7840;&#x670D;&#x52A1;&#xFF0C;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90FD;&#x4F9D;&#x8D56;&#x4E8E;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x4E0B;&#x4E00;&#x8282;&#x8BA8;&#x8BBA;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x63D0;&#x4F9B;&#x7684;&#x4E00;&#x4E9B;&#x652F;&#x6301;&#x670D;&#x52A1;&#x548C;API&#x57FA;&#x7840;&#x7ED3;&#x6784;&#x3002;</p>
<h2 id="&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x5E94;&#x7528;&#x8981;&#x6C42;">&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x5E94;&#x7528;&#x8981;&#x6C42;</h2>
<p>&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5BF9;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7684;&#x671F;&#x671B;&#x8FDC;&#x8FDC;&#x8D85;&#x8FC7;&#x53EA;&#x6267;&#x884C;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x62BD;&#x8C61;&#xFF0C;&#x9694;&#x79BB;&#x548C;&#x4FDD;&#x8BC1;&#x4ED6;&#x4EEC;&#x5982;&#x4F55;&#x8FD0;&#x884C;&#x548C;&#x7BA1;&#x7406;&#x3002;&#x4F5C;&#x4E3A;&#x56DE;&#x62A5;&#xFF0C;&#x4ED6;&#x4EEC;&#x88AB;&#x8981;&#x6C42;&#x63D0;&#x4F9B;&#x94A9;&#x5B50;&#x548C;API&#x4EE5;&#x5141;&#x8BB8;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7BA1;&#x7406;&#x5B83;&#x4EEC;&#x3002;&#x8981;&#x6210;&#x529F;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x6709;&#x4E00;&#x79CD;&#x5171;&#x751F;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5728;&#x7B2C;1&#x7AE0;&#x4E2D;&#x5B9A;&#x4E49;&#x4E86;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x521A;&#x521A;&#x8BA8;&#x8BBA;&#x4E86;&#x4E00;&#x4E9B;&#x751F;&#x547D;&#x5468;&#x671F;&#x8981;&#x6C42;&#x3002;&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x4ED6;&#x4EEC;&#x4ECE;&#x8FD0;&#x884C;&#x5B83;&#x4EEC;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x4E2D;&#x83B7;&#x5F97;&#x7684;&#x66F4;&#x591A;&#x671F;&#x671B;&#xFF1A;</p>
<ul>
<li>&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x548C;&#x9694;&#x79BB;</li>
<li>&#x8D44;&#x6E90;&#x5206;&#x914D;&#x548C;&#x8C03;&#x5EA6;</li>
<li>&#x73AF;&#x5883;&#x9694;&#x79BB;</li>
<li>&#x670D;&#x52A1;&#x53D1;&#x73B0;</li>
<li>&#x72B6;&#x6001;&#x7BA1;&#x7406;</li>
<li>&#x76D1;&#x6D4B;&#x548C;&#x8BB0;&#x5F55;</li>
<li>&#x5EA6;&#x91CF;&#x805A;&#x5408;</li>
<li>&#x8C03;&#x8BD5;&#x548C;&#x8DDF;&#x8E2A;</li>
</ul>
<p>&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x90FD;&#x5E94;&#x8BE5;&#x662F;&#x670D;&#x52A1;&#x7684;&#x9ED8;&#x8BA4;&#x9009;&#x9879;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x81EA;&#x52A9;API&#x63D0;&#x4F9B;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x66F4;&#x8BE6;&#x7EC6;&#x5730;&#x89E3;&#x91CA;&#x6BCF;&#x4E2A;&#x8981;&#x6C42;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x660E;&#x786E;&#x5B9A;&#x4E49;&#x671F;&#x671B;&#x3002;</p>
<h3 id="&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#x548C;&#x9694;&#x79BB;">&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#x548C;&#x9694;&#x79BB;</h3>
<p>&#x4F20;&#x7EDF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5185;&#x6838;&#x5E76;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x89E3;&#x91CA;&#x5668;&#x6765;&#x8FD0;&#x884C;.Cloud&#x672C;&#x673A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x5B83;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4E5F;&#x9700;&#x8981;&#x4E0E;&#x8FD0;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9694;&#x79BB;&#x3002;&#x9694;&#x79BB;&#x4F7F;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x80FD;&#x591F;&#x5728;&#x540C;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x5E76;&#x63A7;&#x5236;&#x5B83;&#x4EEC;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x548C;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9694;&#x79BB;&#x6709;&#x65F6;&#x79F0;&#x4E3A;&#x591A;&#x79DF;&#x6237;&#x3002;&#x8BE5;&#x672F;&#x8BED;&#x53EF;&#x7528;&#x4E8E;&#x5728;&#x540C;&#x4E00;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE5;&#x53CA;&#x5728;&#x5171;&#x4EAB;&#x96C6;&#x7FA4;&#x4E2D;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x591A;&#x4E2A;&#x7528;&#x6237;&#x3002;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x7ECF;&#x8FC7;&#x9A8C;&#x8BC1;&#x7684;&#x53EF;&#x4FE1;&#x4EE3;&#x7801;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x60A8;&#x65E0;&#x6CD5;&#x63A7;&#x5236;&#x4E14;&#x4E0D;&#x4FE1;&#x4EFB;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x8981;&#x6210;&#x4E3A;&#x672C;&#x5730;&#x4E91;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x5BB9;&#x5668;&#x3002; Netflix&#x7387;&#x5148;&#x63A8;&#x51FA;&#x4E86;&#x8BB8;&#x591A;&#x4E91;&#x539F;&#x751F;&#x6A21;&#x5F0F;&#xFF0C;&#x5F53;&#x516C;&#x53F8;&#x8FC7;&#x6E21;&#x5230;&#x5728;&#x516C;&#x5171;&#x4E91;&#x4E0A;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x865A;&#x62DF;&#x673A;&#x4F5C;&#x4E3A;&#x5176;&#x90E8;&#x7F72;&#x5DE5;&#x4EF6;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5BB9;&#x5668;&#x3002; FaaS&#x670D;&#x52A1;&#xFF08;&#x4F8B;&#x5982;AWS Lambda&#xFF09;&#x662F;&#x7528;&#x4E8E;&#x6253;&#x5305;&#x548C;&#x90E8;&#x7F72;&#x4EE3;&#x7801;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x6D41;&#x884C;&#x7684;&#x4E91;&#x539F;&#x751F;&#x6280;&#x672F;&#x3002;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4ED6;&#x4EEC;&#x4F7F;&#x7528;&#x5BB9;&#x5668;&#x8FDB;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9694;&#x79BB;&#xFF0C;&#x4F46;&#x5BB9;&#x5668;&#x5305;&#x88C5;&#x5BF9;&#x7528;&#x6237;&#x662F;&#x9690;&#x85CF;&#x7684;&#x3002;</p>
<blockquote>
<p><strong>&#x4EC0;&#x4E48;&#x662F;&#x5BB9;&#x5668;&#xFF1F;</strong></p>
<p>&#x5BB9;&#x5668;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#x3002; Docker&#x63A8;&#x5E7F;&#x672F;&#x8BED;&#x5BB9;&#x5668;&#x6765;&#x63CF;&#x8FF0;&#x5728;&#x5B64;&#x7ACB;&#x73AF;&#x5883;&#x4E2D;&#x6253;&#x5305;&#x548C;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x57FA;&#x672C;&#x4E0A;&#xFF0C;&#x5BB9;&#x5668;&#x4F7F;&#x7528;&#x5185;&#x6838;&#x539F;&#x8BED;&#x6216;&#x786C;&#x4EF6;&#x529F;&#x80FD;&#x6765;&#x9694;&#x79BB;&#x5355;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x8FDB;&#x7A0B;&#x3002;</p>
<p>&#x5BB9;&#x5668;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x72EC;&#x7ACB;&#x7684;&#x6839;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x540D;&#x79F0;&#x7A7A;&#x95F4;&#x4EE5;&#x53CA;&#x6765;&#x81EA;&#x540C;&#x4E00;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x7684;&#x8D44;&#x6E90;&#x5206;&#x914D;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;CPU&#x548C;RAM&#xFF09;&#x8FD0;&#x884C;&#x3002;&#x5BB9;&#x5668;&#x683C;&#x5F0F;&#x5DF2;&#x88AB;&#x8BB8;&#x591A;&#x9879;&#x76EE;&#x91C7;&#x7528;&#xFF0C;&#x5E76;&#x521B;&#x5EFA;&#x4E86;&#x5F00;&#x653E;&#x5BB9;&#x5668;&#x8BA1;&#x5212;&#xFF08;OCI&#xFF09;&#xFF0C;&#x8BE5;&#x8BA1;&#x5212;&#x5B9A;&#x4E49;&#x4E86;&#x5982;&#x4F55;&#x6253;&#x5305;&#x548C;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5BB9;&#x5668;&#x7684;&#x6807;&#x51C6;&#x3002;</p>
</blockquote>
<p>&#x9694;&#x79BB;&#x8FD8;&#x4F1A;&#x7ED9;&#x7F16;&#x5199;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x9020;&#x6210;&#x8D1F;&#x62C5;&#x3002;&#x4ED6;&#x4EEC;&#x73B0;&#x5728;&#x8D1F;&#x8D23;&#x58F0;&#x660E;&#x6240;&#x6709;&#x7684;&#x8F6F;&#x4EF6;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x4E0D;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x65E0;&#x6CD5;&#x8FD0;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x5FC5;&#x8981;&#x7684;&#x5E93;&#x5C06;&#x4E0D;&#x53EF;&#x7528;&#x3002;</p>
<p>&#x5BB9;&#x5668;&#x7ECF;&#x5E38;&#x88AB;&#x9009;&#x62E9;&#x7528;&#x4E8E;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x56E0;&#x4E3A;&#x5DF2;&#x7ECF;&#x51FA;&#x73B0;&#x4E86;&#x7528;&#x4E8E;&#x7BA1;&#x7406;&#x5B83;&#x4EEC;&#x7684;&#x66F4;&#x597D;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x6D41;&#x7A0B;&#x548C;&#x7F16;&#x6392;&#x5DE5;&#x5177;&#x3002;&#x867D;&#x7136;&#x5BB9;&#x5668;&#x662F;&#x5B9E;&#x73B0;&#x8FD0;&#x884C;&#x65F6;&#x548C;&#x8D44;&#x6E90;&#x9694;&#x79BB;&#x7684;&#x6700;&#x7B80;&#x5355;&#x65B9;&#x5F0F;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#xFF08;&#x5E76;&#x4E14;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#xFF09;&#x5982;&#x6B64;&#x3002;</p>
<h3 id="&#x8D44;&#x6E90;&#x5206;&#x914D;&#x548C;&#x8C03;&#x5EA6;">&#x8D44;&#x6E90;&#x5206;&#x914D;&#x548C;&#x8C03;&#x5EA6;</h3>
<p>&#x4ECE;&#x5386;&#x53F2;&#x4E0A;&#x770B;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x6709;&#x5173;&#x6700;&#x4F4E;&#x7CFB;&#x7EDF;&#x8981;&#x6C42;&#x7684;&#x7C97;&#x7565;&#x4F30;&#x8BA1;&#xFF0C;&#x4EBA;&#x7C7B;&#x6709;&#x8D23;&#x4EFB;&#x786E;&#x5B9A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x7684;&#x4F4D;&#x7F6E;.4&#x4EBA;&#x5DE5;&#x8C03;&#x5EA6;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x51C6;&#x5907;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x4F9D;&#x8D56;&#x9879;&#x3002;</p>
<p>&#x90E8;&#x7F72;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x548C;&#x914D;&#x7F6E;&#x5B9E;&#x73B0;&#x81EA;&#x52A8;&#x5316;&#xFF0C;&#x4F46;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x4EBA;&#x5458;&#x9A8C;&#x8BC1;&#x8D44;&#x6E90;&#x5E76;&#x6807;&#x8BB0;&#x670D;&#x52A1;&#x5668;&#x4EE5;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x4F9D;&#x8D56;&#x4E8E;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x9694;&#x79BB;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x8D44;&#x6E90;&#x53EF;&#x7528;&#x7684;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x9694;&#x79BB;&#xFF0C;&#x53EA;&#x8981;&#x7CFB;&#x7EDF;&#x5177;&#x6709;&#x53EF;&#x7528;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x5B58;&#x50A8;&#x548C;&#x8BBF;&#x95EE;&#x4F9D;&#x8D56;&#x6027;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x8FDB;&#x884C;&#x8C03;&#x5EA6;&#x3002;&#x52A8;&#x6001;&#x8C03;&#x5EA6;&#x6D88;&#x9664;&#x4E86;&#x66F4;&#x597D;&#x5730;&#x5C06;&#x51B3;&#x7B56;&#x7559;&#x7ED9;&#x673A;&#x5668;&#x7684;&#x4EBA;&#x4E3A;&#x74F6;&#x9888;&#x3002;&#x96C6;&#x7FA4;&#x8C03;&#x5EA6;&#x7A0B;&#x5E8F;&#x4ECE;&#x6240;&#x6709;&#x7CFB;&#x7EDF;&#x6536;&#x96C6;&#x8D44;&#x6E90;&#x4FE1;&#x606F;&#x5E76;&#x627E;&#x51FA;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6700;&#x4F73;&#x4F4D;&#x7F6E;&#x3002;</p>
<blockquote>
<p>&#x8BA9;&#x4EBA;&#x7C7B;&#x5B89;&#x6392;&#x7533;&#x8BF7;&#x5B89;&#x7F6E;&#x4E0D;&#x4F1A;&#x6269;&#x5927;&#x89C4;&#x6A21;&#x3002;&#x4EBA;&#x7C7B;&#x751F;&#x75C5;&#xFF0C;&#x4F11;&#x5047;&#xFF08;&#x6216;&#x81F3;&#x5C11;&#x4ED6;&#x4EEC;&#x5E94;&#x8BE5;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x5E38;&#x662F;&#x74F6;&#x9888;&#x3002;&#x968F;&#x7740;&#x89C4;&#x6A21;&#x548C;&#x590D;&#x6742;&#x6027;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x4EBA;&#x4EEC;&#x4E5F;&#x4E0D;&#x53EF;&#x80FD;&#x8BB0;&#x4F4F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x54EA;&#x91CC;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x8BB8;&#x591A;&#x516C;&#x53F8;&#x8BD5;&#x56FE;&#x901A;&#x8FC7;&#x62DB;&#x8058;&#x66F4;&#x591A;&#x4EBA;&#x6765;&#x6269;&#x5927;&#x89C4;&#x6A21;&#x3002;&#x8FD9;&#x52A0;&#x5267;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x8C03;&#x5EA6;&#x9700;&#x8981;&#x5728;&#x591A;&#x4E2A;&#x4EBA;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x534F;&#x8C03;&#x3002;&#x6700;&#x7EC8;&#xFF0C;&#x4EBA;&#x7C7B;&#x8C03;&#x5EA6;&#x5C06;&#x91C7;&#x7528;&#x7535;&#x5B50;&#x8868;&#x683C;&#xFF08;&#x6216;&#x7C7B;&#x4F3C;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF09;&#x6765;&#x4FDD;&#x5B58;&#x6BCF;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x8FD0;&#x884C;&#x4F4D;&#x7F6E;&#x3002;</p>
</blockquote>
<p>&#x52A8;&#x6001;&#x8C03;&#x5EA6;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x64CD;&#x4F5C;&#x5458;&#x65E0;&#x6CD5;&#x63A7;&#x5236;&#x3002;&#x57FA;&#x4E8E;&#x8C03;&#x5EA6;&#x5668;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x64CD;&#x4F5C;&#x5458;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x8986;&#x76D6;&#x6216;&#x5F3A;&#x5236;&#x8FDB;&#x884C;&#x8C03;&#x5EA6;&#x51B3;&#x7B56;&#x3002;&#x8986;&#x76D6;&#x548C;&#x624B;&#x52A8;&#x8D44;&#x6E90;&#x8C03;&#x5EA6;&#x5E94;&#x901A;&#x8FC7;API&#x63D0;&#x4F9B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F1A;&#x8BAE;&#x8BF7;&#x6C42;&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x662F;Google&#x7F16;&#x5199;&#x540D;&#x4E3A;Borg&#x7684;&#x5185;&#x90E8;&#x96C6;&#x7FA4;&#x8C03;&#x5EA6;&#x7A0B;&#x5E8F;&#x7684;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x3002;&#x5728;&#x535A;&#x683C;&#x7684;&#x7814;&#x7A76;&#x62A5;&#x544A;&#x4E2D;&#xFF0C;&#x8C37;&#x6B4C;&#x6307;&#x51FA;&#xFF1A;</p>
<p>Borg&#x63D0;&#x4F9B;&#x4E86;&#x4E09;&#x5927;&#x597D;&#x5904;&#xFF1A;&#xFF08;1&#xFF09;&#x9690;&#x85CF;&#x4E86;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x548C;&#x5931;&#x8D25;&#x5904;&#x7406;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x56E0;&#x6B64;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x4E13;&#x6CE8;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;; &#xFF08;2&#xFF09;&#x4EE5;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#x53EF;&#x9760;&#x6027;&#x548C;&#x53EF;&#x7528;&#x6027;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x652F;&#x6301;&#x76F8;&#x540C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;;&#x548C;&#xFF08;3&#xFF09;&#x8BA9;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x5730;&#x5728;&#x6570;&#x4EE5;&#x4E07;&#x8BA1;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x3002;</p>
<p>&#x8C03;&#x5EA6;&#x7A0B;&#x5E8F;&#x5728;&#x4EFB;&#x4F55;&#x4E91;&#x539F;&#x751F;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x89D2;&#x8272;&#x90FD;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x3002;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x8BF4;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x62BD;&#x8C61;&#x51FA;&#x8BB8;&#x591A;&#x673A;&#x5668;&#x5E76;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#x8D44;&#x6E90;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x670D;&#x52A1;&#x5668;&#x3002;</p>
<h3 id="&#x73AF;&#x5883;&#x9694;&#x79BB;">&#x73AF;&#x5883;&#x9694;&#x79BB;</h3>
<p>&#x5F53;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7531;&#x8BB8;&#x591A;&#x670D;&#x52A1;&#x7EC4;&#x6210;&#x65F6;&#xFF0C;&#x57FA;&#x7840;&#x7ED3;&#x6784;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x6765;&#x5B9A;&#x4E49;&#x4E0E;&#x6240;&#x6709;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x7684;&#x9694;&#x79BB;&#x3002;&#x4F20;&#x7EDF;&#x4E0A;&#xFF0C;&#x901A;&#x8FC7;&#x5C06;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x7F51;&#x7EDC;&#x6216;&#x7FA4;&#x96C6;&#x590D;&#x5236;&#x5230;&#x5F00;&#x53D1;&#x6216;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#x6765;&#x7BA1;&#x7406;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x5E94;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x73AF;&#x5883;&#x5728;&#x903B;&#x8F91;&#x4E0A;&#x5206;&#x79BB;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x5B8C;&#x5168;&#x96C6;&#x7FA4;&#x91CD;&#x590D;&#x3002;</p>
<p>&#x903B;&#x8F91;&#x5206;&#x5272;&#x73AF;&#x5883;&#x5141;&#x8BB8;&#x66F4;&#x597D;&#x5730;&#x5229;&#x7528;&#x786C;&#x4EF6;&#xFF0C;&#x51CF;&#x5C11;&#x91CD;&#x590D;&#x7684;&#x81EA;&#x52A8;&#x5316;&#xFF0C;&#x5E76;&#x4E14;&#x66F4;&#x5BB9;&#x6613;&#x6D4B;&#x8BD5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9700;&#x8981;&#x5355;&#x72EC;&#x7684;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x4F4E;&#x7EA7;&#x522B;&#x66F4;&#x6539;&#x65F6;&#xFF09;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6D4B;&#x8BD5;&#x4E0D;&#x662F;&#x5E94;&#x8BE5;&#x8981;&#x6C42;&#x5B8C;&#x6574;&#x7684;&#x91CD;&#x590D;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x73AF;&#x5883;&#x53EF;&#x4EE5;&#x662F;&#x4F20;&#x7EDF;&#x7684;&#x6C38;&#x4E45;&#x6027;&#x5F00;&#x53D1;&#xFF0C;&#x6D4B;&#x8BD5;&#xFF0C;&#x9636;&#x6BB5;&#x548C;&#x751F;&#x4EA7;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x52A8;&#x6001;&#x5206;&#x652F;&#x6216;&#x57FA;&#x4E8E;&#x63D0;&#x4EA4;&#x7684;&#x3002;&#x5B83;&#x4EEC;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x662F;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x901A;&#x8FC7;&#x52A8;&#x6001;&#x914D;&#x7F6E;&#x548C;&#x5B9E;&#x4F8B;&#x9009;&#x62E9;&#x6027;&#x8DEF;&#x7531;&#x542F;&#x7528;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x73AF;&#x5883;&#x5E94;&#x7531;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x9700;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#xFF0C;&#x670D;&#x52A1;&#x548C;&#x7F51;&#x7EDC;&#x8D44;&#x6E90;&#x7EC4;&#x6210;&#x3002;&#x8FD9;&#x5305;&#x62EC;&#x8BF8;&#x5982;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6587;&#x4EF6;&#x5171;&#x4EAB;&#x548C;&#x4EFB;&#x4F55;&#x5916;&#x90E8;&#x670D;&#x52A1;&#x4E4B;&#x7C7B;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x5F00;&#x9500;&#x975E;&#x5E38;&#x4F4E;&#x7684;&#x73AF;&#x5883;&#x3002;</p>
<p>&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x63D0;&#x4F9B;&#x73AF;&#x5883;&#xFF0C;&#x4F46;&#x5B83;&#x88AB;&#x4F7F;&#x7528;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E94;&#x9075;&#x5FAA;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF0C;&#x5141;&#x8BB8;&#x7075;&#x6D3B;&#x914D;&#x7F6E;&#x4EE5;&#x652F;&#x6301;&#x73AF;&#x5883;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x53D1;&#x73B0;&#x652F;&#x6301;&#x670D;&#x52A1;&#x7684;&#x7AEF;&#x70B9;&#x3002;</p>
<h3 id="&#x670D;&#x52A1;&#x53D1;&#x73B0;">&#x670D;&#x52A1;&#x53D1;&#x73B0;</h3>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x51E0;&#x4E4E;&#x53EF;&#x4EE5;&#x80AF;&#x5B9A;&#x4F9D;&#x9760;&#x4E00;&#x9879;&#x6216;&#x591A;&#x9879;&#x670D;&#x52A1;&#x6765;&#x63D0;&#x4F9B;&#x5546;&#x4E1A;&#x5229;&#x76CA;&#x3002;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x8D23;&#x4EFB;&#x662F;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x670D;&#x52A1;&#x5728;&#x6BCF;&#x4E2A;&#x73AF;&#x5883;&#x57FA;&#x7840;&#x4E0A;&#x627E;&#x5230;&#x5F7C;&#x6B64;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x67D0;&#x4E9B;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x9700;&#x8981;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;API&#x8C03;&#x7528;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x5219;&#x901A;&#x8FC7;DNS&#x6216;&#x7F51;&#x7EDC;&#x4EE3;&#x7406;&#x900F;&#x660E;&#x5730;&#x8FDB;&#x884C;&#x3002;&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#x5DE5;&#x5177;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x670D;&#x52A1;&#x4F7F;&#x7528;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x5F88;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x662F;&#x6700;&#x53E4;&#x8001;&#x7684;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x4E4B;&#x4E00;&#xFF08;&#x5373;ARP&#x548C;DNS&#xFF09;&#xFF0C;&#x4F46;&#x5B83;&#x7ECF;&#x5E38;&#x88AB;&#x5FFD;&#x89C6;&#x5E76;&#x4E14;&#x672A;&#x88AB;&#x5229;&#x7528;&#x3002;&#x5728;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x6216;&#x4EE3;&#x7801;&#x4E2D;&#x9759;&#x6001;&#x5B9A;&#x4E49;&#x670D;&#x52A1;&#x7AEF;&#x70B9;&#x4E0D;&#x53EF;&#x6269;&#x5C55;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x9002;&#x5408;&#x4E91;&#x539F;&#x751F;&#x73AF;&#x5883;&#x3002;&#x7AEF;&#x70B9;&#x6CE8;&#x518C;&#x5E94;&#x8BE5;&#x5728;&#x521B;&#x5EFA;&#x670D;&#x52A1;&#x65F6;&#x81EA;&#x52A8;&#x53D1;&#x751F;&#xFF0C;&#x5E76;&#x4E14;&#x7AEF;&#x70B9;&#x53EF;&#x7528;&#x6216;&#x6D88;&#x5931;&#x3002;</p>
<p>&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0E;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#x4EE5;&#x53D1;&#x73B0;&#x5176;&#x76F8;&#x5173;&#x670D;&#x52A1;&#x3002;&#x8FD9;&#x4E9B;&#x5305;&#x62EC;&#x4F46;&#x4E0D;&#x9650;&#x4E8E;DNS&#xFF0C;&#x4E91;&#x5143;&#x6570;&#x636E;&#x670D;&#x52A1;&#x6216;&#x72EC;&#x7ACB;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x5DE5;&#x5177;&#xFF08;&#x5373;etcd&#x548C;consul&#xFF09;&#x3002;</p>
<h3 id="&#x72B6;&#x6001;&#x7BA1;&#x7406;">&#x72B6;&#x6001;&#x7BA1;&#x7406;</h3>
<p>&#x72B6;&#x6001;&#x7BA1;&#x7406;&#x662F;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x5982;&#x4F55;&#x77E5;&#x9053;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5B9E;&#x4F8B;&#x9700;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x7684;&#x8BDD;&#x3002;&#x8FD9;&#x4E0E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x751F;&#x547D;&#x5468;&#x671F;&#x622A;&#x7136;&#x4E0D;&#x540C;&#xFF0C;&#x56E0;&#x4E3A;&#x751F;&#x547D;&#x5468;&#x671F;&#x9002;&#x7528;&#x4E8E;&#x6574;&#x4E2A;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x72B6;&#x6001;&#x9002;&#x7528;&#x4E8E;&#x542F;&#x52A8;&#x548C;&#x505C;&#x6B62;&#x7684;&#x5B9E;&#x4F8B;&#x3002;</p>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6709;&#x8D23;&#x4EFB;&#x63D0;&#x4F9B;API&#x6216;&#x94A9;&#x5B50;&#xFF0C;&#x4EE5;&#x4FBF;&#x68C0;&#x67E5;&#x5176;&#x5F53;&#x524D;&#x72B6;&#x6001;&#x3002;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x8D23;&#x4EFB;&#x662F;&#x76D1;&#x89C6;&#x5B9E;&#x4F8B;&#x7684;&#x5F53;&#x524D;&#x72B6;&#x6001;&#x5E76;&#x91C7;&#x53D6;&#x76F8;&#x5E94;&#x7684;&#x884C;&#x52A8;&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x662F;&#x4E00;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x72B6;&#x6001;&#xFF1A;</p>
<ul>
<li>&#x5DF2;&#x63D0;&#x4EA4;</li>
<li>&#x9884;&#x5B9A;</li>
<li>&#x51C6;&#x5907;&#x597D;&#x4E86;<ul>
<li>&#x5065;&#x5EB7;</li>
</ul>
</li>
<li>&#x4E0D;&#x5065;&#x5EB7;</li>
<li>&#x7EC8;&#x6B62;</li>
</ul>
<p>&#x5404;&#x5DDE;&#x548C;&#x76F8;&#x5E94;&#x884C;&#x52A8;&#x7684;&#x7B80;&#x8981;&#x6982;&#x8FF0;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>1.&#x7533;&#x8BF7;&#x63D0;&#x4EA4;&#x8FD0;&#x884C;&#x3002;
2.&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x68C0;&#x67E5;&#x8BF7;&#x6C42;&#x7684;&#x8D44;&#x6E90;&#x5E76;&#x5B89;&#x6392;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;
&#x5F53;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x542F;&#x52A8;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x51C6;&#x5907;&#x597D;/&#x672A;&#x51C6;&#x5907;&#x597D;&#x7684;&#x72B6;&#x6001;&#x3002;
3.&#x57FA;&#x7840;&#x67B6;&#x6784;&#x5C06;&#x7B49;&#x5F85;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#xFF0C;&#x7136;&#x540E;&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8D44;&#x6E90;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5C06;&#x5B9E;&#x4F8B;&#x6DFB;&#x52A0;&#x5230;&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x5668;&#xFF09;&#x3002;
&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x6307;&#x5B9A;&#x7684;&#x8D85;&#x65F6;&#x4E4B;&#x524D;&#x672A;&#x51C6;&#x5907;&#x597D;&#xFF0C;&#x57FA;&#x7840;&#x7ED3;&#x6784;&#x5C06;&#x7EC8;&#x6B62;&#x5B83;&#x5E76;&#x5B89;&#x6392;&#x65B0;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5B9E;&#x4F8B;&#x3002;
4.&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x51C6;&#x5907;&#x5C31;&#x7EEA;&#x540E;&#xFF0C;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x5C06;&#x76D1;&#x89C6;&#x6D3B;&#x52A8;&#x72B6;&#x6001;&#x5E76;&#x7B49;&#x5F85;&#x4E0D;&#x5065;&#x5EB7;&#x72B6;&#x6001;&#xFF0C;&#x6216;&#x8005;&#x76F4;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8BBE;&#x7F6E;&#x4E3A;&#x4E0D;&#x518D;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x6BD4;&#x5217;&#x51FA;&#x7684;&#x56FD;&#x5BB6;&#x8FD8;&#x591A;&#x3002;&#x5982;&#x679C;&#x8981;&#x5BF9;&#x56FD;&#x5BB6;&#x8FDB;&#x884C;&#x6B63;&#x786E;&#x7684;&#x68C0;&#x67E5;&#x548C;&#x91C7;&#x53D6;&#x884C;&#x52A8;&#xFF0C;&#x5404;&#x56FD;&#x9700;&#x8981;&#x5F97;&#x5230;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x652F;&#x6301;&#x3002; Kubernetes&#x901A;&#x8FC7;&#x4E8B;&#x4EF6;&#xFF0C;&#x63A2;&#x6D4B;&#x548C;&#x6302;&#x94A9;&#x5B9E;&#x73B0;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x72B6;&#x6001;&#x7BA1;&#x7406;&#xFF0C;&#x4F46;&#x662F;&#x6BCF;&#x4E2A;&#x7F16;&#x6392;&#x5E73;&#x53F0;&#x90FD;&#x5E94;&#x8BE5;&#x5177;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7BA1;&#x7406;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x5F53;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x88AB;&#x63D0;&#x4EA4;&#xFF0C;&#x8BA1;&#x5212;&#x6216;&#x7F29;&#x653E;&#x65F6;&#xFF0C;&#x89E6;&#x53D1;Kubernetes&#x4E8B;&#x4EF6;&#x3002;&#x63A2;&#x6D4B;&#x5668;&#x7528;&#x4E8E;&#x68C0;&#x67E5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F55;&#x65F6;&#x51C6;&#x5907;&#x597D;&#x63D0;&#x4F9B;&#x6D41;&#x91CF;&#xFF08;&#x51C6;&#x5907;&#x5C31;&#x7EEA;&#xFF09;&#x5E76;&#x786E;&#x4FDD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5065;&#x5EB7;&#xFF08;&#x6D3B;&#x8DC3;&#xFF09;&#x3002;&#x6302;&#x94A9;&#x7528;&#x4E8E;&#x5728;&#x8FDB;&#x7A0B;&#x542F;&#x52A8;&#x4E4B;&#x524D;&#x6216;&#x4E4B;&#x540E;&#x9700;&#x8981;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x4EF6;&#x3002;</p>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5B9E;&#x4F8B;&#x7684;&#x72B6;&#x6001;&#x4E0E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x751F;&#x547D;&#x5468;&#x671F;&#x7BA1;&#x7406;&#x540C;&#x6837;&#x91CD;&#x8981;&#x3002;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x5728;&#x786E;&#x4FDD;&#x5B9E;&#x4F8B;&#x53EF;&#x7528;&#x5E76;&#x636E;&#x6B64;&#x91C7;&#x53D6;&#x884C;&#x52A8;&#x65B9;&#x9762;&#x8D77;&#x7740;&#x5173;&#x952E;&#x4F5C;&#x7528;&#x3002;</p>
<h3 id="&#x76D1;&#x63A7;&#x548C;&#x8BB0;&#x5F55;">&#x76D1;&#x63A7;&#x548C;&#x8BB0;&#x5F55;</h3>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x5E94;&#x8BE5;&#x8981;&#x6C42;&#x88AB;&#x76D1;&#x89C6;&#x6216;&#x8BB0;&#x5F55;;&#x4ED6;&#x4EEC;&#x662F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8FD0;&#x884C;&#x7684;&#x57FA;&#x672C;&#x5047;&#x8BBE;&#x3002;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#xFF0C;&#x7528;&#x4E8E;&#x76D1;&#x89C6;&#x548C;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x7684;&#x914D;&#x7F6E;&#x5E94;&#x8BE5;&#x4EE5;&#x4E0E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8D44;&#x6E90;&#x8BF7;&#x6C42;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x58F0;&#x660E;&#x4E3A;&#x4EE3;&#x7801;&#x3002;&#x5982;&#x679C;&#x60A8;&#x62E5;&#x6709;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6240;&#x6709;&#x81EA;&#x52A8;&#x5316;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x65E0;&#x6CD5;&#x52A8;&#x6001;&#x76D1;&#x89C6;&#x670D;&#x52A1;&#xFF0C;&#x5219;&#x4ECD;&#x6709;&#x5F85;&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x72B6;&#x6001;&#x7BA1;&#x7406;&#xFF08;&#x5373;&#x8FDB;&#x7A0B;&#x5065;&#x5EB7;&#x68C0;&#x67E5;&#xFF09;&#x548C;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x5904;&#x7406;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5404;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;&#x65E5;&#x5FD7;&#x7CFB;&#x7EDF;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x6839;&#x636E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x73AF;&#x5883;&#xFF0C;&#x6807;&#x7B7E;&#x6216;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x6709;&#x7528;&#x7684;&#x5143;&#x6570;&#x636E;&#x6574;&#x5408;&#x65E5;&#x5FD7;&#x3002;</p>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E94;&#x8BE5;&#x5C3D;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x5355;&#x70B9;&#x6545;&#x969C;&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x8BE5;&#x8FD0;&#x884C;&#x591A;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6709;100&#x4E2A;&#x5B9E;&#x4F8B;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#xFF0C;&#x5219;&#x5982;&#x679C;&#x5355;&#x4E2A;&#x5B9E;&#x4F8B;&#x53D8;&#x5F97;&#x4E0D;&#x5065;&#x5EB7;&#xFF0C;&#x5219;&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#x4E0D;&#x5E94;&#x89E6;&#x53D1;&#x8B66;&#x62A5;&#x3002;</p>
<p>&#x76D1;&#x89C6;&#x4ECE;&#x6574;&#x4F53;&#x4E0A;&#x770B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x7528;&#x4E8E;&#x8C03;&#x8BD5;&#x548C;&#x9A8C;&#x8BC1;&#x6240;&#x9700;&#x7684;&#x72B6;&#x6001;.5&#x76D1;&#x89C6;&#x4E0E;&#x8B66;&#x62A5;&#x4E0D;&#x540C;&#xFF0C;&#x56E0;&#x4E3A;&#x5E94;&#x6839;&#x636E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5EA6;&#x91CF;&#x548C;SLO&#x89E6;&#x53D1;&#x8B66;&#x62A5;&#x3002;</p>
<h3 id="&#x5EA6;&#x91CF;&#x805A;&#x5408;">&#x5EA6;&#x91CF;&#x805A;&#x5408;</h3>
<p>&#x8981;&#x77E5;&#x9053;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5904;&#x4E8E;&#x5065;&#x5EB7;&#x72B6;&#x6001;&#x65F6;&#x7684;&#x884C;&#x4E3A;&#x65B9;&#x5F0F;&#xFF0C;&#x4ED6;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x6307;&#x6807;&#x3002;&#x4ED6;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x6709;&#x5173;&#x4E0D;&#x5065;&#x5EB7;&#x65F6;&#x53EF;&#x80FD;&#x88AB;&#x7834;&#x574F;&#x7684;&#x4FE1;&#x606F;&#x7684;&#x6D1E;&#x5BDF; - &#x5E76;&#x4E14;&#x5C31;&#x50CF;&#x76D1;&#x89C6;&#x4E00;&#x6837;&#xFF0C;&#x6536;&#x96C6;&#x7684;&#x5EA6;&#x91CF;&#x5E94;&#x4F5C;&#x4E3A;&#x4EE3;&#x7801;&#x4F5C;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5B9A;&#x4E49;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x88AB;&#x8BF7;&#x6C42;&#x3002;</p>
<p>&#x57FA;&#x7840;&#x67B6;&#x6784;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x6536;&#x96C6;&#x6709;&#x5173;&#x8D44;&#x6E90;&#x5229;&#x7528;&#x7387;&#x7684;&#x6307;&#x6807;6&#xFF0C;&#x4F46;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6709;&#x8D23;&#x4EFB;&#x5448;&#x73B0;&#x670D;&#x52A1;&#x7EA7;&#x522B;&#x6307;&#x6807;&#x7684;&#x6307;&#x6807;&#x3002;</p>
<p>&#x867D;&#x7136;&#x76D1;&#x6D4B;&#x548C;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x72B6;&#x51B5;&#x68C0;&#x67E5;&#xFF0C;&#x4F46;&#x6307;&#x6807;&#x53EF;&#x63D0;&#x4F9B;&#x6240;&#x9700;&#x7684;&#x9065;&#x6D4B;&#x6570;&#x636E;&#x3002;&#x6CA1;&#x6709;&#x6307;&#x6807;&#xFF0C;&#x5C31;&#x65E0;&#x6CD5;&#x77E5;&#x9053;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F;&#x5426;&#x6EE1;&#x8DB3;&#x670D;&#x52A1;&#x7EA7;&#x522B;&#x76EE;&#x6807;&#x4EE5;&#x63D0;&#x4F9B;&#x4E1A;&#x52A1;&#x4EF7;&#x503C;&#x3002;</p>
<blockquote>
<p>&#x4ECE;&#x65E5;&#x5FD7;&#x4E2D;&#x63D0;&#x53D6;&#x9065;&#x6D4B;&#x548C;&#x5065;&#x5EB7;&#x68C0;&#x67E5;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x5F88;&#x8BF1;&#x4EBA;&#xFF0C;&#x4F46;&#x8981;&#x5C0F;&#x5FC3;&#xFF0C;&#x56E0;&#x4E3A;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x9700;&#x8981;&#x540E;&#x5904;&#x7406;&#xFF0C;&#x5E76;&#x4E14;&#x6BD4;&#x7279;&#x5B9A;&#x4E8E;&#x5E94;&#x7528;&#x7684;&#x5EA6;&#x91CF;&#x6807;&#x51C6;&#x7AEF;&#x70B9;&#x9700;&#x8981;&#x66F4;&#x591A;&#x5F00;&#x9500;&#x3002;</p>
<p>&#x5728;&#x6536;&#x96C6;&#x6307;&#x6807;&#x65F6;&#xFF0C;&#x60A8;&#x5E0C;&#x671B;&#x5C3D;&#x53EF;&#x80FD;&#x63A5;&#x8FD1;&#x5B9E;&#x65F6;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x6269;&#x5C55;&#x7684;&#x7B80;&#x5355;&#x4E14;&#x4F4E;&#x5F00;&#x9500;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x65E5;&#x5FD7;&#x8FDB;&#x884C;&#x8C03;&#x8BD5;&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x8BE5;&#x9884;&#x8BA1;&#x6570;&#x636E;&#x5904;&#x7406;&#x7684;&#x5EF6;&#x8FDF;&#x3002;</p>
</blockquote>
<p>&#x4E0E;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x7C7B;&#x4F3C;&#xFF0C;&#x5EA6;&#x91CF;&#x6807;&#x51C6;&#x901A;&#x5E38;&#x5728;&#x5B9E;&#x4F8B;&#x7EA7;&#x6536;&#x96C6;&#xFF0C;&#x7136;&#x540E;&#x6C47;&#x603B;&#x5728;&#x4E00;&#x8D77;&#x4EE5;&#x63D0;&#x4F9B;&#x5B8C;&#x6574;&#x670D;&#x52A1;&#x7684;&#x89C6;&#x56FE;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5355;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x63D0;&#x4F9B;&#x6536;&#x96C6;&#x5EA6;&#x91CF;&#x6807;&#x51C6;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x5206;&#x6790;&#xFF0C;&#x6574;&#x5408;&#x548C;&#x5B58;&#x50A8;&#x5EA6;&#x91CF;&#x6807;&#x51C6;&#x3002;&#x6536;&#x96C6;&#x6307;&#x6807;&#x7684;&#x7AEF;&#x70B9;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x6BCF;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x914D;&#x7F6E;&#xFF0C;&#x4F46;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x5E94;&#x8BE5;&#x6807;&#x51C6;&#x5316;&#xFF0C;&#x4EE5;&#x4FBF;&#x53EF;&#x4EE5;&#x5728;&#x5355;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E2D;&#x67E5;&#x770B;&#x6240;&#x6709;&#x6307;&#x6807;&#x3002;</p>
<h3 id="&#x8C03;&#x8BD5;&#x548C;&#x8DDF;&#x8E2A;">&#x8C03;&#x8BD5;&#x548C;&#x8DDF;&#x8E2A;</h3>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x5F88;&#x5BB9;&#x6613;&#x8C03;&#x8BD5;&#x3002;&#x96C6;&#x6210;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#xFF08;IDE&#xFF09;&#xFF0C;&#x4EE3;&#x7801;&#x65AD;&#x70B9;&#x4EE5;&#x53CA;&#x5728;&#x8C03;&#x8BD5;&#x6A21;&#x5F0F;&#x4E0B;&#x8FD0;&#x884C;&#x90FD;&#x662F;&#x5DE5;&#x7A0B;&#x5E08;&#x5728;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7684;&#x6240;&#x6709;&#x5DE5;&#x5177;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x90E8;&#x7F72;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6765;&#x8BF4;&#xFF0C;&#x5185;&#x7701;&#x8981;&#x56F0;&#x96BE;&#x5F97;&#x591A;&#x3002;&#x5F53;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7531;&#x6570;&#x5341;&#x6216;&#x6570;&#x767E;&#x4E2A;&#x5FAE;&#x670D;&#x52A1;&#x6216;&#x72EC;&#x7ACB;&#x90E8;&#x7F72;&#x7684;&#x529F;&#x80FD;&#x7EC4;&#x6210;&#x65F6;&#xFF0C;&#x6B64;&#x95EE;&#x9898;&#x66F4;&#x4E3A;&#x4E25;&#x91CD;&#x3002;&#x5F53;&#x7528;&#x591A;&#x79CD;&#x8BED;&#x8A00;&#x548C;&#x4E0D;&#x540C;&#x7684;&#x56E2;&#x961F;&#x7F16;&#x5199;&#x670D;&#x52A1;&#x65F6;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x5C06;&#x5DE5;&#x5177;&#x5185;&#x7F6E;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x3002;</p>
<p>&#x57FA;&#x7840;&#x67B6;&#x6784;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x8C03;&#x8BD5;&#x6574;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x5355;&#x4E2A;&#x670D;&#x52A1;&#x3002;&#x8C03;&#x8BD5;&#x6709;&#x65F6;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x7CFB;&#x7EDF;&#x5B8C;&#x6210;&#xFF0C;&#x4F46;&#x662F;&#x590D;&#x5236;&#x9519;&#x8BEF;&#x9700;&#x8981;&#x8F83;&#x77ED;&#x7684;&#x53CD;&#x9988;&#x5FAA;&#x73AF;&#x3002;</p>
<p>&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x8C03;&#x8BD5;&#x662F;&#x52A8;&#x6001;&#x914D;&#x7F6E;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x4F7F;&#x7528;&#x3002;&#x5F53;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5207;&#x6362;&#x5230;&#x8BE6;&#x7EC6;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#xFF0C;&#x5E76;&#x4E14;&#x6D41;&#x91CF;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7406;&#x6709;&#x9009;&#x62E9;&#x5730;&#x8DEF;&#x7531;&#x5230;&#x5B9E;&#x4F8B;&#x3002;</p>
<p>&#x5982;&#x679C;&#x95EE;&#x9898;&#x65E0;&#x6CD5;&#x901A;&#x8FC7;&#x65E5;&#x5FD7;&#x8F93;&#x51FA;&#x89E3;&#x51B3;&#xFF0C;&#x90A3;&#x4E48;&#x5206;&#x5E03;&#x5F0F;&#x8DDF;&#x8E2A;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x754C;&#x9762;&#x6765;&#x53EF;&#x89C6;&#x5316;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5206;&#x5E03;&#x5F0F;&#x8DDF;&#x8E2A;&#x7CFB;&#x7EDF;&#xFF08;&#x5982;OpenTracing&#xFF09;&#x53EF;&#x4EE5;&#x8865;&#x5145;&#x65E5;&#x5FD7;&#x4EE5;&#x5E2E;&#x52A9;&#x4EBA;&#x7C7B;&#x8C03;&#x8BD5;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x8DDF;&#x8E2A;&#x4E3A;&#x8C03;&#x8BD5;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x77ED;&#x7684;&#x53CD;&#x9988;&#x56DE;&#x8DEF;&#x3002;&#x5982;&#x679C;&#x5B83;&#x4E0D;&#x80FD;&#x6784;&#x5EFA;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE3;&#x7406;&#x6216;&#x6D41;&#x91CF;&#x5206;&#x6790;&#x7531;&#x57FA;&#x7840;&#x7ED3;&#x6784;&#x900F;&#x660E;&#x5730;&#x5B8C;&#x6210;&#x3002;&#x5F53;&#x60A8;&#x5927;&#x89C4;&#x6A21;&#x5730;&#x8FD0;&#x884C;&#x4EFB;&#x4F55;&#x534F;&#x8C03;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x57FA;&#x7840;&#x7ED3;&#x6784;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x8C03;&#x8BD5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x8BBE;&#x7F6E;&#x8DDF;&#x8E2A;&#x6709;&#x5F88;&#x591A;&#x597D;&#x5904;&#x548C;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x5728;&#x6B64;&#x8BA8;&#x8BBA;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8DDF;&#x8E2A;&#x4E00;&#x76F4;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x8D8A;&#x6765;&#x8D8A;&#x56F0;&#x96BE;&#x3002;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x53EF;&#x4EE5;&#x900F;&#x660E;&#x65B9;&#x5F0F;&#x8DE8;&#x8D8A;&#x591A;&#x4E2A;&#x670D;&#x52A1;&#x7684;&#x8DDF;&#x8E2A;&#x3002;</p>
<h2 id="&#x7ED3;&#x8BBA;">&#x7ED3;&#x8BBA;</h2>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x6C42;&#x5DF2;&#x7ECF;&#x6539;&#x53D8;&#xFF1A;&#x5E26;&#x6709;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x8F6F;&#x4EF6;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5DF2;&#x7ECF;&#x4E0D;&#x591F;&#x7528;&#x4E86;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x73B0;&#x5728;&#x9700;&#x8981;&#x534F;&#x8C03;&#x670D;&#x52A1;&#x548C;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x62BD;&#x8C61;&#x3002;&#x62BD;&#x8C61;&#x5141;&#x8BB8;&#x8D44;&#x6E90;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x5206;&#x79BB;&#x5E76;&#x6839;&#x636E;&#x9700;&#x8981;&#x4EE5;&#x7F16;&#x7A0B;&#x65B9;&#x5F0F;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x672C;&#x7AE0;&#x4E2D;&#x63D0;&#x51FA;&#x7684;&#x8981;&#x6C42;&#x5E76;&#x4E0D;&#x662F;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x7684;&#x6240;&#x6709;&#x670D;&#x52A1;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x662F;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x671F;&#x671B;&#x7684;&#x57FA;&#x7840;&#x3002;&#x5982;&#x679C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E0D;&#x63D0;&#x4F9B;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#xFF0C;&#x90A3;&#x4E48;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x4E0D;&#x5F97;&#x4E0D;&#x5B9E;&#x65BD;&#x5B83;&#x4EEC;&#xFF0C;&#x5426;&#x5219;&#x5B83;&#x4EEC;&#x5C06;&#x65E0;&#x6CD5;&#x8FBE;&#x5230;&#x73B0;&#x4EE3;&#x4E1A;&#x52A1;&#x6240;&#x9700;&#x7684;&#x89C4;&#x6A21;&#x548C;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E0D;&#x4F1A;&#x81EA;&#x884C;&#x53D1;&#x5C55;;&#x4EBA;&#x4EEC;&#x9700;&#x8981;&#x6539;&#x53D8;&#x4ED6;&#x4EEC;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x5E76;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x60F3;&#x5230;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x6709;&#x4E9B;&#x9879;&#x76EE;&#x5EFA;&#x7ACB;&#x5728;&#x5F00;&#x521B;&#x8FD9;&#x4E9B;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x516C;&#x53F8;&#x7684;&#x7ECF;&#x9A8C;&#x4E4B;&#x4E0A;&#x3002;</p>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F9D;&#x8D56;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7684;&#x529F;&#x80FD;&#x548C;&#x670D;&#x52A1;&#x6765;&#x652F;&#x6301;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x3002;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x8981;&#x6C42;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x516C;&#x5F00;&#x7AEF;&#x70B9;&#x548C;&#x96C6;&#x6210;&#x4EE5;&#x81EA;&#x4E3B;&#x7BA1;&#x7406;&#x3002;&#x5DE5;&#x7A0B;&#x5E08;&#x5E94;&#x5C3D;&#x53EF;&#x80FD;&#x4F7F;&#x7528;&#x73B0;&#x6709;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5E76;&#x8BBE;&#x8BA1;&#x51FA;&#x6709;&#x5F39;&#x6027;&#x7684;&#x7B80;&#x5355;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; 2018 cloudnativego.com all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification"> Updated at 
2018-04-01 23:38:28
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch06-testing-cloud-native-infrastructure.html" class="navigation navigation-prev " aria-label="Previous page: 第6章 测试云原生基础架构">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch08-securing-applications.html" class="navigation navigation-next " aria-label="Next page: 第8章 保护应用程序">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第7章 管理云原生应用程序","level":"1.10","depth":1,"next":{"title":"第8章 保护应用程序","level":"1.11","depth":1,"path":"ch08-securing-applications.md","ref":"ch08-securing-applications.md","articles":[]},"previous":{"title":"第6章 测试云原生基础架构","level":"1.9","depth":1,"path":"ch06-testing-cloud-native-infrastructure.md","ref":"ch06-testing-cloud-native-infrastructure.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","codesnippet","splitter","page-toc-button","editlink","back-to-top-button","-lunr","-search","search-plus","github-buttons@2.1.0","favicon@^0.0.2","tbfed-pagefooter@^0.0.1","3-ba","theme-default","-highlight","prism","prism-themes"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © 2018 cloudnativego.com","modify_label":" Updated at ","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prism-themes/themes/prism-ghcolors.css"]},"github":{"url":"https://github.com/CloudNativeInfra/CNI"},"editlink":{"label":"Edit this page","multilingual":false,"base":"https://github.com/CloudNativeInfra/CNI/blob/master/cn"},"splitter":{},"codesnippet":{},"fontsettings":{"theme":"white","family":"sans","size":2},"favicon":{"shortcut":"favicon.ico","bookmark":"favicon.ico"},"page-toc-button":{},"back-to-top-button":{},"prism-themes":{},"github-buttons":{"repo":"CloudNativeInfra/CNI","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"c889b4cfd2df3f575151a52b18610b26"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"search-plus":{}},"theme":"default","author":"cloudnativego.com","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"云原生基础架构 - cloudnativego.com","language":"cn","links":{"sidebar":{"CloudNativeGo":"https://cloudnativego.com"}},"gitbook":"*","description":"云原生基础架构|Cloud Native Infrastructure|cloudnativego.com"},"file":{"path":"ch07-managing-cloud-native-applications.md","mtime":"2018-04-01T15:38:28.168Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2018-04-01T16:33:05.262Z"},"basePath":".","book":{"language":"cn"}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

